index.org
#+TITLE: Doom Emacs ABCs
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: num:nil

* Overview
:PROPERTIES:
:CUSTOM_ID: OVERVIEW
:END:
** SPC RET 
#+NAME: SPCRET
| Key       | Command       |
|-----------+---------------|
| ~SPC RET~ | [[#7936b19a-9919-4a32-807c-ecf9dd289a82][bookmark-jump]] |
** SPC SPC 
#+NAME: SPCSPC
| Key       | Command              |
|-----------+----------------------|
| ~SPC SPC~ | [[#4713167e-f20a-4651-890d-3f92c3a79651][projectile-find-file]] |
** SPC ' 
#+NAME: SPC'
| Key     | Command    |
|---------+------------|
| ~SPC '~ | [[#c8a625ed-3383-4f8a-bd85-35fb950a75e1][ivy-resume]] |
** SPC , 
#+NAME: SPC,
| Key     | Command                |
|---------+------------------------|
| ~SPC ,~ | [[#d16eacde-6905-4cd9-835d-ba3953329aee][persp-switch-to-buffer]] |
** SPC . 
#+NAME: SPC.
| Key     | Command   |
|---------+-----------|
| ~SPC .~ | [[#39ec3fd1-540f-4560-8e87-be4b99176816][find-file]] |
** SPC : 
#+NAME: SPC:
| Key     | Command                  |
|---------+--------------------------|
| ~SPC :~ | [[#ad1749ea-3bed-4e19-98e3-970347cf0283][execute-extended-command]] |
** SPC ; 
#+NAME: SPC;
| Key     | Command         |
|---------+-----------------|
| ~SPC ;~ | [[#c224b829-388d-45df-b6bd-19f844e45bef][eval-expression]] |
** SPC < 
#+NAME: SPC<
| Key     | Command          |
|---------+------------------|
| ~SPC <~ | [[#71111500-75ee-4a40-aa12-0a2926cb1271][switch-to-buffer]] |
** SPC X 
#+NAME: SPCX
| Key     | Command     |
|---------+-------------|
| ~SPC X~ | [[#006737f1-ad10-4cf4-bccf-c1e66bd3cdad][org-capture]] |
** SPC u 
#+NAME: SPCu
| Key     | Command            |
|---------+--------------------|
| ~SPC u~ | [[#e1cccaea-a301-44c5-8ca4-6bff866b22ea][universal-argument]] |
** SPC x 
#+NAME: SPCx
| Key     | Command                  |
|---------+--------------------------|
| ~SPC x~ | [[#8c7db950-b793-45e0-8101-7ee41ff11c92][doom/open-scratch-buffer]] |
** SPC ~ 
#+NAME: SPC~
| Key     | Command       |
|---------+---------------|
| ~SPC ~~ | [[#b6d4765b-9eb8-41f6-a3a9-2db456b42e37][+popup/toggle]] |
** SPC DEL 
#+NAME: SPCDEL
| Key       | Command                 |
|-----------+-------------------------|
| ~SPC DEL~ | [[#f110201c-49d0-4041-806b-84072bee6352][+nav-flash/blink-cursor]] |
** SPC t 
#+NAME: SPCt
| Key       | Command                  |
|-----------+--------------------------|
| ~SPC t b~ | [[#7877ad19-4225-4137-b37f-b3fb6d445cd0][doom-big-font-mode]]       |
| ~SPC t f~ | [[#cf79b310-5340-4cc6-acf3-183d0d6f71f3][flycheck-mode]]            |
| ~SPC t g~ | [[#d2f0ecdf-b69d-4918-bec1-993edb3e302b][evil-goggles-mode]]        |
| ~SPC t l~ | [[#90e112e3-64bc-4247-a74b-b4b1da799018][doom/toggle-line-numbers]] |
| ~SPC t p~ | [[#3ead99f5-ba3d-47bf-a795-02272a000b6a][+org-present/start]]       |
| ~SPC t s~ | [[#090e14b7-ab60-42dd-8511-1c7656e87166][flyspell-mode]]            |
| ~SPC t F~ | [[#0f780fa8-2f15-4077-9934-57fc3e8f0898][toggle-frame-fullscreen]]  |
** SPC s 
#+NAME: SPCs
| Key       | Command                |
|-----------+------------------------|
| ~SPC s S~ | [[#889b267b-7414-4d9c-b4cb-387d4e9a6999][+snippets/browse]]       |
| ~SPC s c~ | [[#9d955af1-310d-4784-a1bc-d327e7341781][aya-create]]             |
| ~SPC s e~ | [[#b9124888-c7c2-4e01-8b0f-a1bc7b0aced9][aya-expand]]             |
| ~SPC s i~ | [[#d805ed3b-78c5-456a-bae0-4321f8a003cc][yas-insert-snippet]]     |
| ~SPC s n~ | [[#4d74ec66-e879-41f4-9163-ea1359c56bba][yas-new-snippet]]        |
| ~SPC s r~ | [[#c3f81cf7-900e-495d-a9a1-436b993c599b][yas-reload-all]]         |
| ~SPC s s~ | [[#9a2dd41f-1e7a-4ec9-a341-e3ddd3404383][+snippets/find-file]]    |
| ~SPC s /~ | [[#113b6660-4c14-446d-ba44-75e4b9afdfc8][yas-visit-snippet-file]] |
** SPC q 
#+NAME: SPCq
| Key       | Command                  |
|-----------+--------------------------|
| ~SPC q Q~ | [[#9453f505-66e6-4bb3-bda0-728697a281bd][evil-save-and-quit]]       |
| ~SPC q R~ | [[#c81e453e-0bfc-4a07-a297-bde25a2b1fbb][doom/restart]]             |
| ~SPC q S~ | [[#43795568-2f93-4159-813f-a07fbff4cd07][doom/save-session]]        |
| ~SPC q l~ | [[#cfde721c-2f66-456b-904a-bda350c71f02][doom/quickload-session]]   |
| ~SPC q q~ | [[#189958eb-b7bf-45b2-a78a-0821d48e1f52][evil-quit-all]]            |
| ~SPC q r~ | [[#9c59ab4b-cda8-4024-9b55-6bdef57e0957][doom/restart-and-restore]] |
| ~SPC q s~ | [[#2bff6a9c-08a4-4a62-8ac3-a04cd9f6a04f][doom/quicksave-session]]   |
| ~SPC q L~ | [[#1a2539cf-159f-4359-9cf6-07201d908303][doom/load-session]]        |
** SPC p 
#+NAME: SPCp
| Key       | Command                              |
|-----------+--------------------------------------|
| ~SPC p .~ | [[#8adcff30-082b-43ca-9027-c383bb9a961e][+default/browse-project]]              |
| ~SPC p /~ | [[#51bd426b-db4d-4b12-a430-e80f4dcbfa85][projectile-find-file]]                 |
| ~SPC p c~ | [[#47046a75-53c9-4c72-8cf2-3e2db47d816f][projectile-compile-project]]           |
| ~SPC p o~ | [[#5447c09f-e5eb-4899-a744-d2cebcdf2f57][projectile-find-other-file]]           |
| ~SPC p p~ | [[#72b618d1-aea8-4c99-b689-a00c8cc51ab1][projectile-switch-project]]            |
| ~SPC p r~ | [[#4b91f61d-98cd-40b3-8bf2-39a9354dddb6][projectile-recentf]]                   |
| ~SPC p t~ | [[#5f2bb02e-35aa-42f5-893f-71e5bfb5091b][+default/project-tasks]]               |
| ~SPC p x~ | [[#850d3af7-ce60-4799-9fa6-bf3997eb870c][projectile-invalidate-cache]]          |
| ~SPC p !~ | [[#edc660f7-f5c1-4d10-b263-58b815bee729][projectile-run-shell-command-in-root]] |
** SPC o 
#+NAME: SPCo
| Key       | Command                      |
|-----------+------------------------------|
| ~SPC o A~ | [[#097c5064-d98a-4402-9e02-4328014d4f9e][org-agenda]]                   |
| ~SPC o P~ | [[#f2ca4317-57a8-4481-aaf6-53be7cf88e53][+treemacs/find-file]]          |
| ~SPC o R~ | [[#c3ed250b-7275-449b-b46a-2f9fe9736f31][+eval/open-repl-same-window]]  |
| ~SPC o b~ | [[#c42d56df-1cd5-4aaa-bc93-4393b9ed1f94][browse-url-of-file]]           |
| ~SPC o i~ | [[#d1b28c1a-f878-4271-b6eb-3d16abf595fb][imenu-list-smart-toggle]]      |
| ~SPC o p~ | [[#c1b8aaee-e425-4f5c-9a73-3321ecc0eff2][+treemacs/toggle]]             |
| ~SPC o r~ | [[#60d23955-d838-4d50-94d7-77e1a60448f6][+eval/open-repl-other-window]] |
| ~SPC o -~ | [[#cf15003c-9c45-4044-9a5f-628835450c00][dired-jump]]                   |
** SPC n 
#+NAME: SPCn
| Key       | Command                  |
|-----------+--------------------------|
| ~SPC n l~ | [[#318398e5-b23b-440a-8e32-f84b010f3faf][org-store-link]]           |
| ~SPC n n~ | [[#4377760d-a48e-437a-ab3f-a60e293b2926][+default/find-in-notes]]   |
| ~SPC n s~ | [[#b4023007-9482-426c-8a2e-f2261e36d39a][doom/open-scratch-buffer]] |
| ~SPC n x~ | [[#9e2f7a7e-0456-4b0e-b853-e19620ab8b25][org-capture]]              |
| ~SPC n N~ | [[#5b2fe451-598f-4739-8f6f-3027f9ddbbad][+default/browse-notes]]    |
** SPC i 
#+NAME: SPCi
| Key       | Command            |
|-----------+--------------------|
| ~SPC i y~ | [[#80846462-575f-4adc-b4c6-f563337a9c47][+default/yank-pop]]  |
| ~SPC i s~ | [[#167a000a-6b35-4011-8b90-993a3fb10742][yas-insert-snippet]] |
** SPC g 
#+NAME: SPCg
| Key       | Command                  |
|-----------+--------------------------|
| ~SPC g /~ | [[#6f45bf0d-db98-495e-aaf3-26a44bce0597][magit-dispatch]]           |
| ~SPC g B~ | [[#377b1f0b-1c85-4e1d-ba8a-c9b07f9216dd][magit-blame-addition]]     |
| ~SPC g C~ | [[#87afe0af-944b-44b4-849d-57648d9f14d8][+magit/clone]]             |
| ~SPC g F~ | [[#06a048fd-2d5b-4871-8bb7-8e428684d131][magit-fetch]]              |
| ~SPC g L~ | [[#80de298e-bec2-4877-b78a-aab7b7fa1698][magit-log]]                |
| ~SPC g R~ | [[#20950724-b6d1-4143-9c9d-d7eb9a535b64][vc-revert]]                |
| ~SPC g S~ | [[#cab158d6-a07a-447f-a7f3-7c3b903bf94d][magit-stage-file]]         |
| ~SPC g U~ | [[#492ddbd7-269c-4dbf-9209-0875e5dc9aa2][magit-unstage-file]]       |
| ~SPC g [~ | [[#2e9e00d3-ffb1-43b6-b820-b68de20565ef][git-gutter:previous-hunk]] |
| ~SPC g ]~ | [[#078333bc-daed-46e2-bec8-546f48f572ee][git-gutter:next-hunk]]     |
| ~SPC g g~ | [[#be633158-9952-4c3e-9c11-3c0915a99e99][magit-status]]             |
| ~SPC g r~ | [[#0e371fe0-8c93-4596-aae2-023e21069724][git-gutter:revert-hunk]]   |
| ~SPC g s~ | [[#a03374e4-b9d7-4aa7-a006-6fd9a77ffc70][git-gutter:stage-hunk]]    |
| ~SPC g t~ | [[#ebf87a91-7c8f-4b7c-a26e-eb5c86eb95dc][git-timemachine-toggle]]   |
| ~SPC g x~ | [[#0f58bd0b-d0b4-49eb-b107-34902a0f7932][magit-file-delete]]        |
| ~SPC g '~ | [[#6447d2ac-f678-4d5e-80ac-ef5c1c420634][forge-dispatch]]           |
** SPC f 
#+NAME: SPCf
| Key       | Command                          |
|-----------+----------------------------------|
| ~SPC f /~ | [[#f23a7abe-065b-49c9-a5a7-5cd4e8f65cc6][projectile-find-file]]             |
| ~SPC f >~ | [[#6a963989-407e-47be-991c-b6afeea51272][doom/browse-in-other-project]]     |
| ~SPC f ?~ | [[#bdba04d7-0cbb-42ec-a096-6550940351d6][doom/find-file-in-other-project]]  |
| ~SPC f E~ | [[#4fa53e94-1db1-4731-9b4e-a89d794c450e][+default/browse-emacsd]]           |
| ~SPC f P~ | [[#c4451e27-8e04-4d00-84a1-db425b616e4f][doom/open-private-config]]         |
| ~SPC f R~ | [[#3626d691-a3ee-445a-a50f-d93adfaf6f01][projectile-recentf]]               |
| ~SPC f S~ | [[#cfe21cbd-4efc-4226-8be4-7277a462b5cb][doom/sudo-find-file]]              |
| ~SPC f X~ | [[#04a5ae29-a371-48fc-a7bb-184256008ef6][doom/delete-this-file]]            |
| ~SPC f a~ | [[#6419c48c-ad36-4493-8701-8ec2a35c7162][projectile-find-other-file]]       |
| ~SPC f d~ | [[#75cdd776-f4e5-4a10-9d6f-5252b97ce1ab][dired]]                            |
| ~SPC f e~ | [[#7c44ae79-82ff-425e-9646-3b6e8f3ccbf7][+default/find-in-emacsd]]          |
| ~SPC f f~ | [[#5d5b3a2c-c39c-49cb-bb48-cad996dabd08][find-file]]                        |
| ~SPC f p~ | [[#38bb4388-3d65-4116-95fd-c63ffc58eea9][doom/find-file-in-private-config]] |
| ~SPC f r~ | [[#c76562db-cd7f-475e-9e01-0eed9d61cb46][recentf-open-files]]               |
| ~SPC f s~ | [[#6fa9b87e-7273-4e35-a6a9-0de4d9fd56c3][save-buffer]]                      |
| ~SPC f y~ | [[#441e0cdb-7ce9-471c-8411-447af37b90ff][+default/yank-buffer-filename]]    |
| ~SPC f .~ | [[#0bd9a0f1-550e-4eac-98f9-179c5e67d024][counsel-file-jump]]                |
** SPC c 
#+NAME: SPCc
| Key       | Command                       |
|-----------+-------------------------------|
| ~SPC c E~ | [[#0b1547c3-b51b-49a7-b0e1-d5abd7b131d7][+eval:replace-region]]          |
| ~SPC c W~ | [[#0e356afa-02ab-442c-8ac4-f77a3ad03f3d][doom/delete-trailing-newlines]] |
| ~SPC c c~ | [[#277e3f79-00c7-4255-ac55-c3b770bab810][projectile-compile-project]]    |
| ~SPC c d~ | [[#d4268002-10f5-40c7-ab2c-58cbae78c974][+lookup/definition]]            |
| ~SPC c e~ | [[#6f7dd680-12ba-44b4-87c9-c7e8054f5850][+eval/buffer-or-region]]        |
| ~SPC c r~ | [[#07a72872-94ed-4ad6-9ddf-572e8177e0bd][+eval/open-repl-other-window]]  |
| ~SPC c w~ | [[#2ff4d4df-7cc0-430c-928c-675e646edc7d][delete-trailing-whitespace]]    |
| ~SPC c x~ | [[#af582e8f-e43a-4a37-809b-8510d74afb05][flycheck-list-errors]]          |
| ~SPC c D~ | [[#329cef26-e505-43a0-9d31-0a9362418419][+lookup/references]]            |
** SPC b 
#+NAME: SPCb
| Key       | Command                      |
|-----------+------------------------------|
| ~SPC b B~ | [[#d68f0498-9d90-4b97-87e8-1ad5baadc464][switch-to-buffer]]             |
| ~SPC b N~ | [[#68fad855-9f08-4968-b4e8-8ade54aae707][evil-buffer-new]]              |
| ~SPC b S~ | [[#f0e6c89e-63f3-41a5-9133-384256d5db13][doom/sudo-this-file]]          |
| ~SPC b [~ | [[#023ee488-f3ba-433d-868a-05d27aec24cc][previous-buffer]]              |
| ~SPC b ]~ | [[#f5b38e30-260e-43f7-be4c-d4c13a8d0ede][next-buffer]]                  |
| ~SPC b b~ | [[#319f4d01-a04e-4d89-a13c-361e8b65468a][persp-switch-to-buffer]]       |
| ~SPC b k~ | [[#41f8111a-a787-4f38-af71-0e9f408fd147][kill-this-buffer]]             |
| ~SPC b n~ | [[#007139e3-8613-4a6e-9f49-6049f783ffc0][next-buffer]]                  |
| ~SPC b o~ | [[#4a1355ad-d96a-40a3-a3e5-2c5769cafe01][doom/kill-other-buffers]]      |
| ~SPC b p~ | [[#24f4e616-c3c6-4266-88b8-404c61dbc4aa][previous-buffer]]              |
| ~SPC b s~ | [[#2a015be2-eb68-4fd4-ba8a-d4d8df158744][save-buffer]]                  |
| ~SPC b x~ | [[#5b5d44ab-77db-4c39-b0a1-6006acca30a9][doom/open-scratch-buffer]]     |
| ~SPC b z~ | [[#911f8f07-dede-4c86-923c-208c6c6e18d5][bury-buffer]]                  |
| ~SPC b -~ | [[#28a6d99e-0812-4332-8745-af9dbd1dc37f][doom/clone-and-narrow-buffer]] |
** SPC TAB 
#+NAME: SPCTAB
| Key           | Command                         |
|---------------+---------------------------------|
| ~SPC TAB .~   | [[#5019af10-619a-4507-a3af-0702eb4c0600][+workspace/switch-to]]            |
| ~SPC TAB 0~   | [[#1d03d4d8-bd19-4736-9626-cd3579aa4a68][+workspace/switch-to-last]]       |
| ~SPC TAB R~   | [[#14096506-e779-4166-8702-9f2e79f19a3e][+workspace/restore-last-session]] |
| ~SPC TAB [~   | [[#ad502bba-1099-4c4a-afec-7087d6f04137][+workspace/switch-left]]          |
| ~SPC TAB ]~   | [[#beb80fa5-ca53-4ee3-9eb1-a1588c5430f8][+workspace/switch-right]]         |
| ~SPC TAB d~   | [[#fcd7879a-0a00-4448-a508-8f0ed3249a5e][+workspace/delete]]               |
| ~SPC TAB l~   | [[#4057c04d-8f84-4e26-833d-0fa1aa3a9f04][+workspace/load]]                 |
| ~SPC TAB n~   | [[#695472c7-79ff-4266-bb7d-b1485e59d74e][+workspace/new]]                  |
| ~SPC TAB r~   | [[#941fe096-93f4-469a-afc0-62c495240252][+workspace/rename]]               |
| ~SPC TAB s~   | [[#03cf9a7a-c3b9-45b0-b65c-f2f496fbd2a1][+workspace/save]]                 |
| ~SPC TAB x~   | [[#890c2e11-73ad-476b-943b-80d45620b30d][+workspace/kill-session]]         |
| ~SPC TAB TAB~ | [[#9c3ba37e-2aa1-4408-83ed-9089f39d40b5][+workspace/display]]              |
** SPC / 
#+NAME: SPC/
| Key       | Command                  |
|-----------+--------------------------|
| ~SPC / b~ | [[#165c441e-ab52-4517-a695-7b4f27607f6a][swiper]]                   |
| ~SPC / d~ | [[#324c326d-b46b-41aa-bc49-a9e9f177d8c6][+default/search-from-cwd]] |
| ~SPC / i~ | [[#5acde342-4342-4312-b7f7-a44b21b78e76][imenu]]                    |
| ~SPC / l~ | [[#57ca7975-ea47-4837-bf4b-89e518b492d2][ace-link]]                 |
| ~SPC / o~ | [[#7a257daa-ac79-4bb5-9b2c-c02c724ef3a2][+lookup/online-select]]    |
| ~SPC / p~ | [[#7858ddc8-826c-4d30-99f7-02c347dca907][+default/search-project]]  |
| ~SPC / I~ | [[#e7441417-829b-45dd-a34e-a2b23b4df931][imenu-anywhere]]           |
