index.org
** SPC SPC
:PROPERTIES:
:CUSTOM_ID: 4713167e-f20a-4651-890d-3f92c3a79651
:END:
*** Function
*projectile-find-file*
*** Documentation
Jump to a project’s file using completion.
With a prefix arg INVALIDATE-CACHE invalidates the cache first.

(fn &optional INVALIDATE-CACHE)
** SPC '
:PROPERTIES:
:CUSTOM_ID: c8a625ed-3383-4f8a-bd85-35fb950a75e1
:END:
*** Function
*ivy-resume*
*** Documentation
Resume the last completion session.
** SPC ,
:PROPERTIES:
:CUSTOM_ID: d16eacde-6905-4cd9-835d-ba3953329aee
:END:
*** Function
*persp-switch-to-buffer*
*** Documentation
Switch to buffer, read buffer with restriction to current perspective.
** SPC .
:PROPERTIES:
:CUSTOM_ID: 39ec3fd1-540f-4560-8e87-be4b99176816
:END:
*** Function
*find-file*
*** Documentation
Edit file FILENAME.
Switch to a buffer visiting file FILENAME,
creating one if none already exists.
Interactively, the default if you just type RET is the current directory,
but the visited file name is available through the minibuffer history:
type M-x next-history-element to pull it into the minibuffer.

The first time M-x next-history-element is used after Emacs prompts for
the file name, the result is affected by ‘file-name-at-point-functions’,
which by default try to guess the file name by looking at point in the
current buffer.  Customize the value of ‘file-name-at-point-functions’
or set it to nil, if you want only the visited file name and the
current directory to be available on first M-x next-history-element
request.

You can visit files on remote machines by specifying something
like /ssh:SOME_REMOTE_MACHINE:FILE for the file name.  You can
also visit local files as a different user by specifying
/sudo::FILE for the file name.
See the Info node ‘(tramp)File name Syntax’ in the Tramp Info
manual, for more about this.

Interactively, or if WILDCARDS is non-nil in a call from Lisp,
expand wildcards (if any) and visit multiple files.  You can
suppress wildcard expansion by setting ‘find-file-wildcards’ to nil.

To visit a file without any kind of conversion and without
automatically choosing a major mode, use M-x find-file-literally.

(fn FILENAME &optional WILDCARDS)
** SPC :
:PROPERTIES:
:CUSTOM_ID: ad1749ea-3bed-4e19-98e3-970347cf0283
:END:
*** Function
*execute-extended-command*
*** Documentation
Read a command name, then read the arguments and call the command.
To pass a prefix argument to the command you are
invoking, give a prefix argument to ‘execute-extended-command’.

(fn PREFIXARG &optional COMMAND-NAME TYPED)
** SPC ;
:PROPERTIES:
:CUSTOM_ID: c224b829-388d-45df-b6bd-19f844e45bef
:END:
*** Function
*eval-expression*
*** Documentation
:after advice: ‘amx-post-eval-force-update’

Evaluate EXP and print value in the echo area.
When called interactively, read an Emacs Lisp expression and
evaluate it.  Value is also consed on to front of the variable
‘values’.  Optional argument INSERT-VALUE non-nil (interactively,
with a non ‘-’ prefix argument) means insert the result into the
current buffer instead of printing it in the echo area.

Normally, this function truncates long output according to the
value of the variables ‘eval-expression-print-length’ and
‘eval-expression-print-level’.  When NO-TRUNCATE is
non-nil (interactively, with a prefix argument of zero), however,
there is no such truncation.

If the resulting value is an integer, and CHAR-PRINT-LIMIT is
non-nil (interactively, unless given a non-zero prefix argument)
it will be printed in several additional formats (octal,
hexadecimal, and character).  The character format is only used
if the value is below CHAR-PRINT-LIMIT (interactively, if the
prefix argument is -1 or the value doesn’t exceed
‘eval-expression-print-maximum-character’).

Runs the hook ‘eval-expression-minibuffer-setup-hook’ on entering the
minibuffer.

If ‘eval-expression-debug-on-error’ is non-nil, which is the default,
this command arranges for all errors to enter the debugger.

(fn EXP &optional INSERT-VALUE NO-TRUNCATE CHAR-PRINT-LIMIT)
** SPC <
:PROPERTIES:
:CUSTOM_ID: 71111500-75ee-4a40-aa12-0a2926cb1271
:END:
*** Function
*switch-to-buffer*
*** Documentation
:around advice: ‘ad-Advice-switch-to-buffer’
:around advice: ‘doom*run-switch-buffer-hooks’

Display buffer BUFFER-OR-NAME in the selected window.

WARNING: This is NOT the way to work on another buffer temporarily
within a Lisp program!  Use ‘set-buffer’ instead.  That avoids
messing with the window-buffer correspondences.

If the selected window cannot display the specified buffer
because it is a minibuffer window or strongly dedicated to
another buffer, call ‘pop-to-buffer’ to select the buffer in
another window.  In interactive use, if the selected window is
strongly dedicated to its buffer, the value of the option
‘switch-to-buffer-in-dedicated-window’ specifies how to proceed.

If called interactively, read the buffer name using ‘read-buffer’.
The variable ‘confirm-nonexistent-file-or-buffer’ determines
whether to request confirmation before creating a new buffer.
See ‘read-buffer’ for features related to input and completion
of buffer names.

BUFFER-OR-NAME may be a buffer, a string (a buffer name), or nil.
If BUFFER-OR-NAME is a string that does not identify an existing
buffer, create a buffer with that name.  If BUFFER-OR-NAME is
nil, switch to the buffer returned by ‘other-buffer’.

If optional argument NORECORD is non-nil, do not put the buffer
at the front of the buffer list, and do not make the window
displaying it the most recently selected one.

If optional argument FORCE-SAME-WINDOW is non-nil, the buffer
must be displayed in the selected window when called
non-interactively; if that is impossible, signal an error rather
than calling ‘pop-to-buffer’.  It has no effect when the option
‘switch-to-buffer-obey-display-actions’ is non-nil.

The option ‘switch-to-buffer-preserve-window-point’ can be used
to make the buffer appear at its last position in the selected
window.

If the option ‘switch-to-buffer-obey-display-actions’ is non-nil,
run the function ‘pop-to-buffer-same-window’ instead.
This may display the buffer in another window as specified by
‘display-buffer-overriding-action’, ‘display-buffer-alist’ and
other display related variables.  If this results in displaying
the buffer in the selected window, window start and point are adjusted
as prescribed by the option ‘switch-to-buffer-preserve-window-point’.
Otherwise, these are left alone.

Return the buffer switched to.

(fn BUFFER-OR-NAME &optional NORECORD FORCE-SAME-WINDOW)
** SPC X
:PROPERTIES:
:CUSTOM_ID: 006737f1-ad10-4cf4-bccf-c1e66bd3cdad
:END:
*** Function
*org-capture*
*** Documentation
Capture something.

This will let you select a template from ‘org-capture-templates’, and
then file the newly captured information.  The text is immediately
inserted at the target location, and an indirect buffer is shown where
you can edit it.  Pressing ‘C-c C-c’ brings you back to the previous
state of Emacs, so that you can continue your work.

When called interactively with a ‘M-x universal-argument’ prefix argument GOTO, don’t
capture anything, just go to the file/headline where the selected
template stores its notes.

With a ‘M-x universal-argument M-x universal-argument’ prefix argument, go to the last note stored.

When called with a ‘C-0’ (zero) prefix, insert a template at point.

When called with a ‘C-1’ (one) prefix, force prompting for a date when
a datetree entry is made.

ELisp programs can set KEYS to a string associated with a template
in ‘org-capture-templates’.  In this case, interactive selection
will be bypassed.

If ‘org-capture-use-agenda-date’ is non-nil, capturing from the
agenda will use the date at point as the default date.  Then, a
‘C-1’ prefix will tell the capture process to use the HH:MM time
of the day at point (if any) or the current HH:MM time.

(fn &optional GOTO KEYS)
** SPC u
:PROPERTIES:
:CUSTOM_ID: e1cccaea-a301-44c5-8ca4-6bff866b22ea
:END:
*** Function
*universal-argument*
