index.html
<div id="outline-container-org6609c4b" class="outline-3">
<h3 id="4713167e-f20a-4651-890d-3f92c3a79651">SPC SPC</h3>
<div class="outline-text-3" id="text-4713167e-f20a-4651-890d-3f92c3a79651">
</div>
<div id="outline-container-org64d2a64" class="outline-4">
<h4 id="org64d2a64">Function</h4>
<div class="outline-text-4" id="text-org64d2a64">
<p>
<b>projectile-find-file</b>
</p>
</div>
</div>
<div id="outline-container-org6f689fd" class="outline-4">
<h4 id="org6f689fd">Documentation</h4>
<div class="outline-text-4" id="text-org6f689fd">
<p>
Jump to a projects file using completion.
With a prefix arg INVALIDATE-CACHE invalidates the cache first.
</p>

<p>
(fn &amp;optional INVALIDATE-CACHE)
</p>
</div>
</div>
</div>
<div id="outline-container-orgae1b459" class="outline-3">
<h3 id="c8a625ed-3383-4f8a-bd85-35fb950a75e1">SPC '</h3>
<div class="outline-text-3" id="text-c8a625ed-3383-4f8a-bd85-35fb950a75e1">
</div>
<div id="outline-container-orgb552381" class="outline-4">
<h4 id="orgb552381">Function</h4>
<div class="outline-text-4" id="text-orgb552381">
<p>
<b>ivy-resume</b>
</p>
</div>
</div>
<div id="outline-container-org1844137" class="outline-4">
<h4 id="org1844137">Documentation</h4>
<div class="outline-text-4" id="text-org1844137">
<p>
Resume the last completion session.
</p>
</div>
</div>
</div>
<div id="outline-container-org3961fba" class="outline-3">
<h3 id="d16eacde-6905-4cd9-835d-ba3953329aee">SPC ,</h3>
<div class="outline-text-3" id="text-d16eacde-6905-4cd9-835d-ba3953329aee">
</div>
<div id="outline-container-org7385fe5" class="outline-4">
<h4 id="org7385fe5">Function</h4>
<div class="outline-text-4" id="text-org7385fe5">
<p>
<b>persp-switch-to-buffer</b>
</p>
</div>
</div>
<div id="outline-container-org4453058" class="outline-4">
<h4 id="org4453058">Documentation</h4>
<div class="outline-text-4" id="text-org4453058">
<p>
Switch to buffer, read buffer with restriction to current perspective.
</p>
</div>
</div>
</div>
<div id="outline-container-org25cf704" class="outline-3">
<h3 id="39ec3fd1-540f-4560-8e87-be4b99176816">SPC .</h3>
<div class="outline-text-3" id="text-39ec3fd1-540f-4560-8e87-be4b99176816">
</div>
<div id="outline-container-org072f0f4" class="outline-4">
<h4 id="org072f0f4">Function</h4>
<div class="outline-text-4" id="text-org072f0f4">
<p>
<b>find-file</b>
</p>
</div>
</div>
<div id="outline-container-org4b75837" class="outline-4">
<h4 id="org4b75837">Documentation</h4>
<div class="outline-text-4" id="text-org4b75837">
<p>
Edit file FILENAME.
Switch to a buffer visiting file FILENAME,
creating one if none already exists.
Interactively, the default if you just type RET is the current directory,
but the visited file name is available through the minibuffer history:
type M-x next-history-element to pull it into the minibuffer.
</p>

<p>
The first time M-x next-history-element is used after Emacs prompts for
the file name, the result is affected by file-name-at-point-functions,
which by default try to guess the file name by looking at point in the
current buffer.  Customize the value of file-name-at-point-functions
or set it to nil, if you want only the visited file name and the
current directory to be available on first M-x next-history-element
request.
</p>

<p>
You can visit files on remote machines by specifying something
like /ssh:SOME<sub>REMOTE</sub><sub>MACHINE</sub>:FILE for the file name.  You can
also visit local files as a different user by specifying
/sudo::FILE for the file name.
See the Info node (tramp)File name Syntax in the Tramp Info
manual, for more about this.
</p>

<p>
Interactively, or if WILDCARDS is non-nil in a call from Lisp,
expand wildcards (if any) and visit multiple files.  You can
suppress wildcard expansion by setting find-file-wildcards to nil.
</p>

<p>
To visit a file without any kind of conversion and without
automatically choosing a major mode, use M-x find-file-literally.
</p>

<p>
(fn FILENAME &amp;optional WILDCARDS)
</p>
</div>
</div>
</div>
<div id="outline-container-orgb48f10e" class="outline-3">
<h3 id="ad1749ea-3bed-4e19-98e3-970347cf0283">SPC :</h3>
<div class="outline-text-3" id="text-ad1749ea-3bed-4e19-98e3-970347cf0283">
</div>
<div id="outline-container-org2708d5f" class="outline-4">
<h4 id="org2708d5f">Function</h4>
<div class="outline-text-4" id="text-org2708d5f">
<p>
<b>execute-extended-command</b>
</p>
</div>
</div>
<div id="outline-container-orgceb4100" class="outline-4">
<h4 id="orgceb4100">Documentation</h4>
<div class="outline-text-4" id="text-orgceb4100">
<p>
Read a command name, then read the arguments and call the command.
To pass a prefix argument to the command you are
invoking, give a prefix argument to execute-extended-command.
</p>

<p>
(fn PREFIXARG &amp;optional COMMAND-NAME TYPED)
</p>
</div>
</div>
</div>
<div id="outline-container-org9684fc4" class="outline-3">
<h3 id="c224b829-388d-45df-b6bd-19f844e45bef">SPC ;</h3>
<div class="outline-text-3" id="text-c224b829-388d-45df-b6bd-19f844e45bef">
</div>
<div id="outline-container-org3eadf47" class="outline-4">
<h4 id="org3eadf47">Function</h4>
<div class="outline-text-4" id="text-org3eadf47">
<p>
<b>eval-expression</b>
</p>
</div>
</div>
<div id="outline-container-org79a14a4" class="outline-4">
<h4 id="org79a14a4">Documentation</h4>
<div class="outline-text-4" id="text-org79a14a4">
<p>
:after advice: amx-post-eval-force-update
</p>

<p>
Evaluate EXP and print value in the echo area.
When called interactively, read an Emacs Lisp expression and
evaluate it.  Value is also consed on to front of the variable
values.  Optional argument INSERT-VALUE non-nil (interactively,
with a non - prefix argument) means insert the result into the
current buffer instead of printing it in the echo area.
</p>

<p>
Normally, this function truncates long output according to the
value of the variables eval-expression-print-length and
eval-expression-print-level.  When NO-TRUNCATE is
non-nil (interactively, with a prefix argument of zero), however,
there is no such truncation.
</p>

<p>
If the resulting value is an integer, and CHAR-PRINT-LIMIT is
non-nil (interactively, unless given a non-zero prefix argument)
it will be printed in several additional formats (octal,
hexadecimal, and character).  The character format is only used
if the value is below CHAR-PRINT-LIMIT (interactively, if the
prefix argument is -1 or the value doesnt exceed
eval-expression-print-maximum-character).
</p>

<p>
Runs the hook eval-expression-minibuffer-setup-hook on entering the
minibuffer.
</p>

<p>
If eval-expression-debug-on-error is non-nil, which is the default,
this command arranges for all errors to enter the debugger.
</p>

<p>
(fn EXP &amp;optional INSERT-VALUE NO-TRUNCATE CHAR-PRINT-LIMIT)
</p>
</div>
</div>
</div>
