index.org
*** Documentation
Minor mode for on-the-fly syntax checking.

When called interactively, toggle ‘flycheck-mode’.  With prefix
ARG, enable ‘flycheck-mode’ if ARG is positive, otherwise disable
it.

When called from Lisp, enable ‘flycheck-mode’ if ARG is omitted,
nil or positive.  If ARG is ‘toggle’, toggle ‘flycheck-mode’.
Otherwise behave as if called interactively.

In ‘flycheck-mode’ the buffer is automatically syntax-checked
using the first suitable syntax checker from ‘flycheck-checkers’.
Use ‘flycheck-select-checker’ to select a checker for the current
buffer manually.

key             binding
---             -------

C-c             Prefix Command

C-c !           Prefix Command

C-c ! C-c       flycheck-compile
C-c ! C-w       flycheck-copy-errors-as-kill
C-c ! ?         flycheck-describe-checker
C-c ! C         flycheck-clear
C-c ! H         display-local-help
C-c ! V         flycheck-version
C-c ! c         flycheck-buffer
C-c ! e         flycheck-explain-error-at-point
C-c ! h         flycheck-display-error-at-point
C-c ! i         flycheck-manual
C-c ! l         flycheck-list-errors
C-c ! n         flycheck-next-error
C-c ! p         flycheck-previous-error
C-c ! s         flycheck-select-checker
C-c ! v         flycheck-verify-setup
C-c ! x         flycheck-disable-checker



(fn &optional ARG)
** SPC t g
:PROPERTIES:
:CUSTOM_ID: d2f0ecdf-b69d-4918-bec1-993edb3e302b
:END:
*** Function
*evil-goggles-mode*
*** Documentation
evil-goggles global minor mode.

If called interactively, enable Evil-Goggles mode if ARG is positive, and
disable it if ARG is zero or negative.  If called from Lisp,
also enable the mode if ARG is omitted or nil, and toggle it
if ARG is ‘toggle’; disable the mode otherwise.

(fn &optional ARG)
** SPC t l
:PROPERTIES:
:CUSTOM_ID: 90e112e3-64bc-4247-a74b-b4b1da799018
:END:
*** Function
*doom/toggle-line-numbers*
*** Documentation
Toggle line numbers.

Cycles through regular, relative and no line numbers. The order depends on what
‘display-line-numbers-type’ is set to. If you’re using Emacs 26+, and
visual-line-mode is on, this skips relative and uses visual instead.

See ‘display-line-numbers’ for what these values mean.
** SPC t p
:PROPERTIES:
:CUSTOM_ID: 3ead99f5-ba3d-47bf-a795-02272a000b6a
:END:
*** Function
*+org-present/start*
*** Documentation
TODO

(fn)
** SPC t s
:PROPERTIES:
:CUSTOM_ID: 090e14b7-ab60-42dd-8511-1c7656e87166
:END:
*** Function
*flyspell-mode*
*** Documentation
Toggle on-the-fly spell checking (Flyspell mode).

If called interactively, enable Flyspell mode if ARG is positive, and
disable it if ARG is zero or negative.  If called from Lisp,
also enable the mode if ARG is omitted or nil, and toggle it
if ARG is ‘toggle’; disable the mode otherwise.

Flyspell mode is a buffer-local minor mode.  When enabled, it
spawns a single Ispell process and checks each word.  The default
flyspell behavior is to highlight incorrect words.

Bindings:
z =: correct words (using Ispell).
M-x flyspell-auto-correct-word: automatically correct word.
M-x flyspell-auto-correct-previous-word: automatically correct the last misspelled word.
M-x flyspell-correct-word (or down-mouse-2): popup correct words.

Hooks:
This runs ‘flyspell-mode-hook’ after flyspell mode is entered or exit.

Remark:
‘flyspell-mode’ uses ‘ispell-mode’.  Thus all Ispell options are
valid.  For instance, a different dictionary can be used by
invoking ‘ispell-change-dictionary’.

Consider using the ‘ispell-parser’ to check your text.  For instance
consider adding:
(add-hook 'tex-mode-hook (function (lambda () (setq ispell-parser 'tex))))
in your init file.

M-x flyspell-region checks all words inside a region.
M-x flyspell-buffer checks the whole buffer.

(fn &optional ARG)
** SPC s /
:PROPERTIES:
:CUSTOM_ID: 113b6660-4c14-446d-ba44-75e4b9afdfc8
:END:
*** Function
*yas-visit-snippet-file*
*** Documentation
Choose a snippet to edit, selection like ‘yas-insert-snippet’.

Only success if selected snippet was loaded from a file.  Put the
visited file in ‘snippet-mode’.
** SPC s S
:PROPERTIES:
:CUSTOM_ID: 889b267b-7414-4d9c-b4cb-387d4e9a6999
:END:
*** Function
*+snippets/browse*
*** Documentation
TODO

(fn ARG)
** SPC s c
:PROPERTIES:
:CUSTOM_ID: 9d955af1-310d-4784-a1bc-d327e7341781
:END:
*** Function
*aya-create*
*** Documentation
Works on either the current line, or, if ‘mark-active’, the current region.
Removes ‘aya-marker’ prefixes,
writes the corresponding snippet to ‘aya-current’,
with words prefixed by ‘aya-marker’ as fields, and mirrors properly set up.

(fn)
** SPC s e
:PROPERTIES:
:CUSTOM_ID: b9124888-c7c2-4e01-8b0f-a1bc7b0aced9
:END:
*** Function
*aya-expand*
*** Documentation
Insert the last yasnippet created by ‘aya-create’.

(fn)
** SPC s i
:PROPERTIES:
:CUSTOM_ID: d805ed3b-78c5-456a-bae0-4321f8a003cc
:END:
*** Function
*yas-insert-snippet*
*** Documentation
Choose a snippet to expand, pop-up a list of choices according
to ‘yas-prompt-functions’.

With prefix argument NO-CONDITION, bypass filtering of snippets
by condition.
** SPC s n
:PROPERTIES:
:CUSTOM_ID: 4d74ec66-e879-41f4-9163-ea1359c56bba
:END:
*** Function
*yas-new-snippet*
*** Documentation
Pops a new buffer for writing a snippet.

Expands a snippet-writing snippet, unless the optional prefix arg
NO-TEMPLATE is non-nil.
** SPC s r
:PROPERTIES:
:CUSTOM_ID: c3f81cf7-900e-495d-a9a1-436b993c599b
:END:
*** Function
*yas-reload-all*
