index.html
<div id="outline-container-org4026c6f" class="outline-3">
<h3 id="cf79b310-5340-4cc6-acf3-183d0d6f71f3">SPC t f</h3>
<div class="outline-text-3" id="text-cf79b310-5340-4cc6-acf3-183d0d6f71f3">
</div>
<div id="outline-container-orgdd70b37" class="outline-4">
<h4 id="orgdd70b37">Function</h4>
<div class="outline-text-4" id="text-orgdd70b37">
<p>
<b>flycheck-mode</b>
</p>
</div>
</div>
<div id="outline-container-orge895ab9" class="outline-4">
<h4 id="orge895ab9">Documentation</h4>
<div class="outline-text-4" id="text-orge895ab9">
<p>
Minor mode for on-the-fly syntax checking.
</p>

<p>
When called interactively, toggle flycheck-mode.  With prefix
ARG, enable flycheck-mode if ARG is positive, otherwise disable
it.
</p>

<p>
When called from Lisp, enable flycheck-mode if ARG is omitted,
nil or positive.  If ARG is toggle, toggle flycheck-mode.
Otherwise behave as if called interactively.
</p>

<p>
In flycheck-mode the buffer is automatically syntax-checked
using the first suitable syntax checker from flycheck-checkers.
Use flycheck-select-checker to select a checker for the current
buffer manually.
</p>

<p>
key             binding
&#x2014;             --&#x2013;&#x2014;
</p>

<p>
C-c             Prefix Command
</p>

<p>
C-c !           Prefix Command
</p>

<p>
C-c ! C-c       flycheck-compile
C-c ! C-w       flycheck-copy-errors-as-kill
C-c ! ?         flycheck-describe-checker
C-c ! C         flycheck-clear
C-c ! H         display-local-help
C-c ! V         flycheck-version
C-c ! c         flycheck-buffer
C-c ! e         flycheck-explain-error-at-point
C-c ! h         flycheck-display-error-at-point
C-c ! i         flycheck-manual
C-c ! l         flycheck-list-errors
C-c ! n         flycheck-next-error
C-c ! p         flycheck-previous-error
C-c ! s         flycheck-select-checker
C-c ! v         flycheck-verify-setup
C-c ! x         flycheck-disable-checker
</p>



<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-orge9f10b4" class="outline-3">
<h3 id="d2f0ecdf-b69d-4918-bec1-993edb3e302b">SPC t g</h3>
<div class="outline-text-3" id="text-d2f0ecdf-b69d-4918-bec1-993edb3e302b">
</div>
<div id="outline-container-org2d9bcde" class="outline-4">
<h4 id="org2d9bcde">Function</h4>
<div class="outline-text-4" id="text-org2d9bcde">
<p>
<b>evil-goggles-mode</b>
</p>
</div>
</div>
<div id="outline-container-orgc27a0f5" class="outline-4">
<h4 id="orgc27a0f5">Documentation</h4>
<div class="outline-text-4" id="text-orgc27a0f5">
<p>
evil-goggles global minor mode.
</p>

<p>
If called interactively, enable Evil-Goggles mode if ARG is positive, and
disable it if ARG is zero or negative.  If called from Lisp,
also enable the mode if ARG is omitted or nil, and toggle it
if ARG is toggle; disable the mode otherwise.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-org986552d" class="outline-3">
<h3 id="90e112e3-64bc-4247-a74b-b4b1da799018">SPC t l</h3>
<div class="outline-text-3" id="text-90e112e3-64bc-4247-a74b-b4b1da799018">
</div>
<div id="outline-container-org1ba0199" class="outline-4">
<h4 id="org1ba0199">Function</h4>
<div class="outline-text-4" id="text-org1ba0199">
<p>
<b>doom/toggle-line-numbers</b>
</p>
</div>
</div>
<div id="outline-container-orga29d645" class="outline-4">
<h4 id="orga29d645">Documentation</h4>
<div class="outline-text-4" id="text-orga29d645">
<p>
Toggle line numbers.
</p>

<p>
Cycles through regular, relative and no line numbers. The order depends on what
display-line-numbers-type is set to. If youre using Emacs 26+, and
visual-line-mode is on, this skips relative and uses visual instead.
</p>

<p>
See display-line-numbers for what these values mean.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbb0591e" class="outline-3">
<h3 id="3ead99f5-ba3d-47bf-a795-02272a000b6a">SPC t p</h3>
<div class="outline-text-3" id="text-3ead99f5-ba3d-47bf-a795-02272a000b6a">
</div>
<div id="outline-container-org31f534e" class="outline-4">
<h4 id="org31f534e">Function</h4>
<div class="outline-text-4" id="text-org31f534e">
<p>
<b>+org-present/start</b>
</p>
</div>
</div>
<div id="outline-container-org7172306" class="outline-4">
<h4 id="org7172306">Documentation</h4>
<div class="outline-text-4" id="text-org7172306">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org66a4b6a" class="outline-3">
<h3 id="090e14b7-ab60-42dd-8511-1c7656e87166">SPC t s</h3>
<div class="outline-text-3" id="text-090e14b7-ab60-42dd-8511-1c7656e87166">
</div>
<div id="outline-container-orgca7d229" class="outline-4">
<h4 id="orgca7d229">Function</h4>
<div class="outline-text-4" id="text-orgca7d229">
<p>
<b>flyspell-mode</b>
</p>
</div>
</div>
<div id="outline-container-orge14f1a2" class="outline-4">
<h4 id="orge14f1a2">Documentation</h4>
<div class="outline-text-4" id="text-orge14f1a2">
<p>
Toggle on-the-fly spell checking (Flyspell mode).
</p>

<p>
If called interactively, enable Flyspell mode if ARG is positive, and
disable it if ARG is zero or negative.  If called from Lisp,
also enable the mode if ARG is omitted or nil, and toggle it
if ARG is toggle; disable the mode otherwise.
</p>

<p>
Flyspell mode is a buffer-local minor mode.  When enabled, it
spawns a single Ispell process and checks each word.  The default
flyspell behavior is to highlight incorrect words.
</p>

<p>
Bindings:
z =: correct words (using Ispell).
M-x flyspell-auto-correct-word: automatically correct word.
M-x flyspell-auto-correct-previous-word: automatically correct the last misspelled word.
M-x flyspell-correct-word (or down-mouse-2): popup correct words.
</p>

<p>
Hooks:
This runs flyspell-mode-hook after flyspell mode is entered or exit.
</p>

<p>
Remark:
flyspell-mode uses ispell-mode.  Thus all Ispell options are
valid.  For instance, a different dictionary can be used by
invoking ispell-change-dictionary.
</p>

<p>
Consider using the ispell-parser to check your text.  For instance
consider adding:
(add-hook 'tex-mode-hook (function (lambda () (setq ispell-parser 'tex))))
in your init file.
</p>

<p>
M-x flyspell-region checks all words inside a region.
M-x flyspell-buffer checks the whole buffer.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-org4a048a3" class="outline-3">
<h3 id="113b6660-4c14-446d-ba44-75e4b9afdfc8">SPC s /</h3>
<div class="outline-text-3" id="text-113b6660-4c14-446d-ba44-75e4b9afdfc8">
</div>
<div id="outline-container-orgc31fe9c" class="outline-4">
<h4 id="orgc31fe9c">Function</h4>
<div class="outline-text-4" id="text-orgc31fe9c">
<p>
<b>yas-visit-snippet-file</b>
</p>
</div>
</div>
<div id="outline-container-org288c1d4" class="outline-4">
<h4 id="org288c1d4">Documentation</h4>
<div class="outline-text-4" id="text-org288c1d4">
<p>
Choose a snippet to edit, selection like yas-insert-snippet.
</p>

<p>
Only success if selected snippet was loaded from a file.  Put the
visited file in snippet-mode.
</p>
</div>
</div>
</div>
<div id="outline-container-org6e3fd45" class="outline-3">
<h3 id="889b267b-7414-4d9c-b4cb-387d4e9a6999">SPC s S</h3>
<div class="outline-text-3" id="text-889b267b-7414-4d9c-b4cb-387d4e9a6999">
</div>
<div id="outline-container-org6045b44" class="outline-4">
<h4 id="org6045b44">Function</h4>
<div class="outline-text-4" id="text-org6045b44">
<p>
<b>+snippets/browse</b>
</p>
</div>
</div>
<div id="outline-container-orgf3c1f88" class="outline-4">
<h4 id="orgf3c1f88">Documentation</h4>
<div class="outline-text-4" id="text-orgf3c1f88">
<p>
TODO
</p>

<p>
(fn ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd2f148f" class="outline-3">
<h3 id="9d955af1-310d-4784-a1bc-d327e7341781">SPC s c</h3>
<div class="outline-text-3" id="text-9d955af1-310d-4784-a1bc-d327e7341781">
</div>
<div id="outline-container-orgf9b8a6f" class="outline-4">
<h4 id="orgf9b8a6f">Function</h4>
<div class="outline-text-4" id="text-orgf9b8a6f">
<p>
<b>aya-create</b>
</p>
</div>
</div>
<div id="outline-container-orgabd149b" class="outline-4">
<h4 id="orgabd149b">Documentation</h4>
<div class="outline-text-4" id="text-orgabd149b">
<p>
Works on either the current line, or, if mark-active, the current region.
Removes aya-marker prefixes,
writes the corresponding snippet to aya-current,
with words prefixed by aya-marker as fields, and mirrors properly set up.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org0755236" class="outline-3">
<h3 id="b9124888-c7c2-4e01-8b0f-a1bc7b0aced9">SPC s e</h3>
<div class="outline-text-3" id="text-b9124888-c7c2-4e01-8b0f-a1bc7b0aced9">
</div>
<div id="outline-container-org6b787ad" class="outline-4">
<h4 id="org6b787ad">Function</h4>
<div class="outline-text-4" id="text-org6b787ad">
<p>
<b>aya-expand</b>
</p>
</div>
</div>
<div id="outline-container-orgabdab0a" class="outline-4">
<h4 id="orgabdab0a">Documentation</h4>
<div class="outline-text-4" id="text-orgabdab0a">
<p>
Insert the last yasnippet created by aya-create.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org13a9739" class="outline-3">
<h3 id="d805ed3b-78c5-456a-bae0-4321f8a003cc">SPC s i</h3>
<div class="outline-text-3" id="text-d805ed3b-78c5-456a-bae0-4321f8a003cc">
</div>
<div id="outline-container-org1490648" class="outline-4">
<h4 id="org1490648">Function</h4>
<div class="outline-text-4" id="text-org1490648">
<p>
<b>yas-insert-snippet</b>
</p>
</div>
</div>
<div id="outline-container-org969fb6e" class="outline-4">
<h4 id="org969fb6e">Documentation</h4>
<div class="outline-text-4" id="text-org969fb6e">
<p>
Choose a snippet to expand, pop-up a list of choices according
to yas-prompt-functions.
</p>

<p>
With prefix argument NO-CONDITION, bypass filtering of snippets
by condition.
</p>
</div>
</div>
</div>
<div id="outline-container-orgce7fe38" class="outline-3">
<h3 id="4d74ec66-e879-41f4-9163-ea1359c56bba">SPC s n</h3>
<div class="outline-text-3" id="text-4d74ec66-e879-41f4-9163-ea1359c56bba">
</div>
<div id="outline-container-org5a229fb" class="outline-4">
<h4 id="org5a229fb">Function</h4>
<div class="outline-text-4" id="text-org5a229fb">
<p>
<b>yas-new-snippet</b>
</p>
</div>
</div>
<div id="outline-container-org0dc5de2" class="outline-4">
<h4 id="org0dc5de2">Documentation</h4>
<div class="outline-text-4" id="text-org0dc5de2">
<p>
Pops a new buffer for writing a snippet.
</p>

<p>
Expands a snippet-writing snippet, unless the optional prefix arg
NO-TEMPLATE is non-nil.
</p>
</div>
</div>
</div>
