index.org
*** Documentation
Reload all snippets and rebuild the YASnippet menu.

When NO-JIT is non-nil force immediate reload of all known
snippets under ‘yas-snippet-dirs’, otherwise use just-in-time
loading.

When called interactively, use just-in-time loading when given a
prefix argument.
** SPC s s
:PROPERTIES:
:CUSTOM_ID: 9a2dd41f-1e7a-4ec9-a341-e3ddd3404383
:END:
*** Function
*+snippets/find-file*
*** Documentation
TODO

(fn)
** SPC q L
:PROPERTIES:
:CUSTOM_ID: 1a2539cf-159f-4359-9cf6-07201d908303
:END:
*** Function
*doom/load-session*
*** Documentation
TODO

(fn FILE)
** SPC q Q
:PROPERTIES:
:CUSTOM_ID: 9453f505-66e6-4bb3-bda0-728697a281bd
:END:
*** Function
*evil-save-and-quit*
*** Documentation
Save all buffers and exit Emacs.
** SPC q R
:PROPERTIES:
:CUSTOM_ID: c81e453e-0bfc-4a07-a297-bde25a2b1fbb
:END:
*** Function
*doom/restart*
*** Documentation
Restart Emacs.

When called interactively ARGS is interpreted as follows

- with a single ‘universal-argument’ (‘C-u’) Emacs is restarted
  with ‘--debug-init’ flag
- with two ‘universal-argument’ (‘C-u’) Emacs is restarted with
  ‘-Q’ flag
- with three ‘universal-argument’ (‘C-u’) the user prompted for
  the arguments

When called non-interactively ARGS should be a list of arguments
with which Emacs should be restarted.

(fn &optional ARGS)
** SPC q S
:PROPERTIES:
:CUSTOM_ID: 43795568-2f93-4159-813f-a07fbff4cd07
:END:
*** Function
*doom/save-session*
*** Documentation
TODO

(fn FILE)
** SPC q l
:PROPERTIES:
:CUSTOM_ID: cfde721c-2f66-456b-904a-bda350c71f02
:END:
*** Function
*doom/quickload-session*
*** Documentation
TODO

(fn)
** SPC q q
:PROPERTIES:
:CUSTOM_ID: 189958eb-b7bf-45b2-a78a-0821d48e1f52
:END:
*** Function
*evil-quit-all*
*** Documentation
Exits Emacs, asking for saving.
** SPC q r
:PROPERTIES:
:CUSTOM_ID: 9c59ab4b-cda8-4024-9b55-6bdef57e0957
:END:
*** Function
*doom/restart-and-restore*
*** Documentation
TODO

(fn &optional DEBUG)
** SPC q s
:PROPERTIES:
:CUSTOM_ID: 2bff6a9c-08a4-4a62-8ac3-a04cd9f6a04f
:END:
*** Function
*doom/quicksave-session*
*** Documentation
TODO

(fn)
** SPC p !
:PROPERTIES:
:CUSTOM_ID: edc660f7-f5c1-4d10-b263-58b815bee729
:END:
*** Function
*projectile-run-shell-command-in-root*
*** Documentation
Invoke ‘shell-command’ in the project’s root.
** SPC p .
:PROPERTIES:
:CUSTOM_ID: 8adcff30-082b-43ca-9027-c383bb9a961e
:END:
*** Function
*+default/browse-project*
*** Documentation

** SPC p /
:PROPERTIES:
:CUSTOM_ID: 51bd426b-db4d-4b12-a430-e80f4dcbfa85
:END:
*** Function
*projectile-find-file*
*** Documentation
Jump to a project’s file using completion.
With a prefix arg INVALIDATE-CACHE invalidates the cache first.

(fn &optional INVALIDATE-CACHE)
** SPC p c
:PROPERTIES:
:CUSTOM_ID: 47046a75-53c9-4c72-8cf2-3e2db47d816f
:END:
*** Function
*projectile-compile-project*
*** Documentation
Run project compilation command.

Normally you’ll be prompted for a compilation command, unless
variable ‘compilation-read-command’.  You can force the prompt
with a prefix ARG.

(fn ARG)
** SPC p o
:PROPERTIES:
:CUSTOM_ID: 5447c09f-e5eb-4899-a744-d2cebcdf2f57
:END:
*** Function
*projectile-find-other-file*
*** Documentation
Switch between files with the same name but different extensions.
With FLEX-MATCHING, match any file that contains the base name of current file.
Other file extensions can be customized with the variable ‘projectile-other-file-alist’.

(fn &optional FLEX-MATCHING)
** SPC p p
:PROPERTIES:
:CUSTOM_ID: 72b618d1-aea8-4c99-b689-a00c8cc51ab1
:END:
*** Function
*projectile-switch-project*
*** Documentation
Switch to a project we have visited before.
Invokes the command referenced by ‘projectile-switch-project-action’ on switch.
With a prefix ARG invokes ‘projectile-commander’ instead of
‘projectile-switch-project-action.’

(fn &optional ARG)
** SPC p r
:PROPERTIES:
:CUSTOM_ID: 4b91f61d-98cd-40b3-8bf2-39a9354dddb6
:END:
*** Function
*projectile-recentf*
*** Documentation
Show a list of recently visited files in a project.
** SPC p t
:PROPERTIES:
:CUSTOM_ID: 5f2bb02e-35aa-42f5-893f-71e5bfb5091b
:END:
*** Function
*+default/project-tasks*
