index.html
<div id="outline-container-orgfd27c75" class="outline-3">
<h3 id="c3f81cf7-900e-495d-a9a1-436b993c599b">SPC s r</h3>
<div class="outline-text-3" id="text-c3f81cf7-900e-495d-a9a1-436b993c599b">
</div>
<div id="outline-container-org4b1c7d2" class="outline-4">
<h4 id="org4b1c7d2">Function</h4>
<div class="outline-text-4" id="text-org4b1c7d2">
<p>
<b>yas-reload-all</b>
</p>
</div>
</div>
<div id="outline-container-orgac22e53" class="outline-4">
<h4 id="orgac22e53">Documentation</h4>
<div class="outline-text-4" id="text-orgac22e53">
<p>
Reload all snippets and rebuild the YASnippet menu.
</p>

<p>
When NO-JIT is non-nil force immediate reload of all known
snippets under yas-snippet-dirs, otherwise use just-in-time
loading.
</p>

<p>
When called interactively, use just-in-time loading when given a
prefix argument.
</p>
</div>
</div>
</div>
<div id="outline-container-org046e230" class="outline-3">
<h3 id="9a2dd41f-1e7a-4ec9-a341-e3ddd3404383">SPC s s</h3>
<div class="outline-text-3" id="text-9a2dd41f-1e7a-4ec9-a341-e3ddd3404383">
</div>
<div id="outline-container-org454413b" class="outline-4">
<h4 id="org454413b">Function</h4>
<div class="outline-text-4" id="text-org454413b">
<p>
<b>+snippets/find-file</b>
</p>
</div>
</div>
<div id="outline-container-org0ea827b" class="outline-4">
<h4 id="org0ea827b">Documentation</h4>
<div class="outline-text-4" id="text-org0ea827b">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org3afd6a2" class="outline-3">
<h3 id="1a2539cf-159f-4359-9cf6-07201d908303">SPC q L</h3>
<div class="outline-text-3" id="text-1a2539cf-159f-4359-9cf6-07201d908303">
</div>
<div id="outline-container-org1b1ed28" class="outline-4">
<h4 id="org1b1ed28">Function</h4>
<div class="outline-text-4" id="text-org1b1ed28">
<p>
<b>doom/load-session</b>
</p>
</div>
</div>
<div id="outline-container-orgb0159f2" class="outline-4">
<h4 id="orgb0159f2">Documentation</h4>
<div class="outline-text-4" id="text-orgb0159f2">
<p>
TODO
</p>

<p>
(fn FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-org718deb0" class="outline-3">
<h3 id="9453f505-66e6-4bb3-bda0-728697a281bd">SPC q Q</h3>
<div class="outline-text-3" id="text-9453f505-66e6-4bb3-bda0-728697a281bd">
</div>
<div id="outline-container-org7f7d222" class="outline-4">
<h4 id="org7f7d222">Function</h4>
<div class="outline-text-4" id="text-org7f7d222">
<p>
<b>evil-save-and-quit</b>
</p>
</div>
</div>
<div id="outline-container-orgfc12f6a" class="outline-4">
<h4 id="orgfc12f6a">Documentation</h4>
<div class="outline-text-4" id="text-orgfc12f6a">
<p>
Save all buffers and exit Emacs.
</p>
</div>
</div>
</div>
<div id="outline-container-orgab4661a" class="outline-3">
<h3 id="c81e453e-0bfc-4a07-a297-bde25a2b1fbb">SPC q R</h3>
<div class="outline-text-3" id="text-c81e453e-0bfc-4a07-a297-bde25a2b1fbb">
</div>
<div id="outline-container-orgcc04ed5" class="outline-4">
<h4 id="orgcc04ed5">Function</h4>
<div class="outline-text-4" id="text-orgcc04ed5">
<p>
<b>doom/restart</b>
</p>
</div>
</div>
<div id="outline-container-orgac5fd3a" class="outline-4">
<h4 id="orgac5fd3a">Documentation</h4>
<div class="outline-text-4" id="text-orgac5fd3a">
<p>
Restart Emacs.
</p>

<p>
When called interactively ARGS is interpreted as follows
</p>

<ul class="org-ul">
<li>with a single universal-argument (C-u) Emacs is restarted
with &#x2013;debug-init flag</li>
<li>with two universal-argument (C-u) Emacs is restarted with
-Q flag</li>
<li>with three universal-argument (C-u) the user prompted for
the arguments</li>
</ul>

<p>
When called non-interactively ARGS should be a list of arguments
with which Emacs should be restarted.
</p>

<p>
(fn &amp;optional ARGS)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1bf4ea" class="outline-3">
<h3 id="43795568-2f93-4159-813f-a07fbff4cd07">SPC q S</h3>
<div class="outline-text-3" id="text-43795568-2f93-4159-813f-a07fbff4cd07">
</div>
<div id="outline-container-orgadb229c" class="outline-4">
<h4 id="orgadb229c">Function</h4>
<div class="outline-text-4" id="text-orgadb229c">
<p>
<b>doom/save-session</b>
</p>
</div>
</div>
<div id="outline-container-orge3b64c6" class="outline-4">
<h4 id="orge3b64c6">Documentation</h4>
<div class="outline-text-4" id="text-orge3b64c6">
<p>
TODO
</p>

<p>
(fn FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-org33862f7" class="outline-3">
<h3 id="cfde721c-2f66-456b-904a-bda350c71f02">SPC q l</h3>
<div class="outline-text-3" id="text-cfde721c-2f66-456b-904a-bda350c71f02">
</div>
<div id="outline-container-orgb6dc37c" class="outline-4">
<h4 id="orgb6dc37c">Function</h4>
<div class="outline-text-4" id="text-orgb6dc37c">
<p>
<b>doom/quickload-session</b>
</p>
</div>
</div>
<div id="outline-container-orgc71135d" class="outline-4">
<h4 id="orgc71135d">Documentation</h4>
<div class="outline-text-4" id="text-orgc71135d">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org8721e4d" class="outline-3">
<h3 id="189958eb-b7bf-45b2-a78a-0821d48e1f52">SPC q q</h3>
<div class="outline-text-3" id="text-189958eb-b7bf-45b2-a78a-0821d48e1f52">
</div>
<div id="outline-container-org2b4fcc1" class="outline-4">
<h4 id="org2b4fcc1">Function</h4>
<div class="outline-text-4" id="text-org2b4fcc1">
<p>
<b>evil-quit-all</b>
</p>
</div>
</div>
<div id="outline-container-org257d64f" class="outline-4">
<h4 id="org257d64f">Documentation</h4>
<div class="outline-text-4" id="text-org257d64f">
<p>
Exits Emacs, asking for saving.
</p>
</div>
</div>
</div>
<div id="outline-container-org42cf57c" class="outline-3">
<h3 id="9c59ab4b-cda8-4024-9b55-6bdef57e0957">SPC q r</h3>
<div class="outline-text-3" id="text-9c59ab4b-cda8-4024-9b55-6bdef57e0957">
</div>
<div id="outline-container-org4ea5f46" class="outline-4">
<h4 id="org4ea5f46">Function</h4>
<div class="outline-text-4" id="text-org4ea5f46">
<p>
<b>doom/restart-and-restore</b>
</p>
</div>
</div>
<div id="outline-container-org5a6e34f" class="outline-4">
<h4 id="org5a6e34f">Documentation</h4>
<div class="outline-text-4" id="text-org5a6e34f">
<p>
TODO
</p>

<p>
(fn &amp;optional DEBUG)
</p>
</div>
</div>
</div>
<div id="outline-container-org6116e1c" class="outline-3">
<h3 id="2bff6a9c-08a4-4a62-8ac3-a04cd9f6a04f">SPC q s</h3>
<div class="outline-text-3" id="text-2bff6a9c-08a4-4a62-8ac3-a04cd9f6a04f">
</div>
<div id="outline-container-org4f368d2" class="outline-4">
<h4 id="org4f368d2">Function</h4>
<div class="outline-text-4" id="text-org4f368d2">
<p>
<b>doom/quicksave-session</b>
</p>
</div>
</div>
<div id="outline-container-org855d00a" class="outline-4">
<h4 id="org855d00a">Documentation</h4>
<div class="outline-text-4" id="text-org855d00a">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-orgdc178c2" class="outline-3">
<h3 id="edc660f7-f5c1-4d10-b263-58b815bee729">SPC p !</h3>
<div class="outline-text-3" id="text-edc660f7-f5c1-4d10-b263-58b815bee729">
</div>
<div id="outline-container-org27e1bde" class="outline-4">
<h4 id="org27e1bde">Function</h4>
<div class="outline-text-4" id="text-org27e1bde">
<p>
<b>projectile-run-shell-command-in-root</b>
</p>
</div>
</div>
<div id="outline-container-orgf34d660" class="outline-4">
<h4 id="orgf34d660">Documentation</h4>
<div class="outline-text-4" id="text-orgf34d660">
<p>
Invoke shell-command in the projects root.
</p>
</div>
</div>
</div>
<div id="outline-container-org9d0dd3f" class="outline-3">
<h3 id="8adcff30-082b-43ca-9027-c383bb9a961e">SPC p .</h3>
<div class="outline-text-3" id="text-8adcff30-082b-43ca-9027-c383bb9a961e">
</div>
<div id="outline-container-orga85e425" class="outline-4">
<h4 id="orga85e425">Function</h4>
<div class="outline-text-4" id="text-orga85e425">
<p>
<b>+default/browse-project</b>
</p>
</div>
</div>
<div id="outline-container-orgd55548d" class="outline-4">
<h4 id="orgd55548d">Documentation</h4>
</div>
</div>

<div id="outline-container-org7bbbde0" class="outline-3">
<h3 id="51bd426b-db4d-4b12-a430-e80f4dcbfa85">SPC p /</h3>
<div class="outline-text-3" id="text-51bd426b-db4d-4b12-a430-e80f4dcbfa85">
</div>
<div id="outline-container-org23fddba" class="outline-4">
<h4 id="org23fddba">Function</h4>
<div class="outline-text-4" id="text-org23fddba">
<p>
<b>projectile-find-file</b>
</p>
</div>
</div>
<div id="outline-container-org1df27c4" class="outline-4">
<h4 id="org1df27c4">Documentation</h4>
<div class="outline-text-4" id="text-org1df27c4">
<p>
Jump to a projects file using completion.
With a prefix arg INVALIDATE-CACHE invalidates the cache first.
</p>

<p>
(fn &amp;optional INVALIDATE-CACHE)
</p>
</div>
</div>
</div>
<div id="outline-container-org8642fdc" class="outline-3">
<h3 id="47046a75-53c9-4c72-8cf2-3e2db47d816f">SPC p c</h3>
<div class="outline-text-3" id="text-47046a75-53c9-4c72-8cf2-3e2db47d816f">
</div>
<div id="outline-container-orgf3e47be" class="outline-4">
<h4 id="orgf3e47be">Function</h4>
<div class="outline-text-4" id="text-orgf3e47be">
<p>
<b>projectile-compile-project</b>
</p>
</div>
</div>
<div id="outline-container-org63c6a93" class="outline-4">
<h4 id="org63c6a93">Documentation</h4>
<div class="outline-text-4" id="text-org63c6a93">
<p>
Run project compilation command.
</p>

<p>
Normally youll be prompted for a compilation command, unless
variable compilation-read-command.  You can force the prompt
with a prefix ARG.
</p>

<p>
(fn ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-orgabaffe5" class="outline-3">
<h3 id="5447c09f-e5eb-4899-a744-d2cebcdf2f57">SPC p o</h3>
<div class="outline-text-3" id="text-5447c09f-e5eb-4899-a744-d2cebcdf2f57">
</div>
<div id="outline-container-org356ef90" class="outline-4">
<h4 id="org356ef90">Function</h4>
<div class="outline-text-4" id="text-org356ef90">
<p>
<b>projectile-find-other-file</b>
</p>
</div>
</div>
<div id="outline-container-org19fcf77" class="outline-4">
<h4 id="org19fcf77">Documentation</h4>
<div class="outline-text-4" id="text-org19fcf77">
<p>
Switch between files with the same name but different extensions.
With FLEX-MATCHING, match any file that contains the base name of current file.
Other file extensions can be customized with the variable projectile-other-file-alist.
</p>

<p>
(fn &amp;optional FLEX-MATCHING)
</p>
</div>
</div>
</div>
<div id="outline-container-org8f8606e" class="outline-3">
<h3 id="72b618d1-aea8-4c99-b689-a00c8cc51ab1">SPC p p</h3>
<div class="outline-text-3" id="text-72b618d1-aea8-4c99-b689-a00c8cc51ab1">
</div>
<div id="outline-container-org412e7b6" class="outline-4">
<h4 id="org412e7b6">Function</h4>
<div class="outline-text-4" id="text-org412e7b6">
<p>
<b>projectile-switch-project</b>
</p>
</div>
</div>
<div id="outline-container-org498e1da" class="outline-4">
<h4 id="org498e1da">Documentation</h4>
<div class="outline-text-4" id="text-org498e1da">
<p>
Switch to a project we have visited before.
Invokes the command referenced by projectile-switch-project-action on switch.
With a prefix ARG invokes projectile-commander instead of
projectile-switch-project-action.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
