index.org
*** Documentation
Invokes ‘+ivy/tasks’ or ‘+helm/tasks’, depending on which is available.
** SPC p x
:PROPERTIES:
:CUSTOM_ID: 850d3af7-ce60-4799-9fa6-bf3997eb870c
:END:
*** Function
*projectile-invalidate-cache*
*** Documentation
Remove the current project’s files from ‘projectile-projects-cache’.

With a prefix argument PROMPT prompts for the name of the project whose cache
to invalidate.

(fn PROMPT)
** SPC o -
:PROPERTIES:
:CUSTOM_ID: cf15003c-9c45-4044-9a5f-628835450c00
:END:
*** Function
*dired-jump*
*** Documentation
Jump to Dired buffer corresponding to current buffer.
If in a file, Dired the current directory and move to file’s line.
If in Dired already, pop up a level and goto old directory’s line.
In case the proper Dired file line cannot be found, refresh the dired
buffer and try again.
When OTHER-WINDOW is non-nil, jump to Dired buffer in other window.
When FILE-NAME is non-nil, jump to its line in Dired.
Interactively with prefix argument, read FILE-NAME.

(fn &optional OTHER-WINDOW FILE-NAME)
** SPC o A
:PROPERTIES:
:CUSTOM_ID: 097c5064-d98a-4402-9e02-4328014d4f9e
:END:
*** Function
*org-agenda*
*** Documentation
Dispatch agenda commands to collect entries to the agenda buffer.
Prompts for a command to execute.  Any prefix arg will be passed
on to the selected command.  The default selections are:

a     Call ‘org-agenda-list’ to display the agenda for current day or week.
t     Call ‘org-todo-list’ to display the global todo list.
T     Call ‘org-todo-list’ to display the global todo list, select only
      entries with a specific TODO keyword (the user gets a prompt).
m     Call ‘org-tags-view’ to display headlines with tags matching
      a condition  (the user is prompted for the condition).
M     Like ‘m’, but select only TODO entries, no ordinary headlines.
e     Export views to associated files.
s     Search entries for keywords.
S     Search entries for keywords, only with TODO keywords.
/     Multi occur across all agenda files and also files listed
      in ‘org-agenda-text-search-extra-files’.
<     Restrict agenda commands to buffer, subtree, or region.
      Press several times to get the desired effect.
>     Remove a previous restriction.
#     List "stuck" projects.
!     Configure what "stuck" means.
C     Configure custom agenda commands.

More commands can be added by configuring the variable
‘org-agenda-custom-commands’.  In particular, specific tags and TODO keyword
searches can be pre-defined in this way.

If the current buffer is in Org mode and visiting a file, you can also
first press ‘<’ once to indicate that the agenda should be temporarily
(until the next use of ‘SPC o A’) restricted to the current file.
Pressing ‘<’ twice means to restrict to the current subtree or region
(if active).
** SPC o P
:PROPERTIES:
:CUSTOM_ID: f2ca4317-57a8-4481-aaf6-53be7cf88e53
:END:
*** Function
*+treemacs/find-file*
*** Documentation
Open treemacs (if necessary) and find current file.
** SPC o R
:PROPERTIES:
:CUSTOM_ID: c3ed250b-7275-449b-b46a-2f9fe9736f31
:END:
*** Function
*+eval/open-repl-same-window*
*** Documentation
Opens (or reopens) the REPL associated with the current major-mode and place
the cursor at the prompt.

If ARG (universal argument), prompt for a specific REPL to open.

(fn &optional ARG)
** SPC o b
:PROPERTIES:
:CUSTOM_ID: c42d56df-1cd5-4aaa-bc93-4393b9ed1f94
:END:
*** Function
*browse-url-of-file*
*** Documentation
Ask a WWW browser to display FILE.
Display the current buffer’s file if FILE is nil or if called
interactively.  Turn the filename into a URL with function
‘browse-url-file-url’.  Pass the URL to a browser using the
‘browse-url’ function then run ‘browse-url-of-file-hook’.
** SPC o i
:PROPERTIES:
:CUSTOM_ID: d1b28c1a-f878-4271-b6eb-3d16abf595fb
:END:
*** Function
*imenu-list-smart-toggle*
*** Documentation
Enable or disable ‘imenu-list-minor-mode’ according to buffer’s visibility.
If the imenu-list buffer is displayed in any window, disable
‘imenu-list-minor-mode’, otherwise enable it.
Note that all the windows in every frame searched, even invisible ones, not
only those in the selected frame.

(fn)
** SPC o p
:PROPERTIES:
:CUSTOM_ID: c1b8aaee-e425-4f5c-9a73-3321ecc0eff2
:END:
*** Function
*+treemacs/toggle*
*** Documentation
Initialize or toggle treemacs.

Ensures that only the current project is present and all other projects have
been removed.

Use ‘treemacs’ command for old functionality.
** SPC o r
:PROPERTIES:
:CUSTOM_ID: 60d23955-d838-4d50-94d7-77e1a60448f6
:END:
*** Function
*+eval/open-repl-other-window*
*** Documentation
Does ‘+eval/open-repl’, but in a popup window.

If ARG (universal argument), prompt for a specific REPL to open.

(fn &optional ARG)
** SPC n N
:PROPERTIES:
:CUSTOM_ID: 5b2fe451-598f-4739-8f6f-3027f9ddbbad
:END:
*** Function
*+default/browse-notes*
*** Documentation

** SPC n l
:PROPERTIES:
:CUSTOM_ID: 318398e5-b23b-440a-8e32-f84b010f3faf
:END:
*** Function
*org-store-link*
*** Documentation
Store a link to the current location.

This link is added to ‘org-stored-links’ and can later be inserted
into an Org buffer with ‘org-insert-link’ (‘C-c C-l’).

For some link types, a ‘M-x universal-argument’ prefix ARG is interpreted.  A single
‘M-x universal-argument’ negates ‘org-context-in-file-links’ for file links or
‘org-gnus-prefer-web-links’ for links to Usenet articles.

A ‘M-x universal-argument M-x universal-argument’ prefix ARG forces skipping storing functions that are not
part of Org core.

A ‘M-x universal-argument M-x universal-argument M-x universal-argument’ prefix ARG forces storing a link for each line in the
active region.

Assume the function is called interactively if INTERACTIVE? is
non-nil.

(fn ARG &optional INTERACTIVE\?)
** SPC n n
:PROPERTIES:
:CUSTOM_ID: 4377760d-a48e-437a-ab3f-a60e293b2926
:END:
*** Function
*+default/find-in-notes*
*** Documentation

** SPC n s
:PROPERTIES:
:CUSTOM_ID: b4023007-9482-426c-8a2e-f2261e36d39a
:END:
*** Function
*doom/open-scratch-buffer*
*** Documentation
Opens a scratch pad window in the same major-mode.

If ARG (universal argument), then open a persistent scratch pad buffer. You’ll
be prompted for its name, or to open a previously created. These are stored in
‘doom-scratch-files-dir’.

If a region is active, copy its contents to the scratch pad.
** SPC n x
:PROPERTIES:
:CUSTOM_ID: 9e2f7a7e-0456-4b0e-b853-e19620ab8b25
:END:
*** Function
*org-capture*
