index.html
<div id="outline-container-org735fdb8" class="outline-3">
<h3 id="4b91f61d-98cd-40b3-8bf2-39a9354dddb6">SPC p r</h3>
<div class="outline-text-3" id="text-4b91f61d-98cd-40b3-8bf2-39a9354dddb6">
</div>
<div id="outline-container-orge50bbdd" class="outline-4">
<h4 id="orge50bbdd">Function</h4>
<div class="outline-text-4" id="text-orge50bbdd">
<p>
<b>projectile-recentf</b>
</p>
</div>
</div>
<div id="outline-container-org1453795" class="outline-4">
<h4 id="org1453795">Documentation</h4>
<div class="outline-text-4" id="text-org1453795">
<p>
Show a list of recently visited files in a project.
</p>
</div>
</div>
</div>
<div id="outline-container-org7d96563" class="outline-3">
<h3 id="5f2bb02e-35aa-42f5-893f-71e5bfb5091b">SPC p t</h3>
<div class="outline-text-3" id="text-5f2bb02e-35aa-42f5-893f-71e5bfb5091b">
</div>
<div id="outline-container-orgb321f4e" class="outline-4">
<h4 id="orgb321f4e">Function</h4>
<div class="outline-text-4" id="text-orgb321f4e">
<p>
<b>+default/project-tasks</b>
</p>
</div>
</div>
<div id="outline-container-org5114d52" class="outline-4">
<h4 id="org5114d52">Documentation</h4>
<div class="outline-text-4" id="text-org5114d52">
<p>
Invokes +ivy/tasks or +helm/tasks, depending on which is available.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb17d1a6" class="outline-3">
<h3 id="850d3af7-ce60-4799-9fa6-bf3997eb870c">SPC p x</h3>
<div class="outline-text-3" id="text-850d3af7-ce60-4799-9fa6-bf3997eb870c">
</div>
<div id="outline-container-org0cad088" class="outline-4">
<h4 id="org0cad088">Function</h4>
<div class="outline-text-4" id="text-org0cad088">
<p>
<b>projectile-invalidate-cache</b>
</p>
</div>
</div>
<div id="outline-container-org04b4cda" class="outline-4">
<h4 id="org04b4cda">Documentation</h4>
<div class="outline-text-4" id="text-org04b4cda">
<p>
Remove the current projects files from projectile-projects-cache.
</p>

<p>
With a prefix argument PROMPT prompts for the name of the project whose cache
to invalidate.
</p>

<p>
(fn PROMPT)
</p>
</div>
</div>
</div>
<div id="outline-container-org86c4897" class="outline-3">
<h3 id="cf15003c-9c45-4044-9a5f-628835450c00">SPC o -</h3>
<div class="outline-text-3" id="text-cf15003c-9c45-4044-9a5f-628835450c00">
</div>
<div id="outline-container-org842eecb" class="outline-4">
<h4 id="org842eecb">Function</h4>
<div class="outline-text-4" id="text-org842eecb">
<p>
<b>dired-jump</b>
</p>
</div>
</div>
<div id="outline-container-orgc465790" class="outline-4">
<h4 id="orgc465790">Documentation</h4>
<div class="outline-text-4" id="text-orgc465790">
<p>
Jump to Dired buffer corresponding to current buffer.
If in a file, Dired the current directory and move to files line.
If in Dired already, pop up a level and goto old directorys line.
In case the proper Dired file line cannot be found, refresh the dired
buffer and try again.
When OTHER-WINDOW is non-nil, jump to Dired buffer in other window.
When FILE-NAME is non-nil, jump to its line in Dired.
Interactively with prefix argument, read FILE-NAME.
</p>

<p>
(fn &amp;optional OTHER-WINDOW FILE-NAME)
</p>
</div>
</div>
</div>
<div id="outline-container-org97d6cd7" class="outline-3">
<h3 id="097c5064-d98a-4402-9e02-4328014d4f9e">SPC o A</h3>
<div class="outline-text-3" id="text-097c5064-d98a-4402-9e02-4328014d4f9e">
</div>
<div id="outline-container-org309be04" class="outline-4">
<h4 id="org309be04">Function</h4>
<div class="outline-text-4" id="text-org309be04">
<p>
<b>org-agenda</b>
</p>
</div>
</div>
<div id="outline-container-org99c43b2" class="outline-4">
<h4 id="org99c43b2">Documentation</h4>
<div class="outline-text-4" id="text-org99c43b2">
<p>
Dispatch agenda commands to collect entries to the agenda buffer.
Prompts for a command to execute.  Any prefix arg will be passed
on to the selected command.  The default selections are:
</p>

<p>
a     Call org-agenda-list to display the agenda for current day or week.
t     Call org-todo-list to display the global todo list.
T     Call org-todo-list to display the global todo list, select only
      entries with a specific TODO keyword (the user gets a prompt).
m     Call org-tags-view to display headlines with tags matching
      a condition  (the user is prompted for the condition).
M     Like m, but select only TODO entries, no ordinary headlines.
e     Export views to associated files.
s     Search entries for keywords.
S     Search entries for keywords, only with TODO keywords.
/     Multi occur across all agenda files and also files listed
      in org-agenda-text-search-extra-files.
&lt;     Restrict agenda commands to buffer, subtree, or region.
      Press several times to get the desired effect.
&gt;     Remove a previous restriction.
</p>

<p>
!     Configure what "stuck" means.
C     Configure custom agenda commands.
</p>

<p>
More commands can be added by configuring the variable
org-agenda-custom-commands.  In particular, specific tags and TODO keyword
searches can be pre-defined in this way.
</p>

<p>
If the current buffer is in Org mode and visiting a file, you can also
first press &lt; once to indicate that the agenda should be temporarily
(until the next use of SPC o A) restricted to the current file.
Pressing &lt; twice means to restrict to the current subtree or region
(if active).
</p>
</div>
</div>
</div>
<div id="outline-container-org666af20" class="outline-3">
<h3 id="f2ca4317-57a8-4481-aaf6-53be7cf88e53">SPC o P</h3>
<div class="outline-text-3" id="text-f2ca4317-57a8-4481-aaf6-53be7cf88e53">
</div>
<div id="outline-container-org9880a7b" class="outline-4">
<h4 id="org9880a7b">Function</h4>
<div class="outline-text-4" id="text-org9880a7b">
<p>
<b>+treemacs/find-file</b>
</p>
</div>
</div>
<div id="outline-container-org68a6601" class="outline-4">
<h4 id="org68a6601">Documentation</h4>
<div class="outline-text-4" id="text-org68a6601">
<p>
Open treemacs (if necessary) and find current file.
</p>
</div>
</div>
</div>
<div id="outline-container-org49526df" class="outline-3">
<h3 id="c3ed250b-7275-449b-b46a-2f9fe9736f31">SPC o R</h3>
<div class="outline-text-3" id="text-c3ed250b-7275-449b-b46a-2f9fe9736f31">
</div>
<div id="outline-container-org0622417" class="outline-4">
<h4 id="org0622417">Function</h4>
<div class="outline-text-4" id="text-org0622417">
<p>
<b>+eval/open-repl-same-window</b>
</p>
</div>
</div>
<div id="outline-container-org61d8b44" class="outline-4">
<h4 id="org61d8b44">Documentation</h4>
<div class="outline-text-4" id="text-org61d8b44">
<p>
Opens (or reopens) the REPL associated with the current major-mode and place
the cursor at the prompt.
</p>

<p>
If ARG (universal argument), prompt for a specific REPL to open.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-org66b6fea" class="outline-3">
<h3 id="c42d56df-1cd5-4aaa-bc93-4393b9ed1f94">SPC o b</h3>
<div class="outline-text-3" id="text-c42d56df-1cd5-4aaa-bc93-4393b9ed1f94">
</div>
<div id="outline-container-orgd6b7b58" class="outline-4">
<h4 id="orgd6b7b58">Function</h4>
<div class="outline-text-4" id="text-orgd6b7b58">
<p>
<b>browse-url-of-file</b>
</p>
</div>
</div>
<div id="outline-container-org6de9e3c" class="outline-4">
<h4 id="org6de9e3c">Documentation</h4>
<div class="outline-text-4" id="text-org6de9e3c">
<p>
Ask a WWW browser to display FILE.
Display the current buffers file if FILE is nil or if called
interactively.  Turn the filename into a URL with function
browse-url-file-url.  Pass the URL to a browser using the
browse-url function then run browse-url-of-file-hook.
</p>
</div>
</div>
</div>
<div id="outline-container-org444410a" class="outline-3">
<h3 id="d1b28c1a-f878-4271-b6eb-3d16abf595fb">SPC o i</h3>
<div class="outline-text-3" id="text-d1b28c1a-f878-4271-b6eb-3d16abf595fb">
</div>
<div id="outline-container-orgecf2029" class="outline-4">
<h4 id="orgecf2029">Function</h4>
<div class="outline-text-4" id="text-orgecf2029">
<p>
<b>imenu-list-smart-toggle</b>
</p>
</div>
</div>
<div id="outline-container-orga98be81" class="outline-4">
<h4 id="orga98be81">Documentation</h4>
<div class="outline-text-4" id="text-orga98be81">
<p>
Enable or disable imenu-list-minor-mode according to buffers visibility.
If the imenu-list buffer is displayed in any window, disable
imenu-list-minor-mode, otherwise enable it.
Note that all the windows in every frame searched, even invisible ones, not
only those in the selected frame.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-orgaf44374" class="outline-3">
<h3 id="c1b8aaee-e425-4f5c-9a73-3321ecc0eff2">SPC o p</h3>
<div class="outline-text-3" id="text-c1b8aaee-e425-4f5c-9a73-3321ecc0eff2">
</div>
<div id="outline-container-org0d17027" class="outline-4">
<h4 id="org0d17027">Function</h4>
<div class="outline-text-4" id="text-org0d17027">
<p>
<b>+treemacs/toggle</b>
</p>
</div>
</div>
<div id="outline-container-org56ea339" class="outline-4">
<h4 id="org56ea339">Documentation</h4>
<div class="outline-text-4" id="text-org56ea339">
<p>
Initialize or toggle treemacs.
</p>

<p>
Ensures that only the current project is present and all other projects have
been removed.
</p>

<p>
Use treemacs command for old functionality.
</p>
</div>
</div>
</div>
