index.org
*** Documentation
:after advice: ‘+version-control|update-git-gutter’

Stage all changes to FILE.
With a prefix argument or when there is no file at point ask for
the file to be staged.  Otherwise stage the file at point without
requiring confirmation.

(fn FILE)
** SPC g U
:PROPERTIES:
:CUSTOM_ID: 492ddbd7-269c-4dbf-9209-0875e5dc9aa2
:END:
*** Function
*magit-unstage-file*
*** Documentation
:after advice: ‘+version-control|update-git-gutter’

Unstage all changes to FILE.
With a prefix argument or when there is no file at point ask for
the file to be unstaged.  Otherwise unstage the file at point
without requiring confirmation.

(fn FILE)
** SPC g [
:PROPERTIES:
:CUSTOM_ID: 2e9e00d3-ffb1-43b6-b820-b68de20565ef
:END:
*** Function
*git-gutter:previous-hunk*
*** Documentation
Move to previous diff hunk

(fn ARG)
** SPC g ]
:PROPERTIES:
:CUSTOM_ID: 078333bc-daed-46e2-bec8-546f48f572ee
:END:
*** Function
*git-gutter:next-hunk*
*** Documentation
Move to next diff hunk

(fn ARG)
** SPC g g
:PROPERTIES:
:CUSTOM_ID: be633158-9952-4c3e-9c11-3c0915a99e99
:END:
*** Function
*magit-status*
*** Documentation
Show the status of the current Git repository in a buffer.

If the current directory isn’t located within a Git repository,
then prompt for an existing repository or an arbitrary directory,
depending on option ‘magit-repository-directories’, and show the
status of the selected repository instead.

 If that option specifies any existing repositories, then offer
  those for completion and show the status buffer for the
  selected one.

 Otherwise read an arbitrary directory using regular file-name
  completion.  If the selected directory is the top-level of an
  existing working tree, then show the status buffer for that.

 Otherwise offer to initialize the selected directory as a new
  repository.  After creating the repository show its status
  buffer.

These fallback behaviors can also be forced using one or more
prefix arguments:

 With two prefix arguments (or more precisely a numeric prefix
  value of 16 or greater) read an arbitrary directory and act on
  it as described above.  The same could be accomplished using
  the command ‘magit-init’.

 With a single prefix argument read an existing repository, or
  if none can be found based on ‘magit-repository-directories’,
  then fall back to the same behavior as with two prefix
  arguments.

(fn &optional DIRECTORY CACHE)
** SPC g r
:PROPERTIES:
:CUSTOM_ID: 0e371fe0-8c93-4596-aae2-023e21069724
:END:
*** Function
*git-gutter:revert-hunk*
*** Documentation
Revert current hunk.
** SPC g s
:PROPERTIES:
:CUSTOM_ID: a03374e4-b9d7-4aa7-a006-6fd9a77ffc70
:END:
*** Function
*git-gutter:stage-hunk*
*** Documentation
Stage this hunk like ’git add -p’.
** SPC g t
:PROPERTIES:
:CUSTOM_ID: ebf87a91-7c8f-4b7c-a26e-eb5c86eb95dc
:END:
*** Function
*git-timemachine-toggle*
*** Documentation
Toggle git timemachine mode.

(fn)
** SPC g x
:PROPERTIES:
:CUSTOM_ID: 0f58bd0b-d0b4-49eb-b107-34902a0f7932
:END:
*** Function
*magit-file-delete*
*** Documentation
Delete the selected FILES or one file read in the minibuffer.

With a prefix argument FORCE do so even when the files have
uncommitted changes.  When the files aren’t being tracked in
Git, then fallback to using ‘delete-file’.

(fn FILES &optional FORCE)
** SPC f .
:PROPERTIES:
:CUSTOM_ID: 0bd9a0f1-550e-4eac-98f9-179c5e67d024
:END:
*** Function
*counsel-file-jump*
*** Documentation
Jump to a file below the current directory.
List all files within the current directory or any of its subdirectories.
INITIAL-INPUT can be given as the initial minibuffer input.
INITIAL-DIRECTORY, if non-nil, is used as the root directory for search.

(fn &optional INITIAL-INPUT INITIAL-DIRECTORY)
** SPC f /
:PROPERTIES:
:CUSTOM_ID: f23a7abe-065b-49c9-a5a7-5cd4e8f65cc6
:END:
*** Function
*projectile-find-file*
*** Documentation
Jump to a project’s file using completion.
With a prefix arg INVALIDATE-CACHE invalidates the cache first.

(fn &optional INVALIDATE-CACHE)
** SPC f >
:PROPERTIES:
:CUSTOM_ID: 6a963989-407e-47be-991c-b6afeea51272
:END:
*** Function
*doom/browse-in-other-project*
*** Documentation
Preforms ‘find-file’ in a known project of your choosing.
** SPC f ?
:PROPERTIES:
:CUSTOM_ID: bdba04d7-0cbb-42ec-a096-6550940351d6
:END:
*** Function
*doom/find-file-in-other-project*
*** Documentation
Preforms ‘projectile-find-file’ in a known project of your choosing.
** SPC f E
:PROPERTIES:
:CUSTOM_ID: 4fa53e94-1db1-4731-9b4e-a89d794c450e
:END:
*** Function
*+default/browse-emacsd*
*** Documentation

** SPC f P
:PROPERTIES:
:CUSTOM_ID: c4451e27-8e04-4d00-84a1-db425b616e4f
:END:
*** Function
*doom/open-private-config*
*** Documentation
TODO

(fn)
** SPC f R
:PROPERTIES:
:CUSTOM_ID: 3626d691-a3ee-445a-a50f-d93adfaf6f01
:END:
*** Function
*projectile-recentf*
*** Documentation
Show a list of recently visited files in a project.
** SPC f S
:PROPERTIES:
:CUSTOM_ID: cfe21cbd-4efc-4226-8be4-7277a462b5cb
:END:
*** Function
*doom/sudo-find-file*
