index.html
<div id="outline-container-org0420708" class="outline-3">
<h3 id="cab158d6-a07a-447f-a7f3-7c3b903bf94d">SPC g S</h3>
<div class="outline-text-3" id="text-cab158d6-a07a-447f-a7f3-7c3b903bf94d">
</div>
<div id="outline-container-org3d21ec0" class="outline-4">
<h4 id="org3d21ec0">Function</h4>
<div class="outline-text-4" id="text-org3d21ec0">
<p>
<b>magit-stage-file</b>
</p>
</div>
</div>
<div id="outline-container-orgc115236" class="outline-4">
<h4 id="orgc115236">Documentation</h4>
<div class="outline-text-4" id="text-orgc115236">
<p>
:after advice: +version-control|update-git-gutter
</p>

<p>
Stage all changes to FILE.
With a prefix argument or when there is no file at point ask for
the file to be staged.  Otherwise stage the file at point without
requiring confirmation.
</p>

<p>
(fn FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-org3216ac6" class="outline-3">
<h3 id="492ddbd7-269c-4dbf-9209-0875e5dc9aa2">SPC g U</h3>
<div class="outline-text-3" id="text-492ddbd7-269c-4dbf-9209-0875e5dc9aa2">
</div>
<div id="outline-container-org049b679" class="outline-4">
<h4 id="org049b679">Function</h4>
<div class="outline-text-4" id="text-org049b679">
<p>
<b>magit-unstage-file</b>
</p>
</div>
</div>
<div id="outline-container-org1f918c5" class="outline-4">
<h4 id="org1f918c5">Documentation</h4>
<div class="outline-text-4" id="text-org1f918c5">
<p>
:after advice: +version-control|update-git-gutter
</p>

<p>
Unstage all changes to FILE.
With a prefix argument or when there is no file at point ask for
the file to be unstaged.  Otherwise unstage the file at point
without requiring confirmation.
</p>

<p>
(fn FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-orge7a44e0" class="outline-3">
<h3 id="2e9e00d3-ffb1-43b6-b820-b68de20565ef">SPC g [</h3>
<div class="outline-text-3" id="text-2e9e00d3-ffb1-43b6-b820-b68de20565ef">
</div>
<div id="outline-container-orga000eb2" class="outline-4">
<h4 id="orga000eb2">Function</h4>
<div class="outline-text-4" id="text-orga000eb2">
<p>
<b>git-gutter:previous-hunk</b>
</p>
</div>
</div>
<div id="outline-container-org33eb161" class="outline-4">
<h4 id="org33eb161">Documentation</h4>
<div class="outline-text-4" id="text-org33eb161">
<p>
Move to previous diff hunk
</p>

<p>
(fn ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-orgb2c3e20" class="outline-3">
<h3 id="078333bc-daed-46e2-bec8-546f48f572ee">SPC g ]</h3>
<div class="outline-text-3" id="text-078333bc-daed-46e2-bec8-546f48f572ee">
</div>
<div id="outline-container-org92f2724" class="outline-4">
<h4 id="org92f2724">Function</h4>
<div class="outline-text-4" id="text-org92f2724">
<p>
<b>git-gutter:next-hunk</b>
</p>
</div>
</div>
<div id="outline-container-org9ff5ae6" class="outline-4">
<h4 id="org9ff5ae6">Documentation</h4>
<div class="outline-text-4" id="text-org9ff5ae6">
<p>
Move to next diff hunk
</p>

<p>
(fn ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd10db8c" class="outline-3">
<h3 id="be633158-9952-4c3e-9c11-3c0915a99e99">SPC g g</h3>
<div class="outline-text-3" id="text-be633158-9952-4c3e-9c11-3c0915a99e99">
</div>
<div id="outline-container-org5b8a454" class="outline-4">
<h4 id="org5b8a454">Function</h4>
<div class="outline-text-4" id="text-org5b8a454">
<p>
<b>magit-status</b>
</p>
</div>
</div>
<div id="outline-container-orgff443f4" class="outline-4">
<h4 id="orgff443f4">Documentation</h4>
<div class="outline-text-4" id="text-orgff443f4">
<p>
Show the status of the current Git repository in a buffer.
</p>

<p>
If the current directory isnt located within a Git repository,
then prompt for an existing repository or an arbitrary directory,
depending on option magit-repository-directories, and show the
status of the selected repository instead.
</p>

<p>
If that option specifies any existing repositories, then offer
 those for completion and show the status buffer for the
 selected one.
</p>

<p>
Otherwise read an arbitrary directory using regular file-name
 completion.  If the selected directory is the top-level of an
 existing working tree, then show the status buffer for that.
</p>

<p>
Otherwise offer to initialize the selected directory as a new
 repository.  After creating the repository show its status
 buffer.
</p>

<p>
These fallback behaviors can also be forced using one or more
prefix arguments:
</p>

<p>
With two prefix arguments (or more precisely a numeric prefix
 value of 16 or greater) read an arbitrary directory and act on
 it as described above.  The same could be accomplished using
 the command magit-init.
</p>

<p>
With a single prefix argument read an existing repository, or
 if none can be found based on magit-repository-directories,
 then fall back to the same behavior as with two prefix
 arguments.
</p>

<p>
(fn &amp;optional DIRECTORY CACHE)
</p>
</div>
</div>
</div>
<div id="outline-container-org36e7681" class="outline-3">
<h3 id="0e371fe0-8c93-4596-aae2-023e21069724">SPC g r</h3>
<div class="outline-text-3" id="text-0e371fe0-8c93-4596-aae2-023e21069724">
</div>
<div id="outline-container-orga7c3754" class="outline-4">
<h4 id="orga7c3754">Function</h4>
<div class="outline-text-4" id="text-orga7c3754">
<p>
<b>git-gutter:revert-hunk</b>
</p>
</div>
</div>
<div id="outline-container-orgdbb2281" class="outline-4">
<h4 id="orgdbb2281">Documentation</h4>
<div class="outline-text-4" id="text-orgdbb2281">
<p>
Revert current hunk.
</p>
</div>
</div>
</div>
<div id="outline-container-org823392a" class="outline-3">
<h3 id="a03374e4-b9d7-4aa7-a006-6fd9a77ffc70">SPC g s</h3>
<div class="outline-text-3" id="text-a03374e4-b9d7-4aa7-a006-6fd9a77ffc70">
</div>
<div id="outline-container-orgcf404f3" class="outline-4">
<h4 id="orgcf404f3">Function</h4>
<div class="outline-text-4" id="text-orgcf404f3">
<p>
<b>git-gutter:stage-hunk</b>
</p>
</div>
</div>
<div id="outline-container-org7ee5300" class="outline-4">
<h4 id="org7ee5300">Documentation</h4>
<div class="outline-text-4" id="text-org7ee5300">
<p>
Stage this hunk like git add -p.
</p>
</div>
</div>
</div>
<div id="outline-container-org9cf746e" class="outline-3">
<h3 id="ebf87a91-7c8f-4b7c-a26e-eb5c86eb95dc">SPC g t</h3>
<div class="outline-text-3" id="text-ebf87a91-7c8f-4b7c-a26e-eb5c86eb95dc">
</div>
<div id="outline-container-orgf0b14c4" class="outline-4">
<h4 id="orgf0b14c4">Function</h4>
<div class="outline-text-4" id="text-orgf0b14c4">
<p>
<b>git-timemachine-toggle</b>
</p>
</div>
</div>
<div id="outline-container-orgfb08b81" class="outline-4">
<h4 id="orgfb08b81">Documentation</h4>
<div class="outline-text-4" id="text-orgfb08b81">
<p>
Toggle git timemachine mode.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-orgcf42fa0" class="outline-3">
<h3 id="0f58bd0b-d0b4-49eb-b107-34902a0f7932">SPC g x</h3>
<div class="outline-text-3" id="text-0f58bd0b-d0b4-49eb-b107-34902a0f7932">
</div>
<div id="outline-container-orgb36747a" class="outline-4">
<h4 id="orgb36747a">Function</h4>
<div class="outline-text-4" id="text-orgb36747a">
<p>
<b>magit-file-delete</b>
</p>
</div>
</div>
<div id="outline-container-org1979485" class="outline-4">
<h4 id="org1979485">Documentation</h4>
<div class="outline-text-4" id="text-org1979485">
<p>
Delete the selected FILES or one file read in the minibuffer.
</p>

<p>
With a prefix argument FORCE do so even when the files have
uncommitted changes.  When the files arent being tracked in
Git, then fallback to using delete-file.
</p>

<p>
(fn FILES &amp;optional FORCE)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd1258f5" class="outline-3">
<h3 id="0bd9a0f1-550e-4eac-98f9-179c5e67d024">SPC f .</h3>
<div class="outline-text-3" id="text-0bd9a0f1-550e-4eac-98f9-179c5e67d024">
</div>
<div id="outline-container-org69538fc" class="outline-4">
<h4 id="org69538fc">Function</h4>
<div class="outline-text-4" id="text-org69538fc">
<p>
<b>counsel-file-jump</b>
</p>
</div>
</div>
<div id="outline-container-orgada2af2" class="outline-4">
<h4 id="orgada2af2">Documentation</h4>
<div class="outline-text-4" id="text-orgada2af2">
<p>
Jump to a file below the current directory.
List all files within the current directory or any of its subdirectories.
INITIAL-INPUT can be given as the initial minibuffer input.
INITIAL-DIRECTORY, if non-nil, is used as the root directory for search.
</p>

<p>
(fn &amp;optional INITIAL-INPUT INITIAL-DIRECTORY)
</p>
</div>
</div>
</div>
<div id="outline-container-org7fab5da" class="outline-3">
<h3 id="f23a7abe-065b-49c9-a5a7-5cd4e8f65cc6">SPC f /</h3>
<div class="outline-text-3" id="text-f23a7abe-065b-49c9-a5a7-5cd4e8f65cc6">
</div>
<div id="outline-container-org2802718" class="outline-4">
<h4 id="org2802718">Function</h4>
<div class="outline-text-4" id="text-org2802718">
<p>
<b>projectile-find-file</b>
</p>
</div>
</div>
<div id="outline-container-org3e3430a" class="outline-4">
<h4 id="org3e3430a">Documentation</h4>
<div class="outline-text-4" id="text-org3e3430a">
<p>
Jump to a projects file using completion.
With a prefix arg INVALIDATE-CACHE invalidates the cache first.
</p>

<p>
(fn &amp;optional INVALIDATE-CACHE)
</p>
</div>
</div>
</div>
<div id="outline-container-orgbf6db13" class="outline-3">
<h3 id="6a963989-407e-47be-991c-b6afeea51272">SPC f &gt;</h3>
<div class="outline-text-3" id="text-6a963989-407e-47be-991c-b6afeea51272">
</div>
<div id="outline-container-orgbd82702" class="outline-4">
<h4 id="orgbd82702">Function</h4>
<div class="outline-text-4" id="text-orgbd82702">
<p>
<b>doom/browse-in-other-project</b>
</p>
</div>
</div>
<div id="outline-container-orgcc347d0" class="outline-4">
<h4 id="orgcc347d0">Documentation</h4>
<div class="outline-text-4" id="text-orgcc347d0">
<p>
Preforms find-file in a known project of your choosing.
</p>
</div>
</div>
</div>
<div id="outline-container-org59d0336" class="outline-3">
<h3 id="bdba04d7-0cbb-42ec-a096-6550940351d6">SPC f ?</h3>
<div class="outline-text-3" id="text-bdba04d7-0cbb-42ec-a096-6550940351d6">
</div>
<div id="outline-container-org08de7c2" class="outline-4">
<h4 id="org08de7c2">Function</h4>
<div class="outline-text-4" id="text-org08de7c2">
<p>
<b>doom/find-file-in-other-project</b>
</p>
</div>
</div>
<div id="outline-container-orgd8306b5" class="outline-4">
<h4 id="orgd8306b5">Documentation</h4>
<div class="outline-text-4" id="text-orgd8306b5">
<p>
Preforms projectile-find-file in a known project of your choosing.
</p>
</div>
</div>
</div>
