index.org
*** Documentation
Open FILE as root.

(fn FILE)
** SPC f X
:PROPERTIES:
:CUSTOM_ID: 04a5ae29-a371-48fc-a7bb-184256008ef6
:END:
*** Function
*doom/delete-this-file*
*** Documentation
Delete FILENAME (defaults to the file associated with current buffer) and
kills the buffer. If FORCE-P, force the deletion (don’t ask for confirmation).

(fn &optional PATH FORCE-P)
** SPC f a
:PROPERTIES:
:CUSTOM_ID: 6419c48c-ad36-4493-8701-8ec2a35c7162
:END:
*** Function
*projectile-find-other-file*
*** Documentation
Switch between files with the same name but different extensions.
With FLEX-MATCHING, match any file that contains the base name of current file.
Other file extensions can be customized with the variable ‘projectile-other-file-alist’.

(fn &optional FLEX-MATCHING)
** SPC f d
:PROPERTIES:
:CUSTOM_ID: 75cdd776-f4e5-4a10-9d6f-5252b97ce1ab
:END:
*** Function
*dired*
*** Documentation
"Edit" directory DIRNAME--delete, rename, print, etc. some files in it.
Optional second argument SWITCHES specifies the ‘ls’ options used.
(Interactively, use a prefix argument to be able to specify SWITCHES.)

If DIRNAME is a string, Dired displays a list of files in DIRNAME (which
may also have shell wildcards appended to select certain files).

If DIRNAME is a cons, its first element is taken as the directory name
and the rest as an explicit list of files to make directory entries for.
In this case, SWITCHES are applied to each of the files separately, and
therefore switches that control the order of the files in the produced
listing have no effect.

You can flag files for deletion with d and then
delete them by typing x.
Type h after entering Dired for more info.

If DIRNAME is already in a Dired buffer, that buffer is used without refresh.

(fn DIRNAME &optional SWITCHES)
** SPC f e
:PROPERTIES:
:CUSTOM_ID: 7c44ae79-82ff-425e-9646-3b6e8f3ccbf7
:END:
*** Function
*+default/find-in-emacsd*
*** Documentation

** SPC f f
:PROPERTIES:
:CUSTOM_ID: 5d5b3a2c-c39c-49cb-bb48-cad996dabd08
:END:
*** Function
*find-file*
*** Documentation
Edit file FILENAME.
Switch to a buffer visiting file FILENAME,
creating one if none already exists.
Interactively, the default if you just type RET is the current directory,
but the visited file name is available through the minibuffer history:
type M-x next-history-element to pull it into the minibuffer.

The first time M-x next-history-element is used after Emacs prompts for
the file name, the result is affected by ‘file-name-at-point-functions’,
which by default try to guess the file name by looking at point in the
current buffer.  Customize the value of ‘file-name-at-point-functions’
or set it to nil, if you want only the visited file name and the
current directory to be available on first M-x next-history-element
request.

You can visit files on remote machines by specifying something
like /ssh:SOME_REMOTE_MACHINE:FILE for the file name.  You can
also visit local files as a different user by specifying
/sudo::FILE for the file name.
See the Info node ‘(tramp)File name Syntax’ in the Tramp Info
manual, for more about this.

Interactively, or if WILDCARDS is non-nil in a call from Lisp,
expand wildcards (if any) and visit multiple files.  You can
suppress wildcard expansion by setting ‘find-file-wildcards’ to nil.

To visit a file without any kind of conversion and without
automatically choosing a major mode, use M-x find-file-literally.

(fn FILENAME &optional WILDCARDS)
** SPC f p
:PROPERTIES:
:CUSTOM_ID: 38bb4388-3d65-4116-95fd-c63ffc58eea9
:END:
*** Function
*doom/find-file-in-private-config*
*** Documentation
TODO

(fn)
** SPC f r
:PROPERTIES:
:CUSTOM_ID: c76562db-cd7f-475e-9e01-0eed9d61cb46
:END:
*** Function
*recentf-open-files*
*** Documentation
Show a dialog to open a recent file.
If optional argument FILES is non-nil, it is a list of recently-opened
files to choose from.  It defaults to the whole recent list.
If optional argument BUFFER-NAME is non-nil, it is a buffer name to
use for the dialog.  It defaults to "*‘recentf-menu-title’*".
** SPC f s
:PROPERTIES:
:CUSTOM_ID: 6fa9b87e-7273-4e35-a6a9-0de4d9fd56c3
:END:
*** Function
*save-buffer*
*** Documentation
Save current buffer in visited file if modified.
Variations are described below.

By default, makes the previous version into a backup file
 if previously requested or if this is the first save.
Prefixed with one SPC u, marks this version
 to become a backup when the next save is done.
Prefixed with two SPC u’s,
 makes the previous version into a backup file.
Prefixed with three SPC u’s, marks this version
 to become a backup when the next save is done,
 and makes the previous version into a backup file.

With a numeric prefix argument of 0, never make the previous version
into a backup file.

Note that the various variables that control backups, such
as ‘version-control’, ‘backup-enable-predicate’, ‘vc-make-backup-files’,
and ‘backup-inhibited’, to name just the more popular ones, still
control whether a backup will actually be produced, even when you
invoke this command prefixed with two or three SPC u’s.

If a file’s name is FOO, the names of its numbered backup versions are
 FOO.~i~ for various integers i.  A non-numbered backup file is called FOO~.
Numeric backups (rather than FOO~) will be made if value of
 ‘version-control’ is not the atom ‘never’ and either there are already
 numeric versions of the file being backed up, or ‘version-control’ is
 non-nil.
We don’t want excessive versions piling up, so there are variables
 ‘kept-old-versions’, which tells Emacs how many oldest versions to keep,
 and ‘kept-new-versions’, which tells how many newest versions to keep.
 Defaults are 2 old versions and 2 new.
‘dired-kept-versions’ controls dired’s clean-directory (.) command.
If ‘delete-old-versions’ is nil, system will query user
 before trimming versions.  Otherwise it does it silently.

If ‘vc-make-backup-files’ is nil, which is the default,
 no backup files are made for files managed by version control.
 (This is because the version control system itself records previous versions.)

See the subroutine ‘basic-save-buffer’ for more information.

(fn &optional ARG)
** SPC f y
:PROPERTIES:
:CUSTOM_ID: 441e0cdb-7ce9-471c-8411-447af37b90ff
:END:
*** Function
*+default/yank-buffer-filename*
