index.html
<div id="outline-container-orgd8f6d54" class="outline-3">
<h3 id="4fa53e94-1db1-4731-9b4e-a89d794c450e">SPC f E</h3>
<div class="outline-text-3" id="text-4fa53e94-1db1-4731-9b4e-a89d794c450e">
</div>
<div id="outline-container-orgccdf562" class="outline-4">
<h4 id="orgccdf562">Function</h4>
<div class="outline-text-4" id="text-orgccdf562">
<p>
<b>+default/browse-emacsd</b>
</p>
</div>
</div>
<div id="outline-container-orgf095616" class="outline-4">
<h4 id="orgf095616">Documentation</h4>
</div>
</div>

<div id="outline-container-orga5baf31" class="outline-3">
<h3 id="c4451e27-8e04-4d00-84a1-db425b616e4f">SPC f P</h3>
<div class="outline-text-3" id="text-c4451e27-8e04-4d00-84a1-db425b616e4f">
</div>
<div id="outline-container-org4c26c88" class="outline-4">
<h4 id="org4c26c88">Function</h4>
<div class="outline-text-4" id="text-org4c26c88">
<p>
<b>doom/open-private-config</b>
</p>
</div>
</div>
<div id="outline-container-org06b1cf8" class="outline-4">
<h4 id="org06b1cf8">Documentation</h4>
<div class="outline-text-4" id="text-org06b1cf8">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-orgee183af" class="outline-3">
<h3 id="3626d691-a3ee-445a-a50f-d93adfaf6f01">SPC f R</h3>
<div class="outline-text-3" id="text-3626d691-a3ee-445a-a50f-d93adfaf6f01">
</div>
<div id="outline-container-orgecf4ce0" class="outline-4">
<h4 id="orgecf4ce0">Function</h4>
<div class="outline-text-4" id="text-orgecf4ce0">
<p>
<b>projectile-recentf</b>
</p>
</div>
</div>
<div id="outline-container-org02781bd" class="outline-4">
<h4 id="org02781bd">Documentation</h4>
<div class="outline-text-4" id="text-org02781bd">
<p>
Show a list of recently visited files in a project.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcd392a8" class="outline-3">
<h3 id="cfe21cbd-4efc-4226-8be4-7277a462b5cb">SPC f S</h3>
<div class="outline-text-3" id="text-cfe21cbd-4efc-4226-8be4-7277a462b5cb">
</div>
<div id="outline-container-orgd35a334" class="outline-4">
<h4 id="orgd35a334">Function</h4>
<div class="outline-text-4" id="text-orgd35a334">
<p>
<b>doom/sudo-find-file</b>
</p>
</div>
</div>
<div id="outline-container-orgb2124ea" class="outline-4">
<h4 id="orgb2124ea">Documentation</h4>
<div class="outline-text-4" id="text-orgb2124ea">
<p>
Open FILE as root.
</p>

<p>
(fn FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-org1bf55e4" class="outline-3">
<h3 id="04a5ae29-a371-48fc-a7bb-184256008ef6">SPC f X</h3>
<div class="outline-text-3" id="text-04a5ae29-a371-48fc-a7bb-184256008ef6">
</div>
<div id="outline-container-org49a15d2" class="outline-4">
<h4 id="org49a15d2">Function</h4>
<div class="outline-text-4" id="text-org49a15d2">
<p>
<b>doom/delete-this-file</b>
</p>
</div>
</div>
<div id="outline-container-org50f69c8" class="outline-4">
<h4 id="org50f69c8">Documentation</h4>
<div class="outline-text-4" id="text-org50f69c8">
<p>
Delete FILENAME (defaults to the file associated with current buffer) and
kills the buffer. If FORCE-P, force the deletion (dont ask for confirmation).
</p>

<p>
(fn &amp;optional PATH FORCE-P)
</p>
</div>
</div>
</div>
<div id="outline-container-org9baffa3" class="outline-3">
<h3 id="6419c48c-ad36-4493-8701-8ec2a35c7162">SPC f a</h3>
<div class="outline-text-3" id="text-6419c48c-ad36-4493-8701-8ec2a35c7162">
</div>
<div id="outline-container-org9dfb42e" class="outline-4">
<h4 id="org9dfb42e">Function</h4>
<div class="outline-text-4" id="text-org9dfb42e">
<p>
<b>projectile-find-other-file</b>
</p>
</div>
</div>
<div id="outline-container-orgbbbebc5" class="outline-4">
<h4 id="orgbbbebc5">Documentation</h4>
<div class="outline-text-4" id="text-orgbbbebc5">
<p>
Switch between files with the same name but different extensions.
With FLEX-MATCHING, match any file that contains the base name of current file.
Other file extensions can be customized with the variable projectile-other-file-alist.
</p>

<p>
(fn &amp;optional FLEX-MATCHING)
</p>
</div>
</div>
</div>
<div id="outline-container-org6f00ec0" class="outline-3">
<h3 id="75cdd776-f4e5-4a10-9d6f-5252b97ce1ab">SPC f d</h3>
<div class="outline-text-3" id="text-75cdd776-f4e5-4a10-9d6f-5252b97ce1ab">
</div>
<div id="outline-container-org47b129c" class="outline-4">
<h4 id="org47b129c">Function</h4>
<div class="outline-text-4" id="text-org47b129c">
<p>
<b>dired</b>
</p>
</div>
</div>
<div id="outline-container-org6300626" class="outline-4">
<h4 id="org6300626">Documentation</h4>
<div class="outline-text-4" id="text-org6300626">
<p>
"Edit" directory DIRNAME&#x2013;delete, rename, print, etc. some files in it.
Optional second argument SWITCHES specifies the ls options used.
(Interactively, use a prefix argument to be able to specify SWITCHES.)
</p>

<p>
If DIRNAME is a string, Dired displays a list of files in DIRNAME (which
may also have shell wildcards appended to select certain files).
</p>

<p>
If DIRNAME is a cons, its first element is taken as the directory name
and the rest as an explicit list of files to make directory entries for.
In this case, SWITCHES are applied to each of the files separately, and
therefore switches that control the order of the files in the produced
listing have no effect.
</p>

<p>
You can flag files for deletion with d and then
delete them by typing x.
Type h after entering Dired for more info.
</p>

<p>
If DIRNAME is already in a Dired buffer, that buffer is used without refresh.
</p>

<p>
(fn DIRNAME &amp;optional SWITCHES)
</p>
</div>
</div>
</div>
<div id="outline-container-org2f5fe9d" class="outline-3">
<h3 id="7c44ae79-82ff-425e-9646-3b6e8f3ccbf7">SPC f e</h3>
<div class="outline-text-3" id="text-7c44ae79-82ff-425e-9646-3b6e8f3ccbf7">
</div>
<div id="outline-container-org7c7e569" class="outline-4">
<h4 id="org7c7e569">Function</h4>
<div class="outline-text-4" id="text-org7c7e569">
<p>
<b>+default/find-in-emacsd</b>
</p>
</div>
</div>
<div id="outline-container-orgf1d3ffe" class="outline-4">
<h4 id="orgf1d3ffe">Documentation</h4>
</div>
</div>

<div id="outline-container-orgac5dd35" class="outline-3">
<h3 id="5d5b3a2c-c39c-49cb-bb48-cad996dabd08">SPC f f</h3>
<div class="outline-text-3" id="text-5d5b3a2c-c39c-49cb-bb48-cad996dabd08">
</div>
<div id="outline-container-orgf5853cd" class="outline-4">
<h4 id="orgf5853cd">Function</h4>
<div class="outline-text-4" id="text-orgf5853cd">
<p>
<b>find-file</b>
</p>
</div>
</div>
<div id="outline-container-org8745f9a" class="outline-4">
<h4 id="org8745f9a">Documentation</h4>
<div class="outline-text-4" id="text-org8745f9a">
<p>
Edit file FILENAME.
Switch to a buffer visiting file FILENAME,
creating one if none already exists.
Interactively, the default if you just type RET is the current directory,
but the visited file name is available through the minibuffer history:
type M-x next-history-element to pull it into the minibuffer.
</p>

<p>
The first time M-x next-history-element is used after Emacs prompts for
the file name, the result is affected by file-name-at-point-functions,
which by default try to guess the file name by looking at point in the
current buffer.  Customize the value of file-name-at-point-functions
or set it to nil, if you want only the visited file name and the
current directory to be available on first M-x next-history-element
request.
</p>

<p>
You can visit files on remote machines by specifying something
like /ssh:SOME<sub>REMOTE</sub><sub>MACHINE</sub>:FILE for the file name.  You can
also visit local files as a different user by specifying
/sudo::FILE for the file name.
See the Info node (tramp)File name Syntax in the Tramp Info
manual, for more about this.
</p>

<p>
Interactively, or if WILDCARDS is non-nil in a call from Lisp,
expand wildcards (if any) and visit multiple files.  You can
suppress wildcard expansion by setting find-file-wildcards to nil.
</p>

<p>
To visit a file without any kind of conversion and without
automatically choosing a major mode, use M-x find-file-literally.
</p>

<p>
(fn FILENAME &amp;optional WILDCARDS)
</p>
</div>
</div>
</div>
<div id="outline-container-orgfe69706" class="outline-3">
<h3 id="38bb4388-3d65-4116-95fd-c63ffc58eea9">SPC f p</h3>
<div class="outline-text-3" id="text-38bb4388-3d65-4116-95fd-c63ffc58eea9">
</div>
<div id="outline-container-orgc94fb00" class="outline-4">
<h4 id="orgc94fb00">Function</h4>
<div class="outline-text-4" id="text-orgc94fb00">
<p>
<b>doom/find-file-in-private-config</b>
</p>
</div>
</div>
<div id="outline-container-org00c6d6f" class="outline-4">
<h4 id="org00c6d6f">Documentation</h4>
<div class="outline-text-4" id="text-org00c6d6f">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org3f127db" class="outline-3">
<h3 id="c76562db-cd7f-475e-9e01-0eed9d61cb46">SPC f r</h3>
<div class="outline-text-3" id="text-c76562db-cd7f-475e-9e01-0eed9d61cb46">
</div>
<div id="outline-container-org1ea8ba6" class="outline-4">
<h4 id="org1ea8ba6">Function</h4>
<div class="outline-text-4" id="text-org1ea8ba6">
<p>
<b>recentf-open-files</b>
</p>
</div>
</div>
<div id="outline-container-orga9d3bdb" class="outline-4">
<h4 id="orga9d3bdb">Documentation</h4>
<div class="outline-text-4" id="text-orga9d3bdb">
<p>
Show a dialog to open a recent file.
If optional argument FILES is non-nil, it is a list of recently-opened
files to choose from.  It defaults to the whole recent list.
If optional argument BUFFER-NAME is non-nil, it is a buffer name to
use for the dialog.  It defaults to "<b>recentf-menu-title</b>".
</p>
</div>
</div>
</div>
