index.org
*** Documentation
:around advice: ‘ad-Advice-switch-to-buffer’
:around advice: ‘doom*run-switch-buffer-hooks’

Display buffer BUFFER-OR-NAME in the selected window.

WARNING: This is NOT the way to work on another buffer temporarily
within a Lisp program!  Use ‘set-buffer’ instead.  That avoids
messing with the window-buffer correspondences.

If the selected window cannot display the specified buffer
because it is a minibuffer window or strongly dedicated to
another buffer, call ‘pop-to-buffer’ to select the buffer in
another window.  In interactive use, if the selected window is
strongly dedicated to its buffer, the value of the option
‘switch-to-buffer-in-dedicated-window’ specifies how to proceed.

If called interactively, read the buffer name using ‘read-buffer’.
The variable ‘confirm-nonexistent-file-or-buffer’ determines
whether to request confirmation before creating a new buffer.
See ‘read-buffer’ for features related to input and completion
of buffer names.

BUFFER-OR-NAME may be a buffer, a string (a buffer name), or nil.
If BUFFER-OR-NAME is a string that does not identify an existing
buffer, create a buffer with that name.  If BUFFER-OR-NAME is
nil, switch to the buffer returned by ‘other-buffer’.

If optional argument NORECORD is non-nil, do not put the buffer
at the front of the buffer list, and do not make the window
displaying it the most recently selected one.

If optional argument FORCE-SAME-WINDOW is non-nil, the buffer
must be displayed in the selected window when called
non-interactively; if that is impossible, signal an error rather
than calling ‘pop-to-buffer’.  It has no effect when the option
‘switch-to-buffer-obey-display-actions’ is non-nil.

The option ‘switch-to-buffer-preserve-window-point’ can be used
to make the buffer appear at its last position in the selected
window.

If the option ‘switch-to-buffer-obey-display-actions’ is non-nil,
run the function ‘pop-to-buffer-same-window’ instead.
This may display the buffer in another window as specified by
‘display-buffer-overriding-action’, ‘display-buffer-alist’ and
other display related variables.  If this results in displaying
the buffer in the selected window, window start and point are adjusted
as prescribed by the option ‘switch-to-buffer-preserve-window-point’.
Otherwise, these are left alone.

Return the buffer switched to.

(fn BUFFER-OR-NAME &optional NORECORD FORCE-SAME-WINDOW)
** SPC b N
:PROPERTIES:
:CUSTOM_ID: 68fad855-9f08-4968-b4e8-8ade54aae707
:END:
*** Function
*evil-buffer-new*
*** Documentation
Creates a new buffer replacing the current window, optionally
   editing a certain FILE
** SPC b S
:PROPERTIES:
:CUSTOM_ID: f0e6c89e-63f3-41a5-9133-384256d5db13
:END:
*** Function
*doom/sudo-this-file*
*** Documentation
Open the current file as root.

(fn)
** SPC b [
:PROPERTIES:
:CUSTOM_ID: 023ee488-f3ba-433d-868a-05d27aec24cc
:END:
*** Function
*previous-buffer*
*** Documentation
In selected window switch to previous buffer.
** SPC b ]
:PROPERTIES:
:CUSTOM_ID: f5b38e30-260e-43f7-be4c-d4c13a8d0ede
:END:
*** Function
*next-buffer*
*** Documentation
In selected window switch to next buffer.
** SPC b b
:PROPERTIES:
:CUSTOM_ID: 319f4d01-a04e-4d89-a13c-361e8b65468a
:END:
*** Function
*persp-switch-to-buffer*
*** Documentation
Switch to buffer, read buffer with restriction to current perspective.
** SPC b k
:PROPERTIES:
:CUSTOM_ID: 41f8111a-a787-4f38-af71-0e9f408fd147
:END:
*** Function
*kill-this-buffer*
*** Documentation
:around advice: ‘doom*switch-to-fallback-buffer-maybe’

Kill the current buffer.
When called in the minibuffer, get out of the minibuffer
using ‘abort-recursive-edit’.

This command can be reliably invoked only from the menu bar,
otherwise it could decide to silently do nothing.

(fn)
** SPC b n
:PROPERTIES:
:CUSTOM_ID: 007139e3-8613-4a6e-9f49-6049f783ffc0
:END:
*** Function
*next-buffer*
*** Documentation
In selected window switch to next buffer.
** SPC b o
:PROPERTIES:
:CUSTOM_ID: 4a1355ad-d96a-40a3-a3e5-2c5769cafe01
:END:
*** Function
*doom/kill-other-buffers*
*** Documentation
Kill all other buffers (besides the current one).

If PROJECT-P (universal argument), kill only buffers that belong to the current
project.
** SPC b p
:PROPERTIES:
:CUSTOM_ID: 24f4e616-c3c6-4266-88b8-404c61dbc4aa
:END:
*** Function
*previous-buffer*
*** Documentation
In selected window switch to previous buffer.
** SPC b s
:PROPERTIES:
:CUSTOM_ID: 2a015be2-eb68-4fd4-ba8a-d4d8df158744
:END:
*** Function
*save-buffer*
*** Documentation
Save current buffer in visited file if modified.
Variations are described below.

By default, makes the previous version into a backup file
 if previously requested or if this is the first save.
Prefixed with one SPC u, marks this version
 to become a backup when the next save is done.
Prefixed with two SPC u’s,
 makes the previous version into a backup file.
Prefixed with three SPC u’s, marks this version
 to become a backup when the next save is done,
 and makes the previous version into a backup file.

With a numeric prefix argument of 0, never make the previous version
into a backup file.

Note that the various variables that control backups, such
as ‘version-control’, ‘backup-enable-predicate’, ‘vc-make-backup-files’,
and ‘backup-inhibited’, to name just the more popular ones, still
control whether a backup will actually be produced, even when you
invoke this command prefixed with two or three SPC u’s.

If a file’s name is FOO, the names of its numbered backup versions are
 FOO.~i~ for various integers i.  A non-numbered backup file is called FOO~.
Numeric backups (rather than FOO~) will be made if value of
 ‘version-control’ is not the atom ‘never’ and either there are already
 numeric versions of the file being backed up, or ‘version-control’ is
 non-nil.
We don’t want excessive versions piling up, so there are variables
 ‘kept-old-versions’, which tells Emacs how many oldest versions to keep,
 and ‘kept-new-versions’, which tells how many newest versions to keep.
 Defaults are 2 old versions and 2 new.
‘dired-kept-versions’ controls dired’s clean-directory (.) command.
If ‘delete-old-versions’ is nil, system will query user
 before trimming versions.  Otherwise it does it silently.

If ‘vc-make-backup-files’ is nil, which is the default,
 no backup files are made for files managed by version control.
 (This is because the version control system itself records previous versions.)

See the subroutine ‘basic-save-buffer’ for more information.

(fn &optional ARG)
** SPC b x
:PROPERTIES:
:CUSTOM_ID: 5b5d44ab-77db-4c39-b0a1-6006acca30a9
:END:
*** Function
*doom/open-scratch-buffer*
*** Documentation
Opens a scratch pad window in the same major-mode.

If ARG (universal argument), then open a persistent scratch pad buffer. You’ll
be prompted for its name, or to open a previously created. These are stored in
‘doom-scratch-files-dir’.

If a region is active, copy its contents to the scratch pad.
** SPC b z
:PROPERTIES:
:CUSTOM_ID: 911f8f07-dede-4c86-923c-208c6c6e18d5
:END:
*** Function
*bury-buffer*
