index.html
<div id="outline-container-orgb7927f8" class="outline-3">
<h3 id="d68f0498-9d90-4b97-87e8-1ad5baadc464">SPC b B</h3>
<div class="outline-text-3" id="text-d68f0498-9d90-4b97-87e8-1ad5baadc464">
</div>
<div id="outline-container-org3fae11e" class="outline-4">
<h4 id="org3fae11e">Function</h4>
<div class="outline-text-4" id="text-org3fae11e">
<p>
<b>switch-to-buffer</b>
</p>
</div>
</div>
<div id="outline-container-org68d2b20" class="outline-4">
<h4 id="org68d2b20">Documentation</h4>
<div class="outline-text-4" id="text-org68d2b20">
<p>
:around advice: ad-Advice-switch-to-buffer
:around advice: doom*run-switch-buffer-hooks
</p>

<p>
Display buffer BUFFER-OR-NAME in the selected window.
</p>

<p>
WARNING: This is NOT the way to work on another buffer temporarily
within a Lisp program!  Use set-buffer instead.  That avoids
messing with the window-buffer correspondences.
</p>

<p>
If the selected window cannot display the specified buffer
because it is a minibuffer window or strongly dedicated to
another buffer, call pop-to-buffer to select the buffer in
another window.  In interactive use, if the selected window is
strongly dedicated to its buffer, the value of the option
switch-to-buffer-in-dedicated-window specifies how to proceed.
</p>

<p>
If called interactively, read the buffer name using read-buffer.
The variable confirm-nonexistent-file-or-buffer determines
whether to request confirmation before creating a new buffer.
See read-buffer for features related to input and completion
of buffer names.
</p>

<p>
BUFFER-OR-NAME may be a buffer, a string (a buffer name), or nil.
If BUFFER-OR-NAME is a string that does not identify an existing
buffer, create a buffer with that name.  If BUFFER-OR-NAME is
nil, switch to the buffer returned by other-buffer.
</p>

<p>
If optional argument NORECORD is non-nil, do not put the buffer
at the front of the buffer list, and do not make the window
displaying it the most recently selected one.
</p>

<p>
If optional argument FORCE-SAME-WINDOW is non-nil, the buffer
must be displayed in the selected window when called
non-interactively; if that is impossible, signal an error rather
than calling pop-to-buffer.  It has no effect when the option
switch-to-buffer-obey-display-actions is non-nil.
</p>

<p>
The option switch-to-buffer-preserve-window-point can be used
to make the buffer appear at its last position in the selected
window.
</p>

<p>
If the option switch-to-buffer-obey-display-actions is non-nil,
run the function pop-to-buffer-same-window instead.
This may display the buffer in another window as specified by
display-buffer-overriding-action, display-buffer-alist and
other display related variables.  If this results in displaying
the buffer in the selected window, window start and point are adjusted
as prescribed by the option switch-to-buffer-preserve-window-point.
Otherwise, these are left alone.
</p>

<p>
Return the buffer switched to.
</p>

<p>
(fn BUFFER-OR-NAME &amp;optional NORECORD FORCE-SAME-WINDOW)
</p>
</div>
</div>
</div>
<div id="outline-container-org0523672" class="outline-3">
<h3 id="68fad855-9f08-4968-b4e8-8ade54aae707">SPC b N</h3>
<div class="outline-text-3" id="text-68fad855-9f08-4968-b4e8-8ade54aae707">
</div>
<div id="outline-container-org0373b7a" class="outline-4">
<h4 id="org0373b7a">Function</h4>
<div class="outline-text-4" id="text-org0373b7a">
<p>
<b>evil-buffer-new</b>
</p>
</div>
</div>
<div id="outline-container-org024afe3" class="outline-4">
<h4 id="org024afe3">Documentation</h4>
<div class="outline-text-4" id="text-org024afe3">
<p>
Creates a new buffer replacing the current window, optionally
   editing a certain FILE
</p>
</div>
</div>
</div>
<div id="outline-container-org50e72b0" class="outline-3">
<h3 id="f0e6c89e-63f3-41a5-9133-384256d5db13">SPC b S</h3>
<div class="outline-text-3" id="text-f0e6c89e-63f3-41a5-9133-384256d5db13">
</div>
<div id="outline-container-org23cdf03" class="outline-4">
<h4 id="org23cdf03">Function</h4>
<div class="outline-text-4" id="text-org23cdf03">
<p>
<b>doom/sudo-this-file</b>
</p>
</div>
</div>
<div id="outline-container-org8e330d2" class="outline-4">
<h4 id="org8e330d2">Documentation</h4>
<div class="outline-text-4" id="text-org8e330d2">
<p>
Open the current file as root.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org6d467ed" class="outline-3">
<h3 id="023ee488-f3ba-433d-868a-05d27aec24cc">SPC b [</h3>
<div class="outline-text-3" id="text-023ee488-f3ba-433d-868a-05d27aec24cc">
</div>
<div id="outline-container-org3d237ad" class="outline-4">
<h4 id="org3d237ad">Function</h4>
<div class="outline-text-4" id="text-org3d237ad">
<p>
<b>previous-buffer</b>
</p>
</div>
</div>
<div id="outline-container-orgca86c82" class="outline-4">
<h4 id="orgca86c82">Documentation</h4>
<div class="outline-text-4" id="text-orgca86c82">
<p>
In selected window switch to previous buffer.
</p>
</div>
</div>
</div>
<div id="outline-container-org3bb604f" class="outline-3">
<h3 id="f5b38e30-260e-43f7-be4c-d4c13a8d0ede">SPC b ]</h3>
<div class="outline-text-3" id="text-f5b38e30-260e-43f7-be4c-d4c13a8d0ede">
</div>
<div id="outline-container-orgd217e7d" class="outline-4">
<h4 id="orgd217e7d">Function</h4>
<div class="outline-text-4" id="text-orgd217e7d">
<p>
<b>next-buffer</b>
</p>
</div>
</div>
<div id="outline-container-org704554f" class="outline-4">
<h4 id="org704554f">Documentation</h4>
<div class="outline-text-4" id="text-org704554f">
<p>
In selected window switch to next buffer.
</p>
</div>
</div>
</div>
<div id="outline-container-org38f90f9" class="outline-3">
<h3 id="319f4d01-a04e-4d89-a13c-361e8b65468a">SPC b b</h3>
<div class="outline-text-3" id="text-319f4d01-a04e-4d89-a13c-361e8b65468a">
</div>
<div id="outline-container-orgf9a418c" class="outline-4">
<h4 id="orgf9a418c">Function</h4>
<div class="outline-text-4" id="text-orgf9a418c">
<p>
<b>persp-switch-to-buffer</b>
</p>
</div>
</div>
<div id="outline-container-orgc5f21ba" class="outline-4">
<h4 id="orgc5f21ba">Documentation</h4>
<div class="outline-text-4" id="text-orgc5f21ba">
<p>
Switch to buffer, read buffer with restriction to current perspective.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfad6cbc" class="outline-3">
<h3 id="41f8111a-a787-4f38-af71-0e9f408fd147">SPC b k</h3>
<div class="outline-text-3" id="text-41f8111a-a787-4f38-af71-0e9f408fd147">
</div>
<div id="outline-container-org68b7d0e" class="outline-4">
<h4 id="org68b7d0e">Function</h4>
<div class="outline-text-4" id="text-org68b7d0e">
<p>
<b>kill-this-buffer</b>
</p>
</div>
</div>
<div id="outline-container-org34c7c81" class="outline-4">
<h4 id="org34c7c81">Documentation</h4>
<div class="outline-text-4" id="text-org34c7c81">
<p>
:around advice: doom*switch-to-fallback-buffer-maybe
</p>

<p>
Kill the current buffer.
When called in the minibuffer, get out of the minibuffer
using abort-recursive-edit.
</p>

<p>
This command can be reliably invoked only from the menu bar,
otherwise it could decide to silently do nothing.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org7aa12cd" class="outline-3">
<h3 id="007139e3-8613-4a6e-9f49-6049f783ffc0">SPC b n</h3>
<div class="outline-text-3" id="text-007139e3-8613-4a6e-9f49-6049f783ffc0">
</div>
<div id="outline-container-org885bf56" class="outline-4">
<h4 id="org885bf56">Function</h4>
<div class="outline-text-4" id="text-org885bf56">
<p>
<b>next-buffer</b>
</p>
</div>
</div>
<div id="outline-container-org27a7324" class="outline-4">
<h4 id="org27a7324">Documentation</h4>
<div class="outline-text-4" id="text-org27a7324">
<p>
In selected window switch to next buffer.
</p>
</div>
</div>
</div>
<div id="outline-container-org5f075f1" class="outline-3">
<h3 id="4a1355ad-d96a-40a3-a3e5-2c5769cafe01">SPC b o</h3>
<div class="outline-text-3" id="text-4a1355ad-d96a-40a3-a3e5-2c5769cafe01">
</div>
<div id="outline-container-org7272619" class="outline-4">
<h4 id="org7272619">Function</h4>
<div class="outline-text-4" id="text-org7272619">
<p>
<b>doom/kill-other-buffers</b>
</p>
</div>
</div>
<div id="outline-container-org86e9a8a" class="outline-4">
<h4 id="org86e9a8a">Documentation</h4>
<div class="outline-text-4" id="text-org86e9a8a">
<p>
Kill all other buffers (besides the current one).
</p>

<p>
If PROJECT-P (universal argument), kill only buffers that belong to the current
project.
</p>
</div>
</div>
</div>
