index.org
*** Documentation
Go to imenu tag defined in all reachable buffers.
Reachable buffers are determined by applying functions in
‘imenu-anywhere-buffer-filter-functions’ to all buffers returned
by ‘imenu-anywhere-buffer-list-function’.

Sorting is done within each buffer and takes into account items’
length. Thus more recent buffers in ‘buffer-list’ and shorter
entries have higher priority.

(fn)
** SPC / b
:PROPERTIES:
:CUSTOM_ID: 165c441e-ab52-4517-a695-7b4f27607f6a
:END:
*** Function
*swiper*
*** Documentation
‘isearch’ with an overview.
When non-nil, INITIAL-INPUT is the initial search pattern.

(fn &optional INITIAL-INPUT)
** SPC / d
:PROPERTIES:
:CUSTOM_ID: 324c326d-b46b-41aa-bc49-a9e9f177d8c6
:END:
*** Function
*+default/search-from-cwd*
*** Documentation
Conduct a text search in files under the current folder.
If prefix ARG is set, prompt for a directory to search from.
** SPC / i
:PROPERTIES:
:CUSTOM_ID: 5acde342-4342-4312-b7f7-a44b21b78e76
:END:
*** Function
*imenu*
*** Documentation
Jump to a place in the buffer chosen using a buffer menu or mouse menu.
INDEX-ITEM specifies the position.  See ‘imenu-choose-buffer-index’
for more information.

(fn INDEX-ITEM)
** SPC / l
:PROPERTIES:
:CUSTOM_ID: 57ca7975-ea47-4837-bf4b-89e518b492d2
:END:
*** Function
*ace-link*
*** Documentation
Call the ace link function for the current ‘major-mode’

(fn)
** SPC / o
:PROPERTIES:
:CUSTOM_ID: 7a257daa-ac79-4bb5-9b2c-c02c724ef3a2
:END:
*** Function
*+lookup/online-select*
*** Documentation
Runs ‘+lookup/online’, but always prompts for the provider to use.
** SPC / p
:PROPERTIES:
:CUSTOM_ID: 7858ddc8-826c-4d30-99f7-02c347dca907
:END:
*** Function
*+default/search-project*
*** Documentation
Conduct a text search in files under the project root.
If prefix ARG is set, prompt for a project to search from.
** SPC h C-a
:PROPERTIES:
:CUSTOM_ID: 8bd28223-356f-43cf-9b8c-6122b92c8932
:END:
*** Function
*about-emacs*
*** Documentation
Display the *About GNU Emacs* buffer.
A fancy display is used on graphic displays, normal otherwise.
** SPC h C-c
:PROPERTIES:
:CUSTOM_ID: a759054d-fed2-48b8-99dc-dee8abd658f2
:END:
*** Function
*describe-coding-system*
*** Documentation
Display information about CODING-SYSTEM.

(fn CODING-SYSTEM)
** SPC h C-d
:PROPERTIES:
:CUSTOM_ID: 1222b38b-ca0f-40a8-941c-60057984b52b
:END:
*** Function
*view-emacs-debugging*
*** Documentation
Display info on how to debug Emacs problems.
** SPC h C-e
:PROPERTIES:
:CUSTOM_ID: e7b872d0-441e-43c2-a74e-351ad408a32b
:END:
*** Function
*view-external-packages*
*** Documentation
Display info on where to get more Emacs packages.
** SPC h C-f
:PROPERTIES:
:CUSTOM_ID: a054e492-e31f-4310-a53e-d3eff80a0a7e
:END:
*** Function
*view-emacs-FAQ*
*** Documentation
Display the Emacs Frequently Asked Questions (FAQ) file.
** SPC h C-h
:PROPERTIES:
:CUSTOM_ID: 9295daa6-561a-48d1-8ff4-17753c11b9e3
:END:
*** Function
*help-for-help*
*** Documentation
Help command.
** SPC h C-k
:PROPERTIES:
:CUSTOM_ID: 2d76f838-070b-47ea-a28a-edacf595d841
:END:
*** Function
*describe-key-briefly*
*** Documentation
Print the name of the functions KEY-LIST invokes.
KEY-LIST is a list of pairs (SEQ . RAW-SEQ) of key sequences, where
RAW-SEQ is the untranslated form of the key sequence SEQ.
If INSERT (the prefix arg) is non-nil, insert the message in the buffer.

While reading KEY-LIST interactively, this command temporarily enables
menu items or tool-bar buttons that are disabled to allow getting help
on them.

(fn &optional KEY-LIST INSERT UNTRANSLATED)
** SPC h C-l
:PROPERTIES:
:CUSTOM_ID: 48b97c49-0a89-41c8-af0f-30a1c2cdc02d
:END:
*** Function
*describe-language-environment*
*** Documentation
Describe how Emacs supports language environment LANGUAGE-NAME.

(fn LANGUAGE-NAME)
** SPC h RET
:PROPERTIES:
:CUSTOM_ID: 260569d7-34b8-4ba3-9061-2445b752d90b
:END:
*** Function
*info-emacs-manual*
*** Documentation
Display the Emacs manual in Info mode.
** SPC h C-n
:PROPERTIES:
:CUSTOM_ID: 23d24549-95b8-407a-86b1-6235f2c06ed2
:END:
*** Function
*view-emacs-news*
*** Documentation
Display info on recent changes to Emacs.
With argument, display info only for the selected version.

(fn &optional VERSION)
