index.html
<div id="outline-container-orgafc6bc8" class="outline-3">
<h3 id="e7441417-829b-45dd-a34e-a2b23b4df931">SPC / I</h3>
<div class="outline-text-3" id="text-e7441417-829b-45dd-a34e-a2b23b4df931">
</div>
<div id="outline-container-org81be710" class="outline-4">
<h4 id="org81be710">Function</h4>
<div class="outline-text-4" id="text-org81be710">
<p>
<b>imenu-anywhere</b>
</p>
</div>
</div>
<div id="outline-container-org852021a" class="outline-4">
<h4 id="org852021a">Documentation</h4>
<div class="outline-text-4" id="text-org852021a">
<p>
Go to imenu tag defined in all reachable buffers.
Reachable buffers are determined by applying functions in
imenu-anywhere-buffer-filter-functions to all buffers returned
by imenu-anywhere-buffer-list-function.
</p>

<p>
Sorting is done within each buffer and takes into account items
length. Thus more recent buffers in buffer-list and shorter
entries have higher priority.
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-orgeb9b0da" class="outline-3">
<h3 id="165c441e-ab52-4517-a695-7b4f27607f6a">SPC / b</h3>
<div class="outline-text-3" id="text-165c441e-ab52-4517-a695-7b4f27607f6a">
</div>
<div id="outline-container-org3c48880" class="outline-4">
<h4 id="org3c48880">Function</h4>
<div class="outline-text-4" id="text-org3c48880">
<p>
<b>swiper</b>
</p>
</div>
</div>
<div id="outline-container-org58be125" class="outline-4">
<h4 id="org58be125">Documentation</h4>
<div class="outline-text-4" id="text-org58be125">
<p>
isearch with an overview.
When non-nil, INITIAL-INPUT is the initial search pattern.
</p>

<p>
(fn &amp;optional INITIAL-INPUT)
</p>
</div>
</div>
</div>
<div id="outline-container-orge16bf39" class="outline-3">
<h3 id="324c326d-b46b-41aa-bc49-a9e9f177d8c6">SPC / d</h3>
<div class="outline-text-3" id="text-324c326d-b46b-41aa-bc49-a9e9f177d8c6">
</div>
<div id="outline-container-orge45caa3" class="outline-4">
<h4 id="orge45caa3">Function</h4>
<div class="outline-text-4" id="text-orge45caa3">
<p>
<b>+default/search-from-cwd</b>
</p>
</div>
</div>
<div id="outline-container-org47396bb" class="outline-4">
<h4 id="org47396bb">Documentation</h4>
<div class="outline-text-4" id="text-org47396bb">
<p>
Conduct a text search in files under the current folder.
If prefix ARG is set, prompt for a directory to search from.
</p>
</div>
</div>
</div>
<div id="outline-container-orgeb24a6f" class="outline-3">
<h3 id="5acde342-4342-4312-b7f7-a44b21b78e76">SPC / i</h3>
<div class="outline-text-3" id="text-5acde342-4342-4312-b7f7-a44b21b78e76">
</div>
<div id="outline-container-org58f9dd9" class="outline-4">
<h4 id="org58f9dd9">Function</h4>
<div class="outline-text-4" id="text-org58f9dd9">
<p>
<b>imenu</b>
</p>
</div>
</div>
<div id="outline-container-org3734c9f" class="outline-4">
<h4 id="org3734c9f">Documentation</h4>
<div class="outline-text-4" id="text-org3734c9f">
<p>
Jump to a place in the buffer chosen using a buffer menu or mouse menu.
INDEX-ITEM specifies the position.  See imenu-choose-buffer-index
for more information.
</p>

<p>
(fn INDEX-ITEM)
</p>
</div>
</div>
</div>
<div id="outline-container-orgb59c5c0" class="outline-3">
<h3 id="57ca7975-ea47-4837-bf4b-89e518b492d2">SPC / l</h3>
<div class="outline-text-3" id="text-57ca7975-ea47-4837-bf4b-89e518b492d2">
</div>
<div id="outline-container-orgc7c79bc" class="outline-4">
<h4 id="orgc7c79bc">Function</h4>
<div class="outline-text-4" id="text-orgc7c79bc">
<p>
<b>ace-link</b>
</p>
</div>
</div>
<div id="outline-container-org69a6c4f" class="outline-4">
<h4 id="org69a6c4f">Documentation</h4>
<div class="outline-text-4" id="text-org69a6c4f">
<p>
Call the ace link function for the current major-mode
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-orga8f5030" class="outline-3">
<h3 id="7a257daa-ac79-4bb5-9b2c-c02c724ef3a2">SPC / o</h3>
<div class="outline-text-3" id="text-7a257daa-ac79-4bb5-9b2c-c02c724ef3a2">
</div>
<div id="outline-container-org2935a7b" class="outline-4">
<h4 id="org2935a7b">Function</h4>
<div class="outline-text-4" id="text-org2935a7b">
<p>
<b>+lookup/online-select</b>
</p>
</div>
</div>
<div id="outline-container-org3d33a8f" class="outline-4">
<h4 id="org3d33a8f">Documentation</h4>
<div class="outline-text-4" id="text-org3d33a8f">
<p>
Runs +lookup/online, but always prompts for the provider to use.
</p>
</div>
</div>
</div>
<div id="outline-container-org4f76325" class="outline-3">
<h3 id="7858ddc8-826c-4d30-99f7-02c347dca907">SPC / p</h3>
<div class="outline-text-3" id="text-7858ddc8-826c-4d30-99f7-02c347dca907">
</div>
<div id="outline-container-org0cfa7f7" class="outline-4">
<h4 id="org0cfa7f7">Function</h4>
<div class="outline-text-4" id="text-org0cfa7f7">
<p>
<b>+default/search-project</b>
</p>
</div>
</div>
<div id="outline-container-orgabeca65" class="outline-4">
<h4 id="orgabeca65">Documentation</h4>
<div class="outline-text-4" id="text-orgabeca65">
<p>
Conduct a text search in files under the project root.
If prefix ARG is set, prompt for a project to search from.
</p>
</div>
</div>
</div>
<div id="outline-container-orge31fe76" class="outline-3">
<h3 id="8bd28223-356f-43cf-9b8c-6122b92c8932">SPC h C-a</h3>
<div class="outline-text-3" id="text-8bd28223-356f-43cf-9b8c-6122b92c8932">
</div>
<div id="outline-container-org91fe7ce" class="outline-4">
<h4 id="org91fe7ce">Function</h4>
<div class="outline-text-4" id="text-org91fe7ce">
<p>
<b>about-emacs</b>
</p>
</div>
</div>
<div id="outline-container-orga320270" class="outline-4">
<h4 id="orga320270">Documentation</h4>
<div class="outline-text-4" id="text-orga320270">
<p>
Display the <b>About GNU Emacs</b> buffer.
A fancy display is used on graphic displays, normal otherwise.
</p>
</div>
</div>
</div>
<div id="outline-container-org361d450" class="outline-3">
<h3 id="a759054d-fed2-48b8-99dc-dee8abd658f2">SPC h C-c</h3>
<div class="outline-text-3" id="text-a759054d-fed2-48b8-99dc-dee8abd658f2">
</div>
<div id="outline-container-org2d52685" class="outline-4">
<h4 id="org2d52685">Function</h4>
<div class="outline-text-4" id="text-org2d52685">
<p>
<b>describe-coding-system</b>
</p>
</div>
</div>
<div id="outline-container-orgb78dd54" class="outline-4">
<h4 id="orgb78dd54">Documentation</h4>
<div class="outline-text-4" id="text-orgb78dd54">
<p>
Display information about CODING-SYSTEM.
</p>

<p>
(fn CODING-SYSTEM)
</p>
</div>
</div>
</div>
<div id="outline-container-orged5f338" class="outline-3">
<h3 id="1222b38b-ca0f-40a8-941c-60057984b52b">SPC h C-d</h3>
<div class="outline-text-3" id="text-1222b38b-ca0f-40a8-941c-60057984b52b">
</div>
<div id="outline-container-orgab5669f" class="outline-4">
<h4 id="orgab5669f">Function</h4>
<div class="outline-text-4" id="text-orgab5669f">
<p>
<b>view-emacs-debugging</b>
</p>
</div>
</div>
<div id="outline-container-org9d71dbf" class="outline-4">
<h4 id="org9d71dbf">Documentation</h4>
<div class="outline-text-4" id="text-org9d71dbf">
<p>
Display info on how to debug Emacs problems.
</p>
</div>
</div>
</div>
<div id="outline-container-org3a41910" class="outline-3">
<h3 id="e7b872d0-441e-43c2-a74e-351ad408a32b">SPC h C-e</h3>
<div class="outline-text-3" id="text-e7b872d0-441e-43c2-a74e-351ad408a32b">
</div>
<div id="outline-container-orgebc11c2" class="outline-4">
<h4 id="orgebc11c2">Function</h4>
<div class="outline-text-4" id="text-orgebc11c2">
<p>
<b>view-external-packages</b>
</p>
</div>
</div>
<div id="outline-container-org206c165" class="outline-4">
<h4 id="org206c165">Documentation</h4>
<div class="outline-text-4" id="text-org206c165">
<p>
Display info on where to get more Emacs packages.
</p>
</div>
</div>
</div>
<div id="outline-container-org2c6f470" class="outline-3">
<h3 id="a054e492-e31f-4310-a53e-d3eff80a0a7e">SPC h C-f</h3>
<div class="outline-text-3" id="text-a054e492-e31f-4310-a53e-d3eff80a0a7e">
</div>
<div id="outline-container-org9e60c25" class="outline-4">
<h4 id="org9e60c25">Function</h4>
<div class="outline-text-4" id="text-org9e60c25">
<p>
<b>view-emacs-FAQ</b>
</p>
</div>
</div>
<div id="outline-container-orgc4c2ac3" class="outline-4">
<h4 id="orgc4c2ac3">Documentation</h4>
<div class="outline-text-4" id="text-orgc4c2ac3">
<p>
Display the Emacs Frequently Asked Questions (FAQ) file.
</p>
</div>
</div>
</div>
<div id="outline-container-org454b094" class="outline-3">
<h3 id="9295daa6-561a-48d1-8ff4-17753c11b9e3">SPC h C-h</h3>
<div class="outline-text-3" id="text-9295daa6-561a-48d1-8ff4-17753c11b9e3">
</div>
<div id="outline-container-org1b7003e" class="outline-4">
<h4 id="org1b7003e">Function</h4>
<div class="outline-text-4" id="text-org1b7003e">
<p>
<b>help-for-help</b>
</p>
</div>
</div>
<div id="outline-container-orgd25a7ad" class="outline-4">
<h4 id="orgd25a7ad">Documentation</h4>
<div class="outline-text-4" id="text-orgd25a7ad">
<p>
Help command.
</p>
</div>
</div>
</div>
<div id="outline-container-org518e001" class="outline-3">
<h3 id="2d76f838-070b-47ea-a28a-edacf595d841">SPC h C-k</h3>
<div class="outline-text-3" id="text-2d76f838-070b-47ea-a28a-edacf595d841">
</div>
<div id="outline-container-orgf77b649" class="outline-4">
<h4 id="orgf77b649">Function</h4>
<div class="outline-text-4" id="text-orgf77b649">
<p>
<b>describe-key-briefly</b>
</p>
</div>
</div>
<div id="outline-container-orgd99d019" class="outline-4">
<h4 id="orgd99d019">Documentation</h4>
<div class="outline-text-4" id="text-orgd99d019">
<p>
Print the name of the functions KEY-LIST invokes.
KEY-LIST is a list of pairs (SEQ . RAW-SEQ) of key sequences, where
RAW-SEQ is the untranslated form of the key sequence SEQ.
If INSERT (the prefix arg) is non-nil, insert the message in the buffer.
</p>

<p>
While reading KEY-LIST interactively, this command temporarily enables
menu items or tool-bar buttons that are disabled to allow getting help
on them.
</p>

<p>
(fn &amp;optional KEY-LIST INSERT UNTRANSLATED)
</p>
</div>
</div>
</div>
<div id="outline-container-org8e843a4" class="outline-3">
<h3 id="48b97c49-0a89-41c8-af0f-30a1c2cdc02d">SPC h C-l</h3>
<div class="outline-text-3" id="text-48b97c49-0a89-41c8-af0f-30a1c2cdc02d">
</div>
<div id="outline-container-org536beb9" class="outline-4">
<h4 id="org536beb9">Function</h4>
<div class="outline-text-4" id="text-org536beb9">
<p>
<b>describe-language-environment</b>
</p>
</div>
</div>
<div id="outline-container-org273017c" class="outline-4">
<h4 id="org273017c">Documentation</h4>
<div class="outline-text-4" id="text-org273017c">
<p>
Describe how Emacs supports language environment LANGUAGE-NAME.
</p>

<p>
(fn LANGUAGE-NAME)
</p>
</div>
</div>
</div>
<div id="outline-container-orge70f9d0" class="outline-3">
<h3 id="260569d7-34b8-4ba3-9061-2445b752d90b">SPC h RET</h3>
<div class="outline-text-3" id="text-260569d7-34b8-4ba3-9061-2445b752d90b">
</div>
<div id="outline-container-orgba11fa3" class="outline-4">
<h4 id="orgba11fa3">Function</h4>
<div class="outline-text-4" id="text-orgba11fa3">
<p>
<b>info-emacs-manual</b>
</p>
</div>
</div>
<div id="outline-container-org33d7365" class="outline-4">
<h4 id="org33d7365">Documentation</h4>
<div class="outline-text-4" id="text-org33d7365">
<p>
Display the Emacs manual in Info mode.
</p>
</div>
</div>
</div>
<div id="outline-container-org19eaa1f" class="outline-3">
<h3 id="23d24549-95b8-407a-86b1-6235f2c06ed2">SPC h C-n</h3>
<div class="outline-text-3" id="text-23d24549-95b8-407a-86b1-6235f2c06ed2">
</div>
<div id="outline-container-org33f4875" class="outline-4">
<h4 id="org33f4875">Function</h4>
<div class="outline-text-4" id="text-org33f4875">
<p>
<b>view-emacs-news</b>
</p>
</div>
</div>
<div id="outline-container-org1e49e9a" class="outline-4">
<h4 id="org1e49e9a">Documentation</h4>
<div class="outline-text-4" id="text-org1e49e9a">
<p>
Display info on recent changes to Emacs.
With argument, display info only for the selected version.
</p>

<p>
(fn &amp;optional VERSION)
</p>
</div>
</div>
</div>
