index.org
** SPC h C-o
:PROPERTIES:
:CUSTOM_ID: 93f1eb32-2d90-4822-96fe-d6e5b75840d7
:END:
*** Function
*describe-distribution*
*** Documentation
Display info on how to obtain the latest version of GNU Emacs.
** SPC h C-p
:PROPERTIES:
:CUSTOM_ID: e079a9b1-b3b1-4924-9923-cdaff4047908
:END:
*** Function
*view-emacs-problems*
*** Documentation
Display info on known problems with Emacs and possible workarounds.
** SPC h C-s
:PROPERTIES:
:CUSTOM_ID: d195498e-6e80-413d-8cee-3f890b06cb7e
:END:
*** Function
*search-forward-help-for-help*
*** Documentation
Search forward "help window".
** SPC h C-t
:PROPERTIES:
:CUSTOM_ID: bff59c71-b309-4e15-bb83-75c43e3be1f5
:END:
*** Function
*view-emacs-todo*
*** Documentation
Display the Emacs TODO list.

(fn &optional ARG)
** SPC h C-v
:PROPERTIES:
:CUSTOM_ID: ce608d29-9a41-4a5e-8604-ff46449046c2
:END:
*** Function
*doom/version*
*** Documentation
Display the current version of Doom & Emacs, including the current Doom
branch and commit.
** SPC h C-w
:PROPERTIES:
:CUSTOM_ID: e59eba1c-3b37-4009-96b2-414b16c61a8b
:END:
*** Function
*describe-no-warranty*
*** Documentation
Display info on all the kinds of warranty Emacs does NOT have.
** SPC h C-\
:PROPERTIES:
:CUSTOM_ID: 70a7bf65-2854-4548-b31b-e1103c54876e
:END:
*** Function
*describe-input-method*
*** Documentation
Describe input method INPUT-METHOD.

(fn INPUT-METHOD)
** SPC h '
:PROPERTIES:
:CUSTOM_ID: 5de27659-5aeb-489c-94cf-054ca5d232e8
:END:
*** Function
*describe-char*
*** Documentation
Describe position POS (interactively, point) and the char after POS.
POS is taken to be in BUFFER, or the current buffer if BUFFER is nil.
The information is displayed in buffer ‘*Help*’.

The position information includes POS; the total size of BUFFER; the
region limits, if narrowed; the column number; and the horizontal
scroll amount, if the buffer is horizontally scrolled.

The character information includes:
 its codepoint;
 its charset (see ‘char-charset’), overridden by the ‘charset’ text
   property at POS, if any;
 the codepoint of the character in the above charset;
 the character’s script (as defined by ‘char-script-table’)
 the character’s syntax, as produced by ‘syntax-after’
   and ‘internal-describe-syntax-value’;
 its category (see ‘char-category-set’ and ‘describe-char-categories’);
 how to input the character using the keyboard and input methods;
 how the character is encoded in BUFFER and in BUFFER’s file;
 the font and font glyphs used to display the character;
 the composition information for displaying the character (if relevant);
 the character’s canonical name and other properties defined by the
   Unicode Data Base;
 and widgets, buttons, overlays, and text properties relevant to POS.

(fn POS &optional BUFFER)
** SPC h .
:PROPERTIES:
:CUSTOM_ID: bd0eabce-e5e0-43e4-b020-a2441e62bda2
:END:
*** Function
*display-local-help*
*** Documentation
Display local help in the echo area.
This displays a short help message, namely the string produced by
the ‘kbd-help’ property at point.  If ‘kbd-help’ does not produce
a string, but the ‘help-echo’ property does, then that string is
printed instead.

A numeric argument ARG prevents display of a message in case
there is no help.  While ARG can be used interactively, it is
mainly meant for use from Lisp.

(fn &optional ARG)
** SPC h ?
:PROPERTIES:
:CUSTOM_ID: 371dbf06-f937-44a9-940c-a45ded2d2e7c
:END:
*** Function
*help-for-help*
*** Documentation
Help command.
** SPC h A
:PROPERTIES:
:CUSTOM_ID: 2370416e-7eb8-4587-9042-e9b51a52abbe
:END:
*** Function
*doom/describe-autodefs*
*** Documentation
Open the documentation of Doom autodefs.

What is an autodef? It’s a function or macro that is always defined, even if its
containing module is disabled (in which case it will safely no-op). This
syntactic sugar lets you use them without needing to check if they are
available.

(fn AUTODEF)
** SPC h B
:PROPERTIES:
:CUSTOM_ID: 84e4991a-b693-4526-b154-546fb67457cd
:END:
*** Function
*doom/open-bug-report*
*** Documentation
Open a markdown buffer destinated to populate the New Issue page on Doom
Emacs’ issue tracker.

If called when a backtrace buffer is present, it and the output of ‘doom-info’
will be automatically appended to the result.
** SPC h C
:PROPERTIES:
:CUSTOM_ID: a0810758-274c-421b-bc35-a7300662e14b
:END:
*** Function
*describe-coding-system*
*** Documentation
Display information about CODING-SYSTEM.

(fn CODING-SYSTEM)
** SPC h D
:PROPERTIES:
:CUSTOM_ID: c7542ba0-0002-40b9-818b-53e4dec59778
:END:
*** Function
*doom/open-manual*
*** Documentation
TODO

(fn)
** SPC h E
:PROPERTIES:
:CUSTOM_ID: 779869f2-7f6c-4a16-a562-a6e3df299811
:END:
*** Function
*doom/open-vanilla-sandbox*
