index.html
<div id="outline-container-orgf3aac52" class="outline-3">
<h3 id="93f1eb32-2d90-4822-96fe-d6e5b75840d7">SPC h C-o</h3>
<div class="outline-text-3" id="text-93f1eb32-2d90-4822-96fe-d6e5b75840d7">
</div>
<div id="outline-container-org7543dc7" class="outline-4">
<h4 id="org7543dc7">Function</h4>
<div class="outline-text-4" id="text-org7543dc7">
<p>
<b>describe-distribution</b>
</p>
</div>
</div>
<div id="outline-container-orgeecd248" class="outline-4">
<h4 id="orgeecd248">Documentation</h4>
<div class="outline-text-4" id="text-orgeecd248">
<p>
Display info on how to obtain the latest version of GNU Emacs.
</p>
</div>
</div>
</div>
<div id="outline-container-org82eddec" class="outline-3">
<h3 id="e079a9b1-b3b1-4924-9923-cdaff4047908">SPC h C-p</h3>
<div class="outline-text-3" id="text-e079a9b1-b3b1-4924-9923-cdaff4047908">
</div>
<div id="outline-container-orgefb299c" class="outline-4">
<h4 id="orgefb299c">Function</h4>
<div class="outline-text-4" id="text-orgefb299c">
<p>
<b>view-emacs-problems</b>
</p>
</div>
</div>
<div id="outline-container-org4de9fd2" class="outline-4">
<h4 id="org4de9fd2">Documentation</h4>
<div class="outline-text-4" id="text-org4de9fd2">
<p>
Display info on known problems with Emacs and possible workarounds.
</p>
</div>
</div>
</div>
<div id="outline-container-orgacabd57" class="outline-3">
<h3 id="d195498e-6e80-413d-8cee-3f890b06cb7e">SPC h C-s</h3>
<div class="outline-text-3" id="text-d195498e-6e80-413d-8cee-3f890b06cb7e">
</div>
<div id="outline-container-org74a37ac" class="outline-4">
<h4 id="org74a37ac">Function</h4>
<div class="outline-text-4" id="text-org74a37ac">
<p>
<b>search-forward-help-for-help</b>
</p>
</div>
</div>
<div id="outline-container-org785cedd" class="outline-4">
<h4 id="org785cedd">Documentation</h4>
<div class="outline-text-4" id="text-org785cedd">
<p>
Search forward "help window".
</p>
</div>
</div>
</div>
<div id="outline-container-orga053f76" class="outline-3">
<h3 id="bff59c71-b309-4e15-bb83-75c43e3be1f5">SPC h C-t</h3>
<div class="outline-text-3" id="text-bff59c71-b309-4e15-bb83-75c43e3be1f5">
</div>
<div id="outline-container-orgce1c594" class="outline-4">
<h4 id="orgce1c594">Function</h4>
<div class="outline-text-4" id="text-orgce1c594">
<p>
<b>view-emacs-todo</b>
</p>
</div>
</div>
<div id="outline-container-orgbd84a44" class="outline-4">
<h4 id="orgbd84a44">Documentation</h4>
<div class="outline-text-4" id="text-orgbd84a44">
<p>
Display the Emacs TODO list.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-org00aa55e" class="outline-3">
<h3 id="ce608d29-9a41-4a5e-8604-ff46449046c2">SPC h C-v</h3>
<div class="outline-text-3" id="text-ce608d29-9a41-4a5e-8604-ff46449046c2">
</div>
<div id="outline-container-orgfbec55d" class="outline-4">
<h4 id="orgfbec55d">Function</h4>
<div class="outline-text-4" id="text-orgfbec55d">
<p>
<b>doom/version</b>
</p>
</div>
</div>
<div id="outline-container-org73d3743" class="outline-4">
<h4 id="org73d3743">Documentation</h4>
<div class="outline-text-4" id="text-org73d3743">
<p>
Display the current version of Doom &amp; Emacs, including the current Doom
branch and commit.
</p>
</div>
</div>
</div>
<div id="outline-container-org3f1247c" class="outline-3">
<h3 id="e59eba1c-3b37-4009-96b2-414b16c61a8b">SPC h C-w</h3>
<div class="outline-text-3" id="text-e59eba1c-3b37-4009-96b2-414b16c61a8b">
</div>
<div id="outline-container-org4b1e219" class="outline-4">
<h4 id="org4b1e219">Function</h4>
<div class="outline-text-4" id="text-org4b1e219">
<p>
<b>describe-no-warranty</b>
</p>
</div>
</div>
<div id="outline-container-org73cc6ec" class="outline-4">
<h4 id="org73cc6ec">Documentation</h4>
<div class="outline-text-4" id="text-org73cc6ec">
<p>
Display info on all the kinds of warranty Emacs does NOT have.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfe7cf16" class="outline-3">
<h3 id="70a7bf65-2854-4548-b31b-e1103c54876e">SPC h C-\</h3>
<div class="outline-text-3" id="text-70a7bf65-2854-4548-b31b-e1103c54876e">
</div>
<div id="outline-container-orgd3cdb06" class="outline-4">
<h4 id="orgd3cdb06">Function</h4>
<div class="outline-text-4" id="text-orgd3cdb06">
<p>
<b>describe-input-method</b>
</p>
</div>
</div>
<div id="outline-container-org60febdf" class="outline-4">
<h4 id="org60febdf">Documentation</h4>
<div class="outline-text-4" id="text-org60febdf">
<p>
Describe input method INPUT-METHOD.
</p>

<p>
(fn INPUT-METHOD)
</p>
</div>
</div>
</div>
<div id="outline-container-orgdcc793e" class="outline-3">
<h3 id="5de27659-5aeb-489c-94cf-054ca5d232e8">SPC h '</h3>
<div class="outline-text-3" id="text-5de27659-5aeb-489c-94cf-054ca5d232e8">
</div>
<div id="outline-container-orgbd12dee" class="outline-4">
<h4 id="orgbd12dee">Function</h4>
<div class="outline-text-4" id="text-orgbd12dee">
<p>
<b>describe-char</b>
</p>
</div>
</div>
<div id="outline-container-org1b34138" class="outline-4">
<h4 id="org1b34138">Documentation</h4>
<div class="outline-text-4" id="text-org1b34138">
<p>
Describe position POS (interactively, point) and the char after POS.
POS is taken to be in BUFFER, or the current buffer if BUFFER is nil.
The information is displayed in buffer *Help*.
</p>

<p>
The position information includes POS; the total size of BUFFER; the
region limits, if narrowed; the column number; and the horizontal
scroll amount, if the buffer is horizontally scrolled.
</p>

<p>
The character information includes:
 its codepoint;
 its charset (see char-charset), overridden by the charset text
   property at POS, if any;
 the codepoint of the character in the above charset;
 the characters script (as defined by char-script-table)
 the characters syntax, as produced by syntax-after
   and internal-describe-syntax-value;
 its category (see char-category-set and describe-char-categories);
 how to input the character using the keyboard and input methods;
 how the character is encoded in BUFFER and in BUFFERs file;
 the font and font glyphs used to display the character;
 the composition information for displaying the character (if relevant);
 the characters canonical name and other properties defined by the
   Unicode Data Base;
 and widgets, buttons, overlays, and text properties relevant to POS.
</p>

<p>
(fn POS &amp;optional BUFFER)
</p>
</div>
</div>
</div>
<div id="outline-container-orgf336166" class="outline-3">
<h3 id="bd0eabce-e5e0-43e4-b020-a2441e62bda2">SPC h .</h3>
<div class="outline-text-3" id="text-bd0eabce-e5e0-43e4-b020-a2441e62bda2">
</div>
<div id="outline-container-orgdb1c84c" class="outline-4">
<h4 id="orgdb1c84c">Function</h4>
<div class="outline-text-4" id="text-orgdb1c84c">
<p>
<b>display-local-help</b>
</p>
</div>
</div>
<div id="outline-container-orgafd6e27" class="outline-4">
<h4 id="orgafd6e27">Documentation</h4>
<div class="outline-text-4" id="text-orgafd6e27">
<p>
Display local help in the echo area.
This displays a short help message, namely the string produced by
the kbd-help property at point.  If kbd-help does not produce
a string, but the help-echo property does, then that string is
printed instead.
</p>

<p>
A numeric argument ARG prevents display of a message in case
there is no help.  While ARG can be used interactively, it is
mainly meant for use from Lisp.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-org9a075b5" class="outline-3">
<h3 id="371dbf06-f937-44a9-940c-a45ded2d2e7c">SPC h ?</h3>
<div class="outline-text-3" id="text-371dbf06-f937-44a9-940c-a45ded2d2e7c">
</div>
<div id="outline-container-org071dd3d" class="outline-4">
<h4 id="org071dd3d">Function</h4>
<div class="outline-text-4" id="text-org071dd3d">
<p>
<b>help-for-help</b>
</p>
</div>
</div>
<div id="outline-container-orgb8b795b" class="outline-4">
<h4 id="orgb8b795b">Documentation</h4>
<div class="outline-text-4" id="text-orgb8b795b">
<p>
Help command.
</p>
</div>
</div>
</div>
<div id="outline-container-org45e8e67" class="outline-3">
<h3 id="2370416e-7eb8-4587-9042-e9b51a52abbe">SPC h A</h3>
<div class="outline-text-3" id="text-2370416e-7eb8-4587-9042-e9b51a52abbe">
</div>
<div id="outline-container-org2c79b82" class="outline-4">
<h4 id="org2c79b82">Function</h4>
<div class="outline-text-4" id="text-org2c79b82">
<p>
<b>doom/describe-autodefs</b>
</p>
</div>
</div>
<div id="outline-container-orgc5e7d1c" class="outline-4">
<h4 id="orgc5e7d1c">Documentation</h4>
<div class="outline-text-4" id="text-orgc5e7d1c">
<p>
Open the documentation of Doom autodefs.
</p>

<p>
What is an autodef? Its a function or macro that is always defined, even if its
containing module is disabled (in which case it will safely no-op). This
syntactic sugar lets you use them without needing to check if they are
available.
</p>

<p>
(fn AUTODEF)
</p>
</div>
</div>
</div>
<div id="outline-container-org63a40d7" class="outline-3">
<h3 id="84e4991a-b693-4526-b154-546fb67457cd">SPC h B</h3>
<div class="outline-text-3" id="text-84e4991a-b693-4526-b154-546fb67457cd">
</div>
<div id="outline-container-org387a238" class="outline-4">
<h4 id="org387a238">Function</h4>
<div class="outline-text-4" id="text-org387a238">
<p>
<b>doom/open-bug-report</b>
</p>
</div>
</div>
<div id="outline-container-orgc775c7a" class="outline-4">
<h4 id="orgc775c7a">Documentation</h4>
<div class="outline-text-4" id="text-orgc775c7a">
<p>
Open a markdown buffer destinated to populate the New Issue page on Doom
Emacs issue tracker.
</p>

<p>
If called when a backtrace buffer is present, it and the output of doom-info
will be automatically appended to the result.
</p>
</div>
</div>
</div>
