index.org
*** Documentation
Open the Emacs Lisp sandbox.

This is a test bed for running Emacs Lisp in an instance of Emacs with varying
amounts of Doom loaded, including:

  a) vanilla Emacs (nothing loaded),
  b) vanilla Doom (only Doom core) and
  c) Doom + modules - your private config.

This is done without sacrificing access to installed packages. Use the sandbox
to reproduce bugs and determine if Doom is to blame.
** SPC h F
:PROPERTIES:
:CUSTOM_ID: 30cc556b-c111-4334-9e60-4a8d924242d0
:END:
*** Function
*describe-face*
*** Documentation
Display the properties of face FACE on FRAME.
Interactively, FACE defaults to the faces of the character after point
and FRAME defaults to the selected frame.

If the optional argument FRAME is given, report on face FACE in that frame.
If FRAME is t, report on the defaults for face FACE (for new frames).
If FRAME is omitted or nil, use the selected frame.

(fn FACE &optional FRAME)
** SPC h I
:PROPERTIES:
:CUSTOM_ID: b9e9e349-815b-4d79-9249-30c207a876df
:END:
*** Function
*describe-input-method*
*** Documentation
Describe input method INPUT-METHOD.

(fn INPUT-METHOD)
** SPC h K
:PROPERTIES:
:CUSTOM_ID: 5f89992d-e664-493c-a16e-a2910130f3f4
:END:
*** Function
*Info-goto-emacs-key-command-node*
*** Documentation
Go to the node in the Emacs manual which describes the command bound to KEY.
KEY is a string.
Interactively, if the binding is ‘execute-extended-command’, a command is read.
The command is found by looking up in Emacs manual’s indices
or in another manual found via COMMAND’s ‘info-file’ property or
the variable ‘Info-file-list-for-emacs’.

(fn KEY)
** SPC h L
:PROPERTIES:
:CUSTOM_ID: b666eebf-22a1-4b08-a559-6b4962265e6e
:END:
*** Function
*global-command-log-mode*
*** Documentation

** SPC h M
:PROPERTIES:
:CUSTOM_ID: e020580f-8090-416a-bd42-6e52a71ad1eb
:END:
*** Function
*doom/describe-active-minor-mode*
*** Documentation
Get information on an active minor mode. Use ‘describe-minor-mode’ for a
selection of all minor-modes, active or not.

(fn MODE)
** SPC h O
:PROPERTIES:
:CUSTOM_ID: aba46802-da35-4223-baca-97b822056462
:END:
*** Function
*+lookup/online*
*** Documentation
Looks up SEARCH (a string) in you browser using PROVIDER.

PROVIDER should be a key of ‘+lookup-provider-url-alist’.

When used interactively, it will prompt for a query and, for the first time, the
provider from ‘+lookup-provider-url-alist’. On consecutive uses, the last
provider will be reused. If the universal argument is supplied, always prompt
for the provider.
** SPC h P
:PROPERTIES:
:CUSTOM_ID: e05bdc27-1f3c-4e29-936e-777e1c22af23
:END:
*** Function
*find-library*
*** Documentation
Find the Emacs Lisp source of LIBRARY.

Interactively, prompt for LIBRARY using the one at or near point.

(fn LIBRARY)
** SPC h S
:PROPERTIES:
:CUSTOM_ID: e6b3fad8-a4d5-46ff-ba77-caeff9b35327
:END:
*** Function
*info-lookup-symbol*
*** Documentation
:after advice: ‘+popup*switch-to-info-window’

Display the definition of SYMBOL, as found in the relevant manual.
When this command is called interactively, it reads SYMBOL from the
minibuffer.  In the minibuffer, use M-n to yank the default argument
value into the minibuffer so you can edit it.  The default symbol is the
one found at point.

With prefix arg MODE a query for the symbol help mode is offered.

(fn SYMBOL &optional MODE)
** SPC h T
:PROPERTIES:
:CUSTOM_ID: e5151b05-cb18-4328-a7a9-f183a0c0e3b7
:END:
*** Function
*doom/toggle-profiler*
*** Documentation
Toggle the Emacs profiler. Run it again to see the profiling report.
** SPC h V
:PROPERTIES:
:CUSTOM_ID: 195ae8b3-fd61-4e8f-8a3b-08afc3e3c2e9
:END:
*** Function
*set-variable*
*** Documentation
Set VARIABLE to VALUE.  VALUE is a Lisp object.
VARIABLE should be a user option variable name, a Lisp variable
meant to be customized by users.  You should enter VALUE in Lisp syntax,
so if you want VALUE to be a string, you must surround it with doublequotes.
VALUE is used literally, not evaluated.

If VARIABLE has a ‘variable-interactive’ property, that is used as if
it were the arg to ‘interactive’ (which see) to interactively read VALUE.

If VARIABLE has been defined with ‘defcustom’, then the type information
in the definition is used to check that VALUE is valid.

Note that this function is at heart equivalent to the basic ‘set’ function.
For a variable defined with ‘defcustom’, it does not pay attention to
any :set property that the variable might have (if you want that, use
M-x customize-set-variable instead).

With a prefix argument, set VARIABLE to VALUE buffer-locally.

(fn VARIABLE VALUE &optional MAKE-LOCAL)
** SPC h W
:PROPERTIES:
:CUSTOM_ID: 556e6136-bce5-46aa-a860-e719ef570ddf
:END:
*** Function
*+default/man-or-woman*
