index.html
<div id="outline-container-org57ddfd7" class="outline-3">
<h3 id="a0810758-274c-421b-bc35-a7300662e14b">SPC h C</h3>
<div class="outline-text-3" id="text-a0810758-274c-421b-bc35-a7300662e14b">
</div>
<div id="outline-container-org2b152ce" class="outline-4">
<h4 id="org2b152ce">Function</h4>
<div class="outline-text-4" id="text-org2b152ce">
<p>
<b>describe-coding-system</b>
</p>
</div>
</div>
<div id="outline-container-org542bbfe" class="outline-4">
<h4 id="org542bbfe">Documentation</h4>
<div class="outline-text-4" id="text-org542bbfe">
<p>
Display information about CODING-SYSTEM.
</p>

<p>
(fn CODING-SYSTEM)
</p>
</div>
</div>
</div>
<div id="outline-container-org2b28232" class="outline-3">
<h3 id="c7542ba0-0002-40b9-818b-53e4dec59778">SPC h D</h3>
<div class="outline-text-3" id="text-c7542ba0-0002-40b9-818b-53e4dec59778">
</div>
<div id="outline-container-orgb10e7e3" class="outline-4">
<h4 id="orgb10e7e3">Function</h4>
<div class="outline-text-4" id="text-orgb10e7e3">
<p>
<b>doom/open-manual</b>
</p>
</div>
</div>
<div id="outline-container-orgb7fe445" class="outline-4">
<h4 id="orgb7fe445">Documentation</h4>
<div class="outline-text-4" id="text-orgb7fe445">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org16c0f2f" class="outline-3">
<h3 id="779869f2-7f6c-4a16-a562-a6e3df299811">SPC h E</h3>
<div class="outline-text-3" id="text-779869f2-7f6c-4a16-a562-a6e3df299811">
</div>
<div id="outline-container-org8dab0f2" class="outline-4">
<h4 id="org8dab0f2">Function</h4>
<div class="outline-text-4" id="text-org8dab0f2">
<p>
<b>doom/open-vanilla-sandbox</b>
</p>
</div>
</div>
<div id="outline-container-org0a7f8cb" class="outline-4">
<h4 id="org0a7f8cb">Documentation</h4>
<div class="outline-text-4" id="text-org0a7f8cb">
<p>
Open the Emacs Lisp sandbox.
</p>

<p>
This is a test bed for running Emacs Lisp in an instance of Emacs with varying
amounts of Doom loaded, including:
</p>

<p>
a) vanilla Emacs (nothing loaded),
b) vanilla Doom (only Doom core) and
c) Doom + modules - your private config.
</p>

<p>
This is done without sacrificing access to installed packages. Use the sandbox
to reproduce bugs and determine if Doom is to blame.
</p>
</div>
</div>
</div>
<div id="outline-container-org7dcce96" class="outline-3">
<h3 id="30cc556b-c111-4334-9e60-4a8d924242d0">SPC h F</h3>
<div class="outline-text-3" id="text-30cc556b-c111-4334-9e60-4a8d924242d0">
</div>
<div id="outline-container-org54bab1b" class="outline-4">
<h4 id="org54bab1b">Function</h4>
<div class="outline-text-4" id="text-org54bab1b">
<p>
<b>describe-face</b>
</p>
</div>
</div>
<div id="outline-container-org8f0e4f8" class="outline-4">
<h4 id="org8f0e4f8">Documentation</h4>
<div class="outline-text-4" id="text-org8f0e4f8">
<p>
Display the properties of face FACE on FRAME.
Interactively, FACE defaults to the faces of the character after point
and FRAME defaults to the selected frame.
</p>

<p>
If the optional argument FRAME is given, report on face FACE in that frame.
If FRAME is t, report on the defaults for face FACE (for new frames).
If FRAME is omitted or nil, use the selected frame.
</p>

<p>
(fn FACE &amp;optional FRAME)
</p>
</div>
</div>
</div>
<div id="outline-container-org8dfa153" class="outline-3">
<h3 id="b9e9e349-815b-4d79-9249-30c207a876df">SPC h I</h3>
<div class="outline-text-3" id="text-b9e9e349-815b-4d79-9249-30c207a876df">
</div>
<div id="outline-container-org67cc95f" class="outline-4">
<h4 id="org67cc95f">Function</h4>
<div class="outline-text-4" id="text-org67cc95f">
<p>
<b>describe-input-method</b>
</p>
</div>
</div>
<div id="outline-container-orgcebc324" class="outline-4">
<h4 id="orgcebc324">Documentation</h4>
<div class="outline-text-4" id="text-orgcebc324">
<p>
Describe input method INPUT-METHOD.
</p>

<p>
(fn INPUT-METHOD)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc59c58a" class="outline-3">
<h3 id="5f89992d-e664-493c-a16e-a2910130f3f4">SPC h K</h3>
<div class="outline-text-3" id="text-5f89992d-e664-493c-a16e-a2910130f3f4">
</div>
<div id="outline-container-org9a3f4b0" class="outline-4">
<h4 id="org9a3f4b0">Function</h4>
<div class="outline-text-4" id="text-org9a3f4b0">
<p>
<b>Info-goto-emacs-key-command-node</b>
</p>
</div>
</div>
<div id="outline-container-org57868f0" class="outline-4">
<h4 id="org57868f0">Documentation</h4>
<div class="outline-text-4" id="text-org57868f0">
<p>
Go to the node in the Emacs manual which describes the command bound to KEY.
KEY is a string.
Interactively, if the binding is execute-extended-command, a command is read.
The command is found by looking up in Emacs manuals indices
or in another manual found via COMMANDs info-file property or
the variable Info-file-list-for-emacs.
</p>

<p>
(fn KEY)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd15d3bb" class="outline-3">
<h3 id="b666eebf-22a1-4b08-a559-6b4962265e6e">SPC h L</h3>
<div class="outline-text-3" id="text-b666eebf-22a1-4b08-a559-6b4962265e6e">
</div>
<div id="outline-container-org562f9e3" class="outline-4">
<h4 id="org562f9e3">Function</h4>
<div class="outline-text-4" id="text-org562f9e3">
<p>
<b>global-command-log-mode</b>
</p>
</div>
</div>
<div id="outline-container-orgdb289ba" class="outline-4">
<h4 id="orgdb289ba">Documentation</h4>
</div>
</div>

<div id="outline-container-org7028a20" class="outline-3">
<h3 id="e020580f-8090-416a-bd42-6e52a71ad1eb">SPC h M</h3>
<div class="outline-text-3" id="text-e020580f-8090-416a-bd42-6e52a71ad1eb">
</div>
<div id="outline-container-org3c6438c" class="outline-4">
<h4 id="org3c6438c">Function</h4>
<div class="outline-text-4" id="text-org3c6438c">
<p>
<b>doom/describe-active-minor-mode</b>
</p>
</div>
</div>
<div id="outline-container-org72048f1" class="outline-4">
<h4 id="org72048f1">Documentation</h4>
<div class="outline-text-4" id="text-org72048f1">
<p>
Get information on an active minor mode. Use describe-minor-mode for a
selection of all minor-modes, active or not.
</p>

<p>
(fn MODE)
</p>
</div>
</div>
</div>
<div id="outline-container-org674e330" class="outline-3">
<h3 id="aba46802-da35-4223-baca-97b822056462">SPC h O</h3>
<div class="outline-text-3" id="text-aba46802-da35-4223-baca-97b822056462">
</div>
<div id="outline-container-org8ef03f5" class="outline-4">
<h4 id="org8ef03f5">Function</h4>
<div class="outline-text-4" id="text-org8ef03f5">
<p>
<b>+lookup/online</b>
</p>
</div>
</div>
<div id="outline-container-org289c228" class="outline-4">
<h4 id="org289c228">Documentation</h4>
<div class="outline-text-4" id="text-org289c228">
<p>
Looks up SEARCH (a string) in you browser using PROVIDER.
</p>

<p>
PROVIDER should be a key of +lookup-provider-url-alist.
</p>

<p>
When used interactively, it will prompt for a query and, for the first time, the
provider from +lookup-provider-url-alist. On consecutive uses, the last
provider will be reused. If the universal argument is supplied, always prompt
for the provider.
</p>
</div>
</div>
</div>
<div id="outline-container-org3f239c8" class="outline-3">
<h3 id="e05bdc27-1f3c-4e29-936e-777e1c22af23">SPC h P</h3>
<div class="outline-text-3" id="text-e05bdc27-1f3c-4e29-936e-777e1c22af23">
</div>
<div id="outline-container-org32fdf43" class="outline-4">
<h4 id="org32fdf43">Function</h4>
<div class="outline-text-4" id="text-org32fdf43">
<p>
<b>find-library</b>
</p>
</div>
</div>
<div id="outline-container-org9626b3c" class="outline-4">
<h4 id="org9626b3c">Documentation</h4>
<div class="outline-text-4" id="text-org9626b3c">
<p>
Find the Emacs Lisp source of LIBRARY.
</p>

<p>
Interactively, prompt for LIBRARY using the one at or near point.
</p>

<p>
(fn LIBRARY)
</p>
</div>
</div>
</div>
<div id="outline-container-orgcbdf706" class="outline-3">
<h3 id="e6b3fad8-a4d5-46ff-ba77-caeff9b35327">SPC h S</h3>
<div class="outline-text-3" id="text-e6b3fad8-a4d5-46ff-ba77-caeff9b35327">
</div>
<div id="outline-container-orgab983dc" class="outline-4">
<h4 id="orgab983dc">Function</h4>
<div class="outline-text-4" id="text-orgab983dc">
<p>
<b>info-lookup-symbol</b>
</p>
</div>
</div>
<div id="outline-container-org96ad2c8" class="outline-4">
<h4 id="org96ad2c8">Documentation</h4>
<div class="outline-text-4" id="text-org96ad2c8">
<p>
:after advice: +popup*switch-to-info-window
</p>

<p>
Display the definition of SYMBOL, as found in the relevant manual.
When this command is called interactively, it reads SYMBOL from the
minibuffer.  In the minibuffer, use M-n to yank the default argument
value into the minibuffer so you can edit it.  The default symbol is the
one found at point.
</p>

<p>
With prefix arg MODE a query for the symbol help mode is offered.
</p>

<p>
(fn SYMBOL &amp;optional MODE)
</p>
</div>
</div>
</div>
<div id="outline-container-org453ef84" class="outline-3">
<h3 id="e5151b05-cb18-4328-a7a9-f183a0c0e3b7">SPC h T</h3>
<div class="outline-text-3" id="text-e5151b05-cb18-4328-a7a9-f183a0c0e3b7">
</div>
<div id="outline-container-org04d6e31" class="outline-4">
<h4 id="org04d6e31">Function</h4>
<div class="outline-text-4" id="text-org04d6e31">
<p>
<b>doom/toggle-profiler</b>
</p>
</div>
</div>
<div id="outline-container-orgd6b1e3b" class="outline-4">
<h4 id="orgd6b1e3b">Documentation</h4>
<div class="outline-text-4" id="text-orgd6b1e3b">
<p>
Toggle the Emacs profiler. Run it again to see the profiling report.
</p>
</div>
</div>
</div>
<div id="outline-container-org80635ee" class="outline-3">
<h3 id="195ae8b3-fd61-4e8f-8a3b-08afc3e3c2e9">SPC h V</h3>
<div class="outline-text-3" id="text-195ae8b3-fd61-4e8f-8a3b-08afc3e3c2e9">
</div>
<div id="outline-container-org8657690" class="outline-4">
<h4 id="org8657690">Function</h4>
<div class="outline-text-4" id="text-org8657690">
<p>
<b>set-variable</b>
</p>
</div>
</div>
<div id="outline-container-orgf382988" class="outline-4">
<h4 id="orgf382988">Documentation</h4>
<div class="outline-text-4" id="text-orgf382988">
<p>
Set VARIABLE to VALUE.  VALUE is a Lisp object.
VARIABLE should be a user option variable name, a Lisp variable
meant to be customized by users.  You should enter VALUE in Lisp syntax,
so if you want VALUE to be a string, you must surround it with doublequotes.
VALUE is used literally, not evaluated.
</p>

<p>
If VARIABLE has a variable-interactive property, that is used as if
it were the arg to interactive (which see) to interactively read VALUE.
</p>

<p>
If VARIABLE has been defined with defcustom, then the type information
in the definition is used to check that VALUE is valid.
</p>

<p>
Note that this function is at heart equivalent to the basic set function.
For a variable defined with defcustom, it does not pay attention to
any :set property that the variable might have (if you want that, use
M-x customize-set-variable instead).
</p>

<p>
With a prefix argument, set VARIABLE to VALUE buffer-locally.
</p>

<p>
(fn VARIABLE VALUE &amp;optional MAKE-LOCAL)
</p>
</div>
</div>
</div>
