index.org
*** Documentation
Invoke ‘man’ if man is installed, otherwise use ‘woman’.
** SPC h a
:PROPERTIES:
:CUSTOM_ID: 8f341881-a381-42b8-9090-2dbd958b967f
:END:
*** Function
*apropos*
*** Documentation
Show all meaningful Lisp symbols whose names match PATTERN.
Symbols are shown if they are defined as functions, variables, or
faces, or if they have nonempty property lists.

PATTERN can be a word, a list of words (separated by spaces),
or a regexp (using some regexp special characters).  If it is a word,
search for matches for that word as a substring.  If it is a list of words,
search for matches for any two (or more) of those words.

With SPC u prefix, or if ‘apropos-do-all’ is non-nil,
consider all symbols (if they match PATTERN).

Returns list of symbols and documentation found.

(fn PATTERN &optional DO-ALL)
** SPC h b
:PROPERTIES:
:CUSTOM_ID: f6c6cd82-00bf-4832-9d2d-f5724b3a809b
:END:
*** Function
*describe-bindings*
*** Documentation
Display a buffer showing a list of all defined keys, and their definitions.
The keys are displayed in order of precedence.

The optional argument PREFIX, if non-nil, should be a key sequence;
then we display only bindings that start with that prefix.
The optional argument BUFFER specifies which buffer’s bindings
to display (default, the current buffer).  BUFFER can be a buffer
or a buffer name.

(fn &optional PREFIX BUFFER)
** SPC h c
:PROPERTIES:
:CUSTOM_ID: d8834fbe-cb3f-4725-8760-cc1a60a0a027
:END:
*** Function
*describe-key-briefly*
*** Documentation
Print the name of the functions KEY-LIST invokes.
KEY-LIST is a list of pairs (SEQ . RAW-SEQ) of key sequences, where
RAW-SEQ is the untranslated form of the key sequence SEQ.
If INSERT (the prefix arg) is non-nil, insert the message in the buffer.

While reading KEY-LIST interactively, this command temporarily enables
menu items or tool-bar buttons that are disabled to allow getting help
on them.

(fn &optional KEY-LIST INSERT UNTRANSLATED)
** SPC h d
:PROPERTIES:
:CUSTOM_ID: a1bbf15e-1023-4453-b90a-6fffde357950
:END:
*** Function
*doom/describe-module*
*** Documentation
Open the documentation of CATEGORY MODULE.

CATEGORY is a keyword and MODULE is a symbol. e.g. :feature and ’evil.

Automatically selects a) the module at point (in private init files), b) the
module derived from a ‘featurep!’ or ‘require!’ call, c) the module that the
current file is in, or d) the module associated with the current major mode (see
‘doom--module-mode-alist’).

(fn CATEGORY MODULE)
** SPC h e
:PROPERTIES:
:CUSTOM_ID: 815de66f-6791-49d8-bed9-639a969dccd7
:END:
*** Function
*view-echo-area-messages*
*** Documentation
View the log of recent echo-area messages: the ‘*Messages*’ buffer.
The number of messages retained in that buffer
is specified by the variable ‘message-log-max’.
** SPC h f
:PROPERTIES:
:CUSTOM_ID: ff3bdf04-c0e5-4a64-996b-261a2514dfc7
:END:
*** Function
*describe-function*
*** Documentation
Display the full documentation of FUNCTION (a symbol).
When called from lisp, FUNCTION may also be a function object.

(fn FUNCTION)
** SPC h g
:PROPERTIES:
:CUSTOM_ID: c4a4b76b-2d8e-4f2d-a1b5-43ab554b7a78
:END:
*** Function
*describe-gnu-project*
*** Documentation
Browse online information on the GNU project.
** SPC h h
:PROPERTIES:
:CUSTOM_ID: 045b0a92-3056-4b04-9993-7160f865946d
:END:
*** Function
*doom/describe-symbol*
*** Documentation
Show help for SYMBOL, a variable, function or macro.

(fn SYMBOL)
** SPC h i
:PROPERTIES:
:CUSTOM_ID: 5ed2e118-29e0-45b3-8619-96c0f8fc7643
:END:
*** Function
*info*
*** Documentation
Enter Info, the documentation browser.
Optional argument FILE-OR-NODE specifies the file to examine;
the default is the top-level directory of Info.
Called from a program, FILE-OR-NODE may specify an Info node of the form
"(FILENAME)NODENAME".
Optional argument BUFFER specifies the Info buffer name;
the default buffer name is *info*.  If BUFFER exists,
just switch to BUFFER.  Otherwise, create a new buffer
with the top-level Info directory.

In interactive use, a non-numeric prefix argument directs
this command to read a file name from the minibuffer.

A numeric prefix argument of N selects an Info buffer named "*info*<N>".

The search path for Info files is in the variable ‘Info-directory-list’.
The top-level Info directory is made by combining all the files named ‘dir’
in all the directories in that path.

See a list of available Info commands in ‘Info-mode’.

(fn &optional FILE-OR-NODE BUFFER)
** SPC h k
:PROPERTIES:
:CUSTOM_ID: fdae618f-12bd-4d91-acef-d77ba08861ca
:END:
*** Function
*describe-key*
*** Documentation
Display documentation of the function invoked by KEY-LIST.
KEY-LIST can be any kind of a key sequence; it can include keyboard events,
mouse events, and/or menu events.  When calling from a program,
pass KEY-LIST as a list of elements (SEQ . RAW-SEQ) where SEQ is
a key-sequence and RAW-SEQ is its untranslated form.

While reading KEY-LIST interactively, this command temporarily enables
menu items or tool-bar buttons that are disabled to allow getting help
on them.

BUFFER is the buffer in which to lookup those keys; it defaults to the
current buffer.

(fn &optional KEY-LIST BUFFER UP-EVENT)
** SPC h l
:PROPERTIES:
:CUSTOM_ID: 1f20349f-bc75-43d5-b03b-ff0fd9c7ee29
:END:
*** Function
*view-lossage*
