index.html
<div id="outline-container-org161b2fd" class="outline-3">
<h3 id="556e6136-bce5-46aa-a860-e719ef570ddf">SPC h W</h3>
<div class="outline-text-3" id="text-556e6136-bce5-46aa-a860-e719ef570ddf">
</div>
<div id="outline-container-orgf58fc74" class="outline-4">
<h4 id="orgf58fc74">Function</h4>
<div class="outline-text-4" id="text-orgf58fc74">
<p>
<b>+default/man-or-woman</b>
</p>
</div>
</div>
<div id="outline-container-org034b0d2" class="outline-4">
<h4 id="org034b0d2">Documentation</h4>
<div class="outline-text-4" id="text-org034b0d2">
<p>
Invoke man if man is installed, otherwise use woman.
</p>
</div>
</div>
</div>
<div id="outline-container-orgabdc419" class="outline-3">
<h3 id="8f341881-a381-42b8-9090-2dbd958b967f">SPC h a</h3>
<div class="outline-text-3" id="text-8f341881-a381-42b8-9090-2dbd958b967f">
</div>
<div id="outline-container-orge179351" class="outline-4">
<h4 id="orge179351">Function</h4>
<div class="outline-text-4" id="text-orge179351">
<p>
<b>apropos</b>
</p>
</div>
</div>
<div id="outline-container-orgab82be9" class="outline-4">
<h4 id="orgab82be9">Documentation</h4>
<div class="outline-text-4" id="text-orgab82be9">
<p>
Show all meaningful Lisp symbols whose names match PATTERN.
Symbols are shown if they are defined as functions, variables, or
faces, or if they have nonempty property lists.
</p>

<p>
PATTERN can be a word, a list of words (separated by spaces),
or a regexp (using some regexp special characters).  If it is a word,
search for matches for that word as a substring.  If it is a list of words,
search for matches for any two (or more) of those words.
</p>

<p>
With SPC u prefix, or if apropos-do-all is non-nil,
consider all symbols (if they match PATTERN).
</p>

<p>
Returns list of symbols and documentation found.
</p>

<p>
(fn PATTERN &amp;optional DO-ALL)
</p>
</div>
</div>
</div>
<div id="outline-container-orga8b1bd0" class="outline-3">
<h3 id="f6c6cd82-00bf-4832-9d2d-f5724b3a809b">SPC h b</h3>
<div class="outline-text-3" id="text-f6c6cd82-00bf-4832-9d2d-f5724b3a809b">
</div>
<div id="outline-container-orgdbe647a" class="outline-4">
<h4 id="orgdbe647a">Function</h4>
<div class="outline-text-4" id="text-orgdbe647a">
<p>
<b>describe-bindings</b>
</p>
</div>
</div>
<div id="outline-container-org37aacc9" class="outline-4">
<h4 id="org37aacc9">Documentation</h4>
<div class="outline-text-4" id="text-org37aacc9">
<p>
Display a buffer showing a list of all defined keys, and their definitions.
The keys are displayed in order of precedence.
</p>

<p>
The optional argument PREFIX, if non-nil, should be a key sequence;
then we display only bindings that start with that prefix.
The optional argument BUFFER specifies which buffers bindings
to display (default, the current buffer).  BUFFER can be a buffer
or a buffer name.
</p>

<p>
(fn &amp;optional PREFIX BUFFER)
</p>
</div>
</div>
</div>
<div id="outline-container-org28ecdb8" class="outline-3">
<h3 id="d8834fbe-cb3f-4725-8760-cc1a60a0a027">SPC h c</h3>
<div class="outline-text-3" id="text-d8834fbe-cb3f-4725-8760-cc1a60a0a027">
</div>
<div id="outline-container-org8274462" class="outline-4">
<h4 id="org8274462">Function</h4>
<div class="outline-text-4" id="text-org8274462">
<p>
<b>describe-key-briefly</b>
</p>
</div>
</div>
<div id="outline-container-org74161af" class="outline-4">
<h4 id="org74161af">Documentation</h4>
<div class="outline-text-4" id="text-org74161af">
<p>
Print the name of the functions KEY-LIST invokes.
KEY-LIST is a list of pairs (SEQ . RAW-SEQ) of key sequences, where
RAW-SEQ is the untranslated form of the key sequence SEQ.
If INSERT (the prefix arg) is non-nil, insert the message in the buffer.
</p>

<p>
While reading KEY-LIST interactively, this command temporarily enables
menu items or tool-bar buttons that are disabled to allow getting help
on them.
</p>

<p>
(fn &amp;optional KEY-LIST INSERT UNTRANSLATED)
</p>
</div>
</div>
</div>
<div id="outline-container-org72c6878" class="outline-3">
<h3 id="a1bbf15e-1023-4453-b90a-6fffde357950">SPC h d</h3>
<div class="outline-text-3" id="text-a1bbf15e-1023-4453-b90a-6fffde357950">
</div>
<div id="outline-container-orga21f917" class="outline-4">
<h4 id="orga21f917">Function</h4>
<div class="outline-text-4" id="text-orga21f917">
<p>
<b>doom/describe-module</b>
</p>
</div>
</div>
<div id="outline-container-org8d816f3" class="outline-4">
<h4 id="org8d816f3">Documentation</h4>
<div class="outline-text-4" id="text-org8d816f3">
<p>
Open the documentation of CATEGORY MODULE.
</p>

<p>
CATEGORY is a keyword and MODULE is a symbol. e.g. :feature and evil.
</p>

<p>
Automatically selects a) the module at point (in private init files), b) the
module derived from a featurep! or require! call, c) the module that the
current file is in, or d) the module associated with the current major mode (see
doom&#x2013;module-mode-alist).
</p>

<p>
(fn CATEGORY MODULE)
</p>
</div>
</div>
</div>
<div id="outline-container-org33d8189" class="outline-3">
<h3 id="815de66f-6791-49d8-bed9-639a969dccd7">SPC h e</h3>
<div class="outline-text-3" id="text-815de66f-6791-49d8-bed9-639a969dccd7">
</div>
<div id="outline-container-org3524247" class="outline-4">
<h4 id="org3524247">Function</h4>
<div class="outline-text-4" id="text-org3524247">
<p>
<b>view-echo-area-messages</b>
</p>
</div>
</div>
<div id="outline-container-org1557690" class="outline-4">
<h4 id="org1557690">Documentation</h4>
<div class="outline-text-4" id="text-org1557690">
<p>
View the log of recent echo-area messages: the *Messages* buffer.
The number of messages retained in that buffer
is specified by the variable message-log-max.
</p>
</div>
</div>
</div>
<div id="outline-container-orga2db9d6" class="outline-3">
<h3 id="ff3bdf04-c0e5-4a64-996b-261a2514dfc7">SPC h f</h3>
<div class="outline-text-3" id="text-ff3bdf04-c0e5-4a64-996b-261a2514dfc7">
</div>
<div id="outline-container-orgd6687b5" class="outline-4">
<h4 id="orgd6687b5">Function</h4>
<div class="outline-text-4" id="text-orgd6687b5">
<p>
<b>describe-function</b>
</p>
</div>
</div>
<div id="outline-container-org06dc31e" class="outline-4">
<h4 id="org06dc31e">Documentation</h4>
<div class="outline-text-4" id="text-org06dc31e">
<p>
Display the full documentation of FUNCTION (a symbol).
When called from lisp, FUNCTION may also be a function object.
</p>

<p>
(fn FUNCTION)
</p>
</div>
</div>
</div>
<div id="outline-container-org83b95eb" class="outline-3">
<h3 id="c4a4b76b-2d8e-4f2d-a1b5-43ab554b7a78">SPC h g</h3>
<div class="outline-text-3" id="text-c4a4b76b-2d8e-4f2d-a1b5-43ab554b7a78">
</div>
<div id="outline-container-org6c8b615" class="outline-4">
<h4 id="org6c8b615">Function</h4>
<div class="outline-text-4" id="text-org6c8b615">
<p>
<b>describe-gnu-project</b>
</p>
</div>
</div>
<div id="outline-container-orge474846" class="outline-4">
<h4 id="orge474846">Documentation</h4>
<div class="outline-text-4" id="text-orge474846">
<p>
Browse online information on the GNU project.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcbe3e6f" class="outline-3">
<h3 id="045b0a92-3056-4b04-9993-7160f865946d">SPC h h</h3>
<div class="outline-text-3" id="text-045b0a92-3056-4b04-9993-7160f865946d">
</div>
<div id="outline-container-orgcff9882" class="outline-4">
<h4 id="orgcff9882">Function</h4>
<div class="outline-text-4" id="text-orgcff9882">
<p>
<b>doom/describe-symbol</b>
</p>
</div>
</div>
<div id="outline-container-orgf1c4339" class="outline-4">
<h4 id="orgf1c4339">Documentation</h4>
<div class="outline-text-4" id="text-orgf1c4339">
<p>
Show help for SYMBOL, a variable, function or macro.
</p>

<p>
(fn SYMBOL)
</p>
</div>
</div>
</div>
<div id="outline-container-org395cdd1" class="outline-3">
<h3 id="5ed2e118-29e0-45b3-8619-96c0f8fc7643">SPC h i</h3>
<div class="outline-text-3" id="text-5ed2e118-29e0-45b3-8619-96c0f8fc7643">
</div>
<div id="outline-container-orga74a7c0" class="outline-4">
<h4 id="orga74a7c0">Function</h4>
<div class="outline-text-4" id="text-orga74a7c0">
<p>
<b>info</b>
</p>
</div>
</div>
<div id="outline-container-org26258c9" class="outline-4">
<h4 id="org26258c9">Documentation</h4>
<div class="outline-text-4" id="text-org26258c9">
<p>
Enter Info, the documentation browser.
Optional argument FILE-OR-NODE specifies the file to examine;
the default is the top-level directory of Info.
Called from a program, FILE-OR-NODE may specify an Info node of the form
"(FILENAME)NODENAME".
Optional argument BUFFER specifies the Info buffer name;
the default buffer name is <b>info</b>.  If BUFFER exists,
just switch to BUFFER.  Otherwise, create a new buffer
with the top-level Info directory.
</p>

<p>
In interactive use, a non-numeric prefix argument directs
this command to read a file name from the minibuffer.
</p>

<p>
A numeric prefix argument of N selects an Info buffer named "*info*&lt;N&gt;".
</p>

<p>
The search path for Info files is in the variable Info-directory-list.
The top-level Info directory is made by combining all the files named dir
in all the directories in that path.
</p>

<p>
See a list of available Info commands in Info-mode.
</p>

<p>
(fn &amp;optional FILE-OR-NODE BUFFER)
</p>
</div>
</div>
</div>
<div id="outline-container-org5ee5081" class="outline-3">
<h3 id="fdae618f-12bd-4d91-acef-d77ba08861ca">SPC h k</h3>
<div class="outline-text-3" id="text-fdae618f-12bd-4d91-acef-d77ba08861ca">
</div>
<div id="outline-container-org15fdb88" class="outline-4">
<h4 id="org15fdb88">Function</h4>
<div class="outline-text-4" id="text-org15fdb88">
<p>
<b>describe-key</b>
</p>
</div>
</div>
<div id="outline-container-org963c435" class="outline-4">
<h4 id="org963c435">Documentation</h4>
<div class="outline-text-4" id="text-org963c435">
<p>
Display documentation of the function invoked by KEY-LIST.
KEY-LIST can be any kind of a key sequence; it can include keyboard events,
mouse events, and/or menu events.  When calling from a program,
pass KEY-LIST as a list of elements (SEQ . RAW-SEQ) where SEQ is
a key-sequence and RAW-SEQ is its untranslated form.
</p>

<p>
While reading KEY-LIST interactively, this command temporarily enables
menu items or tool-bar buttons that are disabled to allow getting help
on them.
</p>

<p>
BUFFER is the buffer in which to lookup those keys; it defaults to the
current buffer.
</p>

<p>
(fn &amp;optional KEY-LIST BUFFER UP-EVENT)
</p>
</div>
</div>
</div>
