index.org
*** Documentation
Display last few input keystrokes and the commands run.
For convenience this uses the same format as
‘edit-last-kbd-macro’.

To record all your input, use ‘open-dribble-file’.
** SPC h m
:PROPERTIES:
:CUSTOM_ID: 2b2f0e9c-f808-4907-adad-8c54601ad61d
:END:
*** Function
*describe-mode*
*** Documentation
Display documentation of current major mode and minor modes.
A brief summary of the minor modes comes first, followed by the
major mode description.  This is followed by detailed
descriptions of the minor modes, each on a separate page.

For this to work correctly for a minor mode, the mode’s indicator
variable (listed in ‘minor-mode-alist’) must also be a function
whose documentation describes the minor mode.

If called from Lisp with a non-nil BUFFER argument, display
documentation for the major and minor modes of that buffer.

(fn &optional BUFFER)
** SPC h n
:PROPERTIES:
:CUSTOM_ID: 04d9248e-407d-4bb5-86ce-82a3a0f9bfeb
:END:
*** Function
*doom/open-news*
*** Documentation
TODO

(fn)
** SPC h o
:PROPERTIES:
:CUSTOM_ID: dd3d9a7c-a09b-4f92-afd7-8f215799ccee
:END:
*** Function
*describe-symbol*
*** Documentation
Display the full documentation of SYMBOL.
Will show the info of SYMBOL as a function, variable, and/or face.
Optional arguments BUFFER and FRAME specify for which buffer and
frame to show the information about SYMBOL; they default to the
current buffer and the selected frame, respectively.

(fn SYMBOL &optional BUFFER FRAME)
** SPC h p
:PROPERTIES:
:CUSTOM_ID: a8ec95ce-a969-44b4-9968-38e946b9aeef
:END:
*** Function
*doom/describe-package*
*** Documentation
Like ‘describe-packages’, but is Doom aware.

Only shows installed packages. Includes information about where packages are
defined and configured.

If prefix arg is prsent, refresh the cache.

(fn PACKAGE)
** SPC h q
:PROPERTIES:
:CUSTOM_ID: 411fe133-4f1f-47d5-8159-932c1da1a3b2
:END:
*** Function
*help-quit*
*** Documentation
Just exit from the Help command’s command loop.
** SPC h s
:PROPERTIES:
:CUSTOM_ID: a5e5a1c1-ec70-43bb-b4ec-85ad07025432
:END:
*** Function
*describe-syntax*
*** Documentation
Describe the syntax specifications in the syntax table of BUFFER.
The descriptions are inserted in a help buffer, which is then displayed.
BUFFER defaults to the current buffer.

(fn &optional BUFFER)
** SPC h t
:PROPERTIES:
:CUSTOM_ID: 914642f8-4c80-49ab-8573-57b29753483d
:END:
*** Function
*help-with-tutorial*
*** Documentation
Select the Emacs learn-by-doing tutorial.
If there is a tutorial version written in the language
of the selected language environment, that version is used.
If there’s no tutorial in that language, ‘TUTORIAL’ is selected.
With ARG, you are asked to choose which language.
If DONT-ASK-FOR-REVERT is non-nil the buffer is reverted without
any question when restarting the tutorial.

If any of the standard Emacs key bindings that are used in the
tutorial have been changed then an explanatory note about this is
shown in the beginning of the tutorial buffer.

When the tutorial buffer is killed the content and the point
position in the buffer is saved so that the tutorial may be
resumed later.

(fn &optional ARG DONT-ASK-FOR-REVERT)
** SPC h v
:PROPERTIES:
:CUSTOM_ID: 0d568527-aeee-4be1-8f2e-af0546a767ce
:END:
*** Function
*describe-variable*
*** Documentation
Display the full documentation of VARIABLE (a symbol).
Returns the documentation as a string, also.
If VARIABLE has a buffer-local value in BUFFER or FRAME
(default to the current buffer and current frame),
it is displayed along with the global value.

(fn VARIABLE &optional BUFFER FRAME)
** SPC h w
:PROPERTIES:
:CUSTOM_ID: 008720ad-b460-43af-979f-de54809b32e9
:END:
*** Function
*where-is*
*** Documentation
Print message listing key sequences that invoke the command DEFINITION.
Argument is a command definition, usually a symbol with a function definition.
If INSERT (the prefix arg) is non-nil, insert the message in the buffer.

(fn DEFINITION &optional INSERT)
** SPC h <f1>
:PROPERTIES:
:CUSTOM_ID: 2477f569-77c8-487d-b97c-4c78e618095f
:END:
*** Function
*help-for-help*
*** Documentation
Help command.
** SPC h <help>
:PROPERTIES:
:CUSTOM_ID: 590fed02-1350-4d6e-b3d6-f2672df8e23b
:END:
*** Function
*help-for-help*
*** Documentation
Help command.
** SPC w C-b
:PROPERTIES:
:CUSTOM_ID: 5af6b7fa-695d-4f38-992d-38e0428063f2
:END:
*** Function
*evil-window-bottom-right*
*** Documentation
Move the cursor to bottom-right window.
** SPC w C-c
:PROPERTIES:
:CUSTOM_ID: 9846b162-0b1d-4ba1-a766-892e9e16f0a2
:END:
*** Function
*ace-delete-window*
*** Documentation
Ace delete window.
** SPC w C-f
:PROPERTIES:
:CUSTOM_ID: b4281713-c994-4f35-8d31-9fdebb2321cb
:END:
*** Function
*ffap-other-window*
