index.html
<div id="outline-container-org0052802" class="outline-3">
<h3 id="1f20349f-bc75-43d5-b03b-ff0fd9c7ee29">SPC h l</h3>
<div class="outline-text-3" id="text-1f20349f-bc75-43d5-b03b-ff0fd9c7ee29">
</div>
<div id="outline-container-org27c12c7" class="outline-4">
<h4 id="org27c12c7">Function</h4>
<div class="outline-text-4" id="text-org27c12c7">
<p>
<b>view-lossage</b>
</p>
</div>
</div>
<div id="outline-container-org5c934ff" class="outline-4">
<h4 id="org5c934ff">Documentation</h4>
<div class="outline-text-4" id="text-org5c934ff">
<p>
Display last few input keystrokes and the commands run.
For convenience this uses the same format as
edit-last-kbd-macro.
</p>

<p>
To record all your input, use open-dribble-file.
</p>
</div>
</div>
</div>
<div id="outline-container-org8eee8b2" class="outline-3">
<h3 id="2b2f0e9c-f808-4907-adad-8c54601ad61d">SPC h m</h3>
<div class="outline-text-3" id="text-2b2f0e9c-f808-4907-adad-8c54601ad61d">
</div>
<div id="outline-container-org886ec4d" class="outline-4">
<h4 id="org886ec4d">Function</h4>
<div class="outline-text-4" id="text-org886ec4d">
<p>
<b>describe-mode</b>
</p>
</div>
</div>
<div id="outline-container-org26abdb7" class="outline-4">
<h4 id="org26abdb7">Documentation</h4>
<div class="outline-text-4" id="text-org26abdb7">
<p>
Display documentation of current major mode and minor modes.
A brief summary of the minor modes comes first, followed by the
major mode description.  This is followed by detailed
descriptions of the minor modes, each on a separate page.
</p>

<p>
For this to work correctly for a minor mode, the modes indicator
variable (listed in minor-mode-alist) must also be a function
whose documentation describes the minor mode.
</p>

<p>
If called from Lisp with a non-nil BUFFER argument, display
documentation for the major and minor modes of that buffer.
</p>

<p>
(fn &amp;optional BUFFER)
</p>
</div>
</div>
</div>
<div id="outline-container-org066e614" class="outline-3">
<h3 id="04d9248e-407d-4bb5-86ce-82a3a0f9bfeb">SPC h n</h3>
<div class="outline-text-3" id="text-04d9248e-407d-4bb5-86ce-82a3a0f9bfeb">
</div>
<div id="outline-container-orge927339" class="outline-4">
<h4 id="orge927339">Function</h4>
<div class="outline-text-4" id="text-orge927339">
<p>
<b>doom/open-news</b>
</p>
</div>
</div>
<div id="outline-container-orgea48275" class="outline-4">
<h4 id="orgea48275">Documentation</h4>
<div class="outline-text-4" id="text-orgea48275">
<p>
TODO
</p>

<p>
(fn)
</p>
</div>
</div>
</div>
<div id="outline-container-org7af5d6a" class="outline-3">
<h3 id="dd3d9a7c-a09b-4f92-afd7-8f215799ccee">SPC h o</h3>
<div class="outline-text-3" id="text-dd3d9a7c-a09b-4f92-afd7-8f215799ccee">
</div>
<div id="outline-container-org2188695" class="outline-4">
<h4 id="org2188695">Function</h4>
<div class="outline-text-4" id="text-org2188695">
<p>
<b>describe-symbol</b>
</p>
</div>
</div>
<div id="outline-container-org4880c10" class="outline-4">
<h4 id="org4880c10">Documentation</h4>
<div class="outline-text-4" id="text-org4880c10">
<p>
Display the full documentation of SYMBOL.
Will show the info of SYMBOL as a function, variable, and/or face.
Optional arguments BUFFER and FRAME specify for which buffer and
frame to show the information about SYMBOL; they default to the
current buffer and the selected frame, respectively.
</p>

<p>
(fn SYMBOL &amp;optional BUFFER FRAME)
</p>
</div>
</div>
</div>
<div id="outline-container-org4259b0b" class="outline-3">
<h3 id="a8ec95ce-a969-44b4-9968-38e946b9aeef">SPC h p</h3>
<div class="outline-text-3" id="text-a8ec95ce-a969-44b4-9968-38e946b9aeef">
</div>
<div id="outline-container-org0400f7d" class="outline-4">
<h4 id="org0400f7d">Function</h4>
<div class="outline-text-4" id="text-org0400f7d">
<p>
<b>doom/describe-package</b>
</p>
</div>
</div>
<div id="outline-container-org253d773" class="outline-4">
<h4 id="org253d773">Documentation</h4>
<div class="outline-text-4" id="text-org253d773">
<p>
Like describe-packages, but is Doom aware.
</p>

<p>
Only shows installed packages. Includes information about where packages are
defined and configured.
</p>

<p>
If prefix arg is prsent, refresh the cache.
</p>

<p>
(fn PACKAGE)
</p>
</div>
</div>
</div>
<div id="outline-container-org930db81" class="outline-3">
<h3 id="411fe133-4f1f-47d5-8159-932c1da1a3b2">SPC h q</h3>
<div class="outline-text-3" id="text-411fe133-4f1f-47d5-8159-932c1da1a3b2">
</div>
<div id="outline-container-org4a10077" class="outline-4">
<h4 id="org4a10077">Function</h4>
<div class="outline-text-4" id="text-org4a10077">
<p>
<b>help-quit</b>
</p>
</div>
</div>
<div id="outline-container-org1e9f682" class="outline-4">
<h4 id="org1e9f682">Documentation</h4>
<div class="outline-text-4" id="text-org1e9f682">
<p>
Just exit from the Help commands command loop.
</p>
</div>
</div>
</div>
<div id="outline-container-org43f49dc" class="outline-3">
<h3 id="a5e5a1c1-ec70-43bb-b4ec-85ad07025432">SPC h s</h3>
<div class="outline-text-3" id="text-a5e5a1c1-ec70-43bb-b4ec-85ad07025432">
</div>
<div id="outline-container-org514239e" class="outline-4">
<h4 id="org514239e">Function</h4>
<div class="outline-text-4" id="text-org514239e">
<p>
<b>describe-syntax</b>
</p>
</div>
</div>
<div id="outline-container-orgaae7c98" class="outline-4">
<h4 id="orgaae7c98">Documentation</h4>
<div class="outline-text-4" id="text-orgaae7c98">
<p>
Describe the syntax specifications in the syntax table of BUFFER.
The descriptions are inserted in a help buffer, which is then displayed.
BUFFER defaults to the current buffer.
</p>

<p>
(fn &amp;optional BUFFER)
</p>
</div>
</div>
</div>
<div id="outline-container-org4011aa7" class="outline-3">
<h3 id="914642f8-4c80-49ab-8573-57b29753483d">SPC h t</h3>
<div class="outline-text-3" id="text-914642f8-4c80-49ab-8573-57b29753483d">
</div>
<div id="outline-container-orgacd1abf" class="outline-4">
<h4 id="orgacd1abf">Function</h4>
<div class="outline-text-4" id="text-orgacd1abf">
<p>
<b>help-with-tutorial</b>
</p>
</div>
</div>
<div id="outline-container-org78c3fb1" class="outline-4">
<h4 id="org78c3fb1">Documentation</h4>
<div class="outline-text-4" id="text-org78c3fb1">
<p>
Select the Emacs learn-by-doing tutorial.
If there is a tutorial version written in the language
of the selected language environment, that version is used.
If theres no tutorial in that language, TUTORIAL is selected.
With ARG, you are asked to choose which language.
If DONT-ASK-FOR-REVERT is non-nil the buffer is reverted without
any question when restarting the tutorial.
</p>

<p>
If any of the standard Emacs key bindings that are used in the
tutorial have been changed then an explanatory note about this is
shown in the beginning of the tutorial buffer.
</p>

<p>
When the tutorial buffer is killed the content and the point
position in the buffer is saved so that the tutorial may be
resumed later.
</p>

<p>
(fn &amp;optional ARG DONT-ASK-FOR-REVERT)
</p>
</div>
</div>
</div>
<div id="outline-container-orgaf63e94" class="outline-3">
<h3 id="0d568527-aeee-4be1-8f2e-af0546a767ce">SPC h v</h3>
<div class="outline-text-3" id="text-0d568527-aeee-4be1-8f2e-af0546a767ce">
</div>
<div id="outline-container-org7da089b" class="outline-4">
<h4 id="org7da089b">Function</h4>
<div class="outline-text-4" id="text-org7da089b">
<p>
<b>describe-variable</b>
</p>
</div>
</div>
<div id="outline-container-org7b7db58" class="outline-4">
<h4 id="org7b7db58">Documentation</h4>
<div class="outline-text-4" id="text-org7b7db58">
<p>
Display the full documentation of VARIABLE (a symbol).
Returns the documentation as a string, also.
If VARIABLE has a buffer-local value in BUFFER or FRAME
(default to the current buffer and current frame),
it is displayed along with the global value.
</p>

<p>
(fn VARIABLE &amp;optional BUFFER FRAME)
</p>
</div>
</div>
</div>
<div id="outline-container-org30c4710" class="outline-3">
<h3 id="008720ad-b460-43af-979f-de54809b32e9">SPC h w</h3>
<div class="outline-text-3" id="text-008720ad-b460-43af-979f-de54809b32e9">
</div>
<div id="outline-container-orgacbf42a" class="outline-4">
<h4 id="orgacbf42a">Function</h4>
<div class="outline-text-4" id="text-orgacbf42a">
<p>
<b>where-is</b>
</p>
</div>
</div>
<div id="outline-container-orgf617be4" class="outline-4">
<h4 id="orgf617be4">Documentation</h4>
<div class="outline-text-4" id="text-orgf617be4">
<p>
Print message listing key sequences that invoke the command DEFINITION.
Argument is a command definition, usually a symbol with a function definition.
If INSERT (the prefix arg) is non-nil, insert the message in the buffer.
</p>

<p>
(fn DEFINITION &amp;optional INSERT)
</p>
</div>
</div>
</div>
