index.org
*** Documentation
Like ‘ffap’, but put buffer in another window.
Only intended for interactive use.
** SPC w C-h
:PROPERTIES:
:CUSTOM_ID: 5bddd09b-cbc1-4286-bc39-520eadb9ee34
:END:
*** Function
*evil-window-left*
*** Documentation
Move the cursor to new COUNT-th window left of the current one.
** SPC w C-j
:PROPERTIES:
:CUSTOM_ID: 23d27428-7864-49b4-be79-9aa8de38a6ea
:END:
*** Function
*evil-window-down*
*** Documentation
Move the cursor to new COUNT-th window below the current one.
** SPC w C-k
:PROPERTIES:
:CUSTOM_ID: 91a3a7dd-dbbc-4aad-9bfc-99990d23a23e
:END:
*** Function
*evil-window-up*
*** Documentation
Move the cursor to new COUNT-th window above the current one.
** SPC w C-l
:PROPERTIES:
:CUSTOM_ID: fde5e873-8b63-4dc2-a1c4-741cd4896f2f
:END:
*** Function
*evil-window-right*
*** Documentation
Move the cursor to new COUNT-th window right of the current one.
** SPC w C-n
:PROPERTIES:
:CUSTOM_ID: 4b75e306-cdbf-492f-8270-e6c78be29527
:END:
*** Function
*evil-window-new*
*** Documentation
Splits the current window horizontally
and opens a new buffer or edits a certain FILE.
** SPC w C-o
:PROPERTIES:
:CUSTOM_ID: 45307f29-ec24-461e-8637-a38ca19e2bbc
:END:
*** Function
*delete-other-windows*
*** Documentation
Make WINDOW fill its frame.
WINDOW must be a valid window and defaults to the selected one.
Return nil.

If the variable ‘ignore-window-parameters’ is non-nil or the
‘delete-other-windows’ parameter of WINDOW equals t, do not pay
attention to any other parameters of WINDOW.  Otherwise, if the
‘delete-other-windows’ parameter of WINDOW specifies a function,
call that function with WINDOW as its sole argument and return
the value returned by that function.

Else, if WINDOW is part of an atomic window, call this function
with the root of the atomic window as its argument.  Signal an
error if that root window is the root window of WINDOW’s frame.
Also signal an error if WINDOW is a side window.  Do not delete
any window whose ‘no-delete-other-windows’ parameter is non-nil.

(fn &optional WINDOW)
** SPC w C-p
:PROPERTIES:
:CUSTOM_ID: e64d75a3-1342-4fa9-8789-a683ae3452ce
:END:
*** Function
*evil-window-mru*
*** Documentation
Move the cursor to the previous (last accessed) buffer in another window.
More precisely, it selects the most recently used buffer that is
shown in some other window, preferably of the current frame, and
is different from the current one.
** SPC w C-r
:PROPERTIES:
:CUSTOM_ID: c0a158ff-345a-452c-965a-e2eb728aa2a4
:END:
*** Function
*winner-redo*
*** Documentation
Restore a more recent window configuration saved by Winner mode.
** SPC w C-s
:PROPERTIES:
:CUSTOM_ID: 9a602505-f297-41ca-9db2-c4b43902af67
:END:
*** Function
*evil-window-split*
*** Documentation
:override advice: ‘+evil*window-split’

Splits the current window horizontally, COUNT lines height,
editing a certain FILE. The new window will be created below
when ‘evil-split-window-below’ is non-nil. If COUNT and
‘evil-auto-balance-windows’ are both non-nil then all children
of the parent of the splitted window are rebalanced.

(fn &optional COUNT FILE)
** SPC w C-t
:PROPERTIES:
:CUSTOM_ID: 0ac38de5-362f-44c9-bab0-2fc353f3a1d1
:END:
*** Function
*evil-window-top-left*
*** Documentation
Move the cursor to top-left window.
** SPC w C-u
:PROPERTIES:
:CUSTOM_ID: bdda68e8-251c-4cc2-a6fd-2d18b11cfadc
:END:
*** Function
*winner-undo*
*** Documentation
Switch back to an earlier window configuration saved by Winner mode.
In other words, "undo" changes in window configuration.
** SPC w C-v
:PROPERTIES:
:CUSTOM_ID: b87a0553-ef86-4ae0-9b32-7a4049350672
:END:
*** Function
*evil-window-vsplit*
*** Documentation
:override advice: ‘+evil*window-vsplit’

Splits the current window vertically, COUNT columns width,
editing a certain FILE. The new window will be created to the
right when ‘evil-vsplit-window-right’ is non-nil. If COUNT and
‘evil-auto-balance-windows’are both non-nil then all children
of the parent of the splitted window are rebalanced.

(fn &optional COUNT FILE)
** SPC w C-w
:PROPERTIES:
:CUSTOM_ID: 4b1e0a50-27aa-48f0-97b6-0db3f8f49d84
:END:
*** Function
*other-window*
