index.html
<div id="outline-container-org80d1cc9" class="outline-3">
<h3 id="2477f569-77c8-487d-b97c-4c78e618095f">SPC h &lt;f1&gt;</h3>
<div class="outline-text-3" id="text-2477f569-77c8-487d-b97c-4c78e618095f">
</div>
<div id="outline-container-org8434643" class="outline-4">
<h4 id="org8434643">Function</h4>
<div class="outline-text-4" id="text-org8434643">
<p>
<b>help-for-help</b>
</p>
</div>
</div>
<div id="outline-container-org99652f6" class="outline-4">
<h4 id="org99652f6">Documentation</h4>
<div class="outline-text-4" id="text-org99652f6">
<p>
Help command.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1f3808" class="outline-3">
<h3 id="590fed02-1350-4d6e-b3d6-f2672df8e23b">SPC h &lt;help&gt;</h3>
<div class="outline-text-3" id="text-590fed02-1350-4d6e-b3d6-f2672df8e23b">
</div>
<div id="outline-container-orgbb31bcd" class="outline-4">
<h4 id="orgbb31bcd">Function</h4>
<div class="outline-text-4" id="text-orgbb31bcd">
<p>
<b>help-for-help</b>
</p>
</div>
</div>
<div id="outline-container-org434f46c" class="outline-4">
<h4 id="org434f46c">Documentation</h4>
<div class="outline-text-4" id="text-org434f46c">
<p>
Help command.
</p>
</div>
</div>
</div>
<div id="outline-container-org706aa94" class="outline-3">
<h3 id="5af6b7fa-695d-4f38-992d-38e0428063f2">SPC w C-b</h3>
<div class="outline-text-3" id="text-5af6b7fa-695d-4f38-992d-38e0428063f2">
</div>
<div id="outline-container-org14ba8e6" class="outline-4">
<h4 id="org14ba8e6">Function</h4>
<div class="outline-text-4" id="text-org14ba8e6">
<p>
<b>evil-window-bottom-right</b>
</p>
</div>
</div>
<div id="outline-container-org2d86d9f" class="outline-4">
<h4 id="org2d86d9f">Documentation</h4>
<div class="outline-text-4" id="text-org2d86d9f">
<p>
Move the cursor to bottom-right window.
</p>
</div>
</div>
</div>
<div id="outline-container-org0228a8d" class="outline-3">
<h3 id="9846b162-0b1d-4ba1-a766-892e9e16f0a2">SPC w C-c</h3>
<div class="outline-text-3" id="text-9846b162-0b1d-4ba1-a766-892e9e16f0a2">
</div>
<div id="outline-container-org635e870" class="outline-4">
<h4 id="org635e870">Function</h4>
<div class="outline-text-4" id="text-org635e870">
<p>
<b>ace-delete-window</b>
</p>
</div>
</div>
<div id="outline-container-org9b30da5" class="outline-4">
<h4 id="org9b30da5">Documentation</h4>
<div class="outline-text-4" id="text-org9b30da5">
<p>
Ace delete window.
</p>
</div>
</div>
</div>
<div id="outline-container-org1c0f5c6" class="outline-3">
<h3 id="b4281713-c994-4f35-8d31-9fdebb2321cb">SPC w C-f</h3>
<div class="outline-text-3" id="text-b4281713-c994-4f35-8d31-9fdebb2321cb">
</div>
<div id="outline-container-orgc612bc6" class="outline-4">
<h4 id="orgc612bc6">Function</h4>
<div class="outline-text-4" id="text-orgc612bc6">
<p>
<b>ffap-other-window</b>
</p>
</div>
</div>
<div id="outline-container-orgd6d3f01" class="outline-4">
<h4 id="orgd6d3f01">Documentation</h4>
<div class="outline-text-4" id="text-orgd6d3f01">
<p>
Like ffap, but put buffer in another window.
Only intended for interactive use.
</p>
</div>
</div>
</div>
<div id="outline-container-org2f67d4b" class="outline-3">
<h3 id="5bddd09b-cbc1-4286-bc39-520eadb9ee34">SPC w C-h</h3>
<div class="outline-text-3" id="text-5bddd09b-cbc1-4286-bc39-520eadb9ee34">
</div>
<div id="outline-container-orga0f269f" class="outline-4">
<h4 id="orga0f269f">Function</h4>
<div class="outline-text-4" id="text-orga0f269f">
<p>
<b>evil-window-left</b>
</p>
</div>
</div>
<div id="outline-container-orgeaf8d55" class="outline-4">
<h4 id="orgeaf8d55">Documentation</h4>
<div class="outline-text-4" id="text-orgeaf8d55">
<p>
Move the cursor to new COUNT-th window left of the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf3e224b" class="outline-3">
<h3 id="23d27428-7864-49b4-be79-9aa8de38a6ea">SPC w C-j</h3>
<div class="outline-text-3" id="text-23d27428-7864-49b4-be79-9aa8de38a6ea">
</div>
<div id="outline-container-org23a8d6b" class="outline-4">
<h4 id="org23a8d6b">Function</h4>
<div class="outline-text-4" id="text-org23a8d6b">
<p>
<b>evil-window-down</b>
</p>
</div>
</div>
<div id="outline-container-org9a1f6f7" class="outline-4">
<h4 id="org9a1f6f7">Documentation</h4>
<div class="outline-text-4" id="text-org9a1f6f7">
<p>
Move the cursor to new COUNT-th window below the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-org563a450" class="outline-3">
<h3 id="91a3a7dd-dbbc-4aad-9bfc-99990d23a23e">SPC w C-k</h3>
<div class="outline-text-3" id="text-91a3a7dd-dbbc-4aad-9bfc-99990d23a23e">
</div>
<div id="outline-container-org21af463" class="outline-4">
<h4 id="org21af463">Function</h4>
<div class="outline-text-4" id="text-org21af463">
<p>
<b>evil-window-up</b>
</p>
</div>
</div>
<div id="outline-container-org933cb9e" class="outline-4">
<h4 id="org933cb9e">Documentation</h4>
<div class="outline-text-4" id="text-org933cb9e">
<p>
Move the cursor to new COUNT-th window above the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcbe4318" class="outline-3">
<h3 id="fde5e873-8b63-4dc2-a1c4-741cd4896f2f">SPC w C-l</h3>
<div class="outline-text-3" id="text-fde5e873-8b63-4dc2-a1c4-741cd4896f2f">
</div>
<div id="outline-container-orgfbf336b" class="outline-4">
<h4 id="orgfbf336b">Function</h4>
<div class="outline-text-4" id="text-orgfbf336b">
<p>
<b>evil-window-right</b>
</p>
</div>
</div>
<div id="outline-container-org499bf6e" class="outline-4">
<h4 id="org499bf6e">Documentation</h4>
<div class="outline-text-4" id="text-org499bf6e">
<p>
Move the cursor to new COUNT-th window right of the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-org988df70" class="outline-3">
<h3 id="4b75e306-cdbf-492f-8270-e6c78be29527">SPC w C-n</h3>
<div class="outline-text-3" id="text-4b75e306-cdbf-492f-8270-e6c78be29527">
</div>
<div id="outline-container-orgdbdef2f" class="outline-4">
<h4 id="orgdbdef2f">Function</h4>
<div class="outline-text-4" id="text-orgdbdef2f">
<p>
<b>evil-window-new</b>
</p>
</div>
</div>
<div id="outline-container-org6b7dc67" class="outline-4">
<h4 id="org6b7dc67">Documentation</h4>
<div class="outline-text-4" id="text-org6b7dc67">
<p>
Splits the current window horizontally
and opens a new buffer or edits a certain FILE.
</p>
</div>
</div>
</div>
<div id="outline-container-org510d488" class="outline-3">
<h3 id="45307f29-ec24-461e-8637-a38ca19e2bbc">SPC w C-o</h3>
<div class="outline-text-3" id="text-45307f29-ec24-461e-8637-a38ca19e2bbc">
</div>
<div id="outline-container-org109f05d" class="outline-4">
<h4 id="org109f05d">Function</h4>
<div class="outline-text-4" id="text-org109f05d">
<p>
<b>delete-other-windows</b>
</p>
</div>
</div>
<div id="outline-container-org252ab76" class="outline-4">
<h4 id="org252ab76">Documentation</h4>
<div class="outline-text-4" id="text-org252ab76">
<p>
Make WINDOW fill its frame.
WINDOW must be a valid window and defaults to the selected one.
Return nil.
</p>

<p>
If the variable ignore-window-parameters is non-nil or the
delete-other-windows parameter of WINDOW equals t, do not pay
attention to any other parameters of WINDOW.  Otherwise, if the
delete-other-windows parameter of WINDOW specifies a function,
call that function with WINDOW as its sole argument and return
the value returned by that function.
</p>

<p>
Else, if WINDOW is part of an atomic window, call this function
with the root of the atomic window as its argument.  Signal an
error if that root window is the root window of WINDOWs frame.
Also signal an error if WINDOW is a side window.  Do not delete
any window whose no-delete-other-windows parameter is non-nil.
</p>

<p>
(fn &amp;optional WINDOW)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd170fa1" class="outline-3">
<h3 id="e64d75a3-1342-4fa9-8789-a683ae3452ce">SPC w C-p</h3>
<div class="outline-text-3" id="text-e64d75a3-1342-4fa9-8789-a683ae3452ce">
</div>
<div id="outline-container-org6f5be03" class="outline-4">
<h4 id="org6f5be03">Function</h4>
<div class="outline-text-4" id="text-org6f5be03">
<p>
<b>evil-window-mru</b>
</p>
</div>
</div>
<div id="outline-container-org1f23d72" class="outline-4">
<h4 id="org1f23d72">Documentation</h4>
<div class="outline-text-4" id="text-org1f23d72">
<p>
Move the cursor to the previous (last accessed) buffer in another window.
More precisely, it selects the most recently used buffer that is
shown in some other window, preferably of the current frame, and
is different from the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-org6fa6dd5" class="outline-3">
<h3 id="c0a158ff-345a-452c-965a-e2eb728aa2a4">SPC w C-r</h3>
<div class="outline-text-3" id="text-c0a158ff-345a-452c-965a-e2eb728aa2a4">
</div>
<div id="outline-container-org1681a6f" class="outline-4">
<h4 id="org1681a6f">Function</h4>
<div class="outline-text-4" id="text-org1681a6f">
<p>
<b>winner-redo</b>
</p>
</div>
</div>
<div id="outline-container-org8d34e6b" class="outline-4">
<h4 id="org8d34e6b">Documentation</h4>
<div class="outline-text-4" id="text-org8d34e6b">
<p>
Restore a more recent window configuration saved by Winner mode.
</p>
</div>
</div>
</div>
