index.org
** SPC w W
:PROPERTIES:
:CUSTOM_ID: 9d2962d2-055d-4031-9258-3d24f3c28154
:END:
*** Function
*evil-window-prev*
*** Documentation
Move the cursor to the previous window in the cyclic order.
With COUNT go to the count-th window in the order starting from
top-left.
** SPC w _
:PROPERTIES:
:CUSTOM_ID: 3b93c8cf-1d66-4c47-9309-6482f34d884f
:END:
*** Function
*evil-window-set-height*
*** Documentation
Sets the height of the current window to COUNT.
** SPC w b
:PROPERTIES:
:CUSTOM_ID: b3d4402a-1b58-4f12-884e-726a4f34e8d7
:END:
*** Function
*evil-window-bottom-right*
*** Documentation
Move the cursor to bottom-right window.
** SPC w c
:PROPERTIES:
:CUSTOM_ID: 537bc383-a1b3-4bc9-b370-c171846c1e8e
:END:
*** Function
*+workspace/close-window-or-workspace*
*** Documentation
Close the selected window. If it’s the last window in the workspace, either
close the workspace (as well as its associated frame, if one exists) and move to
the next.
** SPC w h
:PROPERTIES:
:CUSTOM_ID: 9f8d7465-2730-46bc-aecc-e66ce3f54ba6
:END:
*** Function
*evil-window-left*
*** Documentation
Move the cursor to new COUNT-th window left of the current one.
** SPC w j
:PROPERTIES:
:CUSTOM_ID: 8942711b-463d-44f0-ae1d-25e6e3c4b552
:END:
*** Function
*evil-window-down*
*** Documentation
Move the cursor to new COUNT-th window below the current one.
** SPC w k
:PROPERTIES:
:CUSTOM_ID: 36d4d244-9c84-4a03-b77a-c5573183be5b
:END:
*** Function
*evil-window-up*
*** Documentation
Move the cursor to new COUNT-th window above the current one.
** SPC w l
:PROPERTIES:
:CUSTOM_ID: 87ea4869-4cca-4d1e-b776-68cbafebf11d
:END:
*** Function
*evil-window-right*
*** Documentation
Move the cursor to new COUNT-th window right of the current one.
** SPC w n
:PROPERTIES:
:CUSTOM_ID: 798368f5-b3b5-40f2-8532-428e83cc328b
:END:
*** Function
*evil-window-new*
*** Documentation
Splits the current window horizontally
and opens a new buffer or edits a certain FILE.
** SPC w o
:PROPERTIES:
:CUSTOM_ID: c3ee1228-7bd5-4caf-b9fb-536b557aeeae
:END:
*** Function
*doom/window-enlargen*
*** Documentation
Enlargen the current window to focus on this one. Does not close other
windows (unlike ‘doom/window-zoom’) Activate again to undo.
** SPC w p
:PROPERTIES:
:CUSTOM_ID: ad87cc70-aace-435e-891d-bf1741aec654
:END:
*** Function
*evil-window-mru*
*** Documentation
Move the cursor to the previous (last accessed) buffer in another window.
More precisely, it selects the most recently used buffer that is
shown in some other window, preferably of the current frame, and
is different from the current one.
** SPC w q
:PROPERTIES:
:CUSTOM_ID: fe3377ad-1cc2-4369-88aa-81cfc01adfe7
:END:
*** Function
*evil-quit*
*** Documentation
Closes the current window, current frame, Emacs.
If the current frame belongs to some client the client connection
is closed.
** SPC w r
:PROPERTIES:
:CUSTOM_ID: 46e648bd-ba31-4706-81ad-45f76e385e98
:END:
*** Function
*evil-window-rotate-downwards*
*** Documentation
Rotates the windows according to the currenty cyclic ordering.
** SPC w s
:PROPERTIES:
:CUSTOM_ID: 77f8324e-8b68-49b5-af98-ffca2d83f80c
:END:
*** Function
*evil-window-split*
*** Documentation
:override advice: ‘+evil*window-split’

Splits the current window horizontally, COUNT lines height,
editing a certain FILE. The new window will be created below
when ‘evil-split-window-below’ is non-nil. If COUNT and
‘evil-auto-balance-windows’ are both non-nil then all children
of the parent of the splitted window are rebalanced.

(fn &optional COUNT FILE)
** SPC w t
:PROPERTIES:
:CUSTOM_ID: 1642cbef-e2b0-44e1-a4f5-d908b5768698
:END:
*** Function
*evil-window-top-left*
*** Documentation
Move the cursor to top-left window.
** SPC w u
:PROPERTIES:
:CUSTOM_ID: be04a0ed-bed5-4198-9eb9-a2b4986ea012
:END:
*** Function
*winner-undo*
*** Documentation
Switch back to an earlier window configuration saved by Winner mode.
In other words, "undo" changes in window configuration.
** SPC w v
:PROPERTIES:
:CUSTOM_ID: fe3b666d-1baa-4e7e-a578-503c303b16d9
:END:
*** Function
*evil-window-vsplit*
*** Documentation
:override advice: ‘+evil*window-vsplit’

Splits the current window vertically, COUNT columns width,
editing a certain FILE. The new window will be created to the
right when ‘evil-vsplit-window-right’ is non-nil. If COUNT and
‘evil-auto-balance-windows’are both non-nil then all children
of the parent of the splitted window are rebalanced.

(fn &optional COUNT FILE)
** SPC w w
:PROPERTIES:
:CUSTOM_ID: eee43689-5cfe-4e1c-b701-6135193b35f5
:END:
*** Function
*evil-window-next*
*** Documentation
Move the cursor to the next window in the cyclic order.
With COUNT go to the count-th window in the order starting from
top-left.
** SPC w |
:PROPERTIES:
:CUSTOM_ID: 10cf43ab-675d-4722-8ce3-3486a50885a3
:END:
*** Function
*evil-window-set-width*
