index.html
<div id="outline-container-org50fe413" class="outline-3">
<h3 id="480fadd5-d18a-4558-ae87-ad7cffe9e98f">SPC w R</h3>
<div class="outline-text-3" id="text-480fadd5-d18a-4558-ae87-ad7cffe9e98f">
</div>
<div id="outline-container-org09e7b05" class="outline-4">
<h4 id="org09e7b05">Function</h4>
<div class="outline-text-4" id="text-org09e7b05">
<p>
<b>evil-window-rotate-upwards</b>
</p>
</div>
</div>
<div id="outline-container-org23f0551" class="outline-4">
<h4 id="org23f0551">Documentation</h4>
<div class="outline-text-4" id="text-org23f0551">
<p>
Rotates the windows according to the currenty cyclic ordering.
</p>
</div>
</div>
</div>
<div id="outline-container-org57adf5d" class="outline-3">
<h3 id="f212ee90-3ec2-4b26-87ca-73ee05d5962a">SPC w S</h3>
<div class="outline-text-3" id="text-f212ee90-3ec2-4b26-87ca-73ee05d5962a">
</div>
<div id="outline-container-orgb147fc9" class="outline-4">
<h4 id="orgb147fc9">Function</h4>
<div class="outline-text-4" id="text-orgb147fc9">
<p>
<b>evil-window-split</b>
</p>
</div>
</div>
<div id="outline-container-org2eafab6" class="outline-4">
<h4 id="org2eafab6">Documentation</h4>
<div class="outline-text-4" id="text-org2eafab6">
<p>
:override advice: +evil*window-split
</p>

<p>
Splits the current window horizontally, COUNT lines height,
editing a certain FILE. The new window will be created below
when evil-split-window-below is non-nil. If COUNT and
evil-auto-balance-windows are both non-nil then all children
of the parent of the splitted window are rebalanced.
</p>

<p>
(fn &amp;optional COUNT FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-orgb68c675" class="outline-3">
<h3 id="9d2962d2-055d-4031-9258-3d24f3c28154">SPC w W</h3>
<div class="outline-text-3" id="text-9d2962d2-055d-4031-9258-3d24f3c28154">
</div>
<div id="outline-container-orge9404fa" class="outline-4">
<h4 id="orge9404fa">Function</h4>
<div class="outline-text-4" id="text-orge9404fa">
<p>
<b>evil-window-prev</b>
</p>
</div>
</div>
<div id="outline-container-orgd7fe287" class="outline-4">
<h4 id="orgd7fe287">Documentation</h4>
<div class="outline-text-4" id="text-orgd7fe287">
<p>
Move the cursor to the previous window in the cyclic order.
With COUNT go to the count-th window in the order starting from
top-left.
</p>
</div>
</div>
</div>
<div id="outline-container-org21e8c71" class="outline-3">
<h3 id="3b93c8cf-1d66-4c47-9309-6482f34d884f">SPC w _</h3>
<div class="outline-text-3" id="text-3b93c8cf-1d66-4c47-9309-6482f34d884f">
</div>
<div id="outline-container-org6185451" class="outline-4">
<h4 id="org6185451">Function</h4>
<div class="outline-text-4" id="text-org6185451">
<p>
<b>evil-window-set-height</b>
</p>
</div>
</div>
<div id="outline-container-org7c680d8" class="outline-4">
<h4 id="org7c680d8">Documentation</h4>
<div class="outline-text-4" id="text-org7c680d8">
<p>
Sets the height of the current window to COUNT.
</p>
</div>
</div>
</div>
<div id="outline-container-org9779900" class="outline-3">
<h3 id="b3d4402a-1b58-4f12-884e-726a4f34e8d7">SPC w b</h3>
<div class="outline-text-3" id="text-b3d4402a-1b58-4f12-884e-726a4f34e8d7">
</div>
<div id="outline-container-org1a1aa42" class="outline-4">
<h4 id="org1a1aa42">Function</h4>
<div class="outline-text-4" id="text-org1a1aa42">
<p>
<b>evil-window-bottom-right</b>
</p>
</div>
</div>
<div id="outline-container-org45a87d1" class="outline-4">
<h4 id="org45a87d1">Documentation</h4>
<div class="outline-text-4" id="text-org45a87d1">
<p>
Move the cursor to bottom-right window.
</p>
</div>
</div>
</div>
<div id="outline-container-org57665a5" class="outline-3">
<h3 id="537bc383-a1b3-4bc9-b370-c171846c1e8e">SPC w c</h3>
<div class="outline-text-3" id="text-537bc383-a1b3-4bc9-b370-c171846c1e8e">
</div>
<div id="outline-container-org2c5f7c2" class="outline-4">
<h4 id="org2c5f7c2">Function</h4>
<div class="outline-text-4" id="text-org2c5f7c2">
<p>
<b>+workspace/close-window-or-workspace</b>
</p>
</div>
</div>
<div id="outline-container-orgcfe315c" class="outline-4">
<h4 id="orgcfe315c">Documentation</h4>
<div class="outline-text-4" id="text-orgcfe315c">
<p>
Close the selected window. If its the last window in the workspace, either
close the workspace (as well as its associated frame, if one exists) and move to
the next.
</p>
</div>
</div>
</div>
<div id="outline-container-org2448fda" class="outline-3">
<h3 id="9f8d7465-2730-46bc-aecc-e66ce3f54ba6">SPC w h</h3>
<div class="outline-text-3" id="text-9f8d7465-2730-46bc-aecc-e66ce3f54ba6">
</div>
<div id="outline-container-orga3de7fc" class="outline-4">
<h4 id="orga3de7fc">Function</h4>
<div class="outline-text-4" id="text-orga3de7fc">
<p>
<b>evil-window-left</b>
</p>
</div>
</div>
<div id="outline-container-orgbe1490c" class="outline-4">
<h4 id="orgbe1490c">Documentation</h4>
<div class="outline-text-4" id="text-orgbe1490c">
<p>
Move the cursor to new COUNT-th window left of the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb8e7199" class="outline-3">
<h3 id="8942711b-463d-44f0-ae1d-25e6e3c4b552">SPC w j</h3>
<div class="outline-text-3" id="text-8942711b-463d-44f0-ae1d-25e6e3c4b552">
</div>
<div id="outline-container-orgab74fb9" class="outline-4">
<h4 id="orgab74fb9">Function</h4>
<div class="outline-text-4" id="text-orgab74fb9">
<p>
<b>evil-window-down</b>
</p>
</div>
</div>
<div id="outline-container-orgad3aa14" class="outline-4">
<h4 id="orgad3aa14">Documentation</h4>
<div class="outline-text-4" id="text-orgad3aa14">
<p>
Move the cursor to new COUNT-th window below the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-orge048f39" class="outline-3">
<h3 id="36d4d244-9c84-4a03-b77a-c5573183be5b">SPC w k</h3>
<div class="outline-text-3" id="text-36d4d244-9c84-4a03-b77a-c5573183be5b">
</div>
<div id="outline-container-orgb40bb64" class="outline-4">
<h4 id="orgb40bb64">Function</h4>
<div class="outline-text-4" id="text-orgb40bb64">
<p>
<b>evil-window-up</b>
</p>
</div>
</div>
<div id="outline-container-orgd44a672" class="outline-4">
<h4 id="orgd44a672">Documentation</h4>
<div class="outline-text-4" id="text-orgd44a672">
<p>
Move the cursor to new COUNT-th window above the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-org17a0537" class="outline-3">
<h3 id="87ea4869-4cca-4d1e-b776-68cbafebf11d">SPC w l</h3>
<div class="outline-text-3" id="text-87ea4869-4cca-4d1e-b776-68cbafebf11d">
</div>
<div id="outline-container-orge3c2df2" class="outline-4">
<h4 id="orge3c2df2">Function</h4>
<div class="outline-text-4" id="text-orge3c2df2">
<p>
<b>evil-window-right</b>
</p>
</div>
</div>
<div id="outline-container-orgd7e5417" class="outline-4">
<h4 id="orgd7e5417">Documentation</h4>
<div class="outline-text-4" id="text-orgd7e5417">
<p>
Move the cursor to new COUNT-th window right of the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-org2a8e53f" class="outline-3">
<h3 id="798368f5-b3b5-40f2-8532-428e83cc328b">SPC w n</h3>
<div class="outline-text-3" id="text-798368f5-b3b5-40f2-8532-428e83cc328b">
</div>
<div id="outline-container-orgf7e4665" class="outline-4">
<h4 id="orgf7e4665">Function</h4>
<div class="outline-text-4" id="text-orgf7e4665">
<p>
<b>evil-window-new</b>
</p>
</div>
</div>
<div id="outline-container-org9d16b14" class="outline-4">
<h4 id="org9d16b14">Documentation</h4>
<div class="outline-text-4" id="text-org9d16b14">
<p>
Splits the current window horizontally
and opens a new buffer or edits a certain FILE.
</p>
</div>
</div>
</div>
<div id="outline-container-org40c107d" class="outline-3">
<h3 id="c3ee1228-7bd5-4caf-b9fb-536b557aeeae">SPC w o</h3>
<div class="outline-text-3" id="text-c3ee1228-7bd5-4caf-b9fb-536b557aeeae">
</div>
<div id="outline-container-org2cddc33" class="outline-4">
<h4 id="org2cddc33">Function</h4>
<div class="outline-text-4" id="text-org2cddc33">
<p>
<b>doom/window-enlargen</b>
</p>
</div>
</div>
<div id="outline-container-orgab7de2f" class="outline-4">
<h4 id="orgab7de2f">Documentation</h4>
<div class="outline-text-4" id="text-orgab7de2f">
<p>
Enlargen the current window to focus on this one. Does not close other
windows (unlike doom/window-zoom) Activate again to undo.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc050d29" class="outline-3">
<h3 id="ad87cc70-aace-435e-891d-bf1741aec654">SPC w p</h3>
<div class="outline-text-3" id="text-ad87cc70-aace-435e-891d-bf1741aec654">
</div>
<div id="outline-container-org53b8176" class="outline-4">
<h4 id="org53b8176">Function</h4>
<div class="outline-text-4" id="text-org53b8176">
<p>
<b>evil-window-mru</b>
</p>
</div>
</div>
<div id="outline-container-orgb6ae75e" class="outline-4">
<h4 id="orgb6ae75e">Documentation</h4>
<div class="outline-text-4" id="text-orgb6ae75e">
<p>
Move the cursor to the previous (last accessed) buffer in another window.
More precisely, it selects the most recently used buffer that is
shown in some other window, preferably of the current frame, and
is different from the current one.
</p>
</div>
</div>
</div>
<div id="outline-container-org0c259f9" class="outline-3">
<h3 id="fe3377ad-1cc2-4369-88aa-81cfc01adfe7">SPC w q</h3>
<div class="outline-text-3" id="text-fe3377ad-1cc2-4369-88aa-81cfc01adfe7">
</div>
<div id="outline-container-orgc7f1a86" class="outline-4">
<h4 id="orgc7f1a86">Function</h4>
<div class="outline-text-4" id="text-orgc7f1a86">
<p>
<b>evil-quit</b>
</p>
</div>
</div>
<div id="outline-container-org09d3bab" class="outline-4">
<h4 id="org09d3bab">Documentation</h4>
<div class="outline-text-4" id="text-org09d3bab">
<p>
Closes the current window, current frame, Emacs.
If the current frame belongs to some client the client connection
is closed.
</p>
</div>
</div>
</div>
