index.org
*** Documentation
Visit the revision at point in another buffer.
If there is no revision at point or with a prefix argument prompt
for a revision.

(fn REV &optional ARGS FILES MODULE)
** SPC g f f
:PROPERTIES:
:CUSTOM_ID: 86f5d314-2e50-4f2e-8500-c78b780fc00e
:END:
*** Function
*magit-find-file*
*** Documentation
View FILE from REV.
Switch to a buffer visiting blob REV:FILE,
creating one if none already exists.

(fn REV FILE)
** SPC g f g
:PROPERTIES:
:CUSTOM_ID: 077c5d67-8fa3-48fc-a08b-744b8c2beb0e
:END:
*** Function
*magit-find-git-config-file*
*** Documentation
Edit a file located in the current repository’s git directory.

When ".git", located at the root of the working tree, is a
regular file, then that makes it cumbersome to open a file
located in the actual git directory.

This command is like ‘find-file’, except that it temporarily
binds ‘default-directory’ to the actual git directory, while
reading the FILENAME.

(fn FILENAME &optional WILDCARDS)
** SPC g f i
:PROPERTIES:
:CUSTOM_ID: 5958338c-bf28-46bc-b0c0-b137fc9d5082
:END:
*** Function
*forge-visit-issue*
*** Documentation
View the issue at point in a separate buffer.

(fn ISSUE)
** SPC g f p
:PROPERTIES:
:CUSTOM_ID: d32a6b0c-f2f5-468b-b26d-88a717f753c9
:END:
*** Function
*forge-visit-pullreq*
*** Documentation
View the pull-request at point in a separate buffer.

(fn PULLREQ)
** SPC h r P
:PROPERTIES:
:CUSTOM_ID: 2201b894-1e0e-4dd4-987e-4e65685d6749
:END:
*** Function
*doom/reload-project*
*** Documentation
Reload the project root cache.
** SPC h r f
:PROPERTIES:
:CUSTOM_ID: 21d92b57-2205-4dbb-886a-f3336695a92b
:END:
*** Function
*doom/reload-font*
*** Documentation
Reload ‘doom-font’, ‘doom-variable-pitch-font’, and ‘doom-unicode-font’, if
set.
** SPC h r p
:PROPERTIES:
:CUSTOM_ID: 94759093-d634-4121-8011-53a323c3d8e6
:END:
*** Function
*doom/reload-packages*
*** Documentation
Reload ‘doom-packages’, ‘package’ and ‘quelpa’.
** SPC h r r
:PROPERTIES:
:CUSTOM_ID: eccc3764-d1ea-4c9f-8948-a5e69b287d66
:END:
*** Function
*doom/reload*
*** Documentation
Reloads your config. This is experimental!

If called from a noninteractive session, this will try to communicate with a
live server (if one is found) to tell it to run this function.

If called from an interactive session, tries to reload autoloads files (if
necessary), reinistalize doom (via ‘doom-initialize’) and reloads your private
init.el and config.el. Then runs ‘doom-reload-hook’.

(fn &optional FORCE-P)
** SPC h r t
:PROPERTIES:
:CUSTOM_ID: 3bf5d7ff-8496-4e36-985f-a36310f6d6f2
:END:
*** Function
*doom/reload-theme*
*** Documentation
Reset the current color theme and fonts.
** SPC h 4 i
:PROPERTIES:
:CUSTOM_ID: c128a286-6e89-4174-8b91-048dc1c9cb73
:END:
*** Function
*info-other-window*
*** Documentation
Like ‘info’ but show the Info buffer in another window.

(fn &optional FILE-OR-NODE BUFFER)
** SPC m T
:PROPERTIES:
:CUSTOM_ID: 7db925a0-16fd-4a34-9dc8-31db11e253fe
:END:
*** Function
*org-todo-list*
*** Documentation
Show all (not done) TODO entries from all agenda file in a single list.
The prefix arg can be used to select a specific TODO keyword and limit
the list to these.  When using ‘SPC u’, you will be prompted
for a keyword.  A numeric prefix directly selects the Nth keyword in
‘org-todo-keywords-1’.
** SPC m b
:PROPERTIES:
:CUSTOM_ID: cca6a822-c3c5-4ec6-9595-3eb1cf9208eb
:END:
*** Function
*org-switchb*
*** Documentation
Switch between Org buffers.

With ‘SPC u’ prefix, restrict available buffers to files.

With ‘SPC u SPC u’ prefix, restrict available buffers to agenda files.

(fn &optional ARG)
** SPC m d
:PROPERTIES:
:CUSTOM_ID: 1045bdf1-ac13-43ad-a5f5-b067b440cfb8
:END:
*** Function
*org-deadline*
*** Documentation
Insert the "DEADLINE:" string with a timestamp to make a deadline.
With one universal prefix argument, remove any deadline from the item.
With two universal prefix arguments, prompt for a warning delay.
With argument TIME, set the deadline at the corresponding date.  TIME
can either be an Org date like "2011-07-24" or a delta like "+2d".

(fn ARG &optional TIME)
** SPC m l
:PROPERTIES:
:CUSTOM_ID: 5be3b6e9-d8a5-4b9a-80f0-6a2103a8ed84
:END:
*** Function
*org-store-link*
