index.html
<div id="outline-container-org2a5af01" class="outline-3">
<h3 id="182c0b40-a9e2-4236-a89a-3ac64bb48fc3">SPC g o r</h3>
<div class="outline-text-3" id="text-182c0b40-a9e2-4236-a89a-3ac64bb48fc3">
</div>
<div id="outline-container-org03a767a" class="outline-4">
<h4 id="org03a767a">Function</h4>
<div class="outline-text-4" id="text-org03a767a">
<p>
<b>forge-browse-remote</b>
</p>
</div>
</div>
<div id="outline-container-org344556b" class="outline-4">
<h4 id="org344556b">Documentation</h4>
<div class="outline-text-4" id="text-org344556b">
<p>
Visit the url corresponding to REMOTE using a browser.
</p>

<p>
(fn REMOTE)
</p>
</div>
</div>
</div>
<div id="outline-container-org04206d2" class="outline-3">
<h3 id="6b7a629d-6bf6-4a76-965d-4066280988c5">SPC g f c</h3>
<div class="outline-text-3" id="text-6b7a629d-6bf6-4a76-965d-4066280988c5">
</div>
<div id="outline-container-orge479f76" class="outline-4">
<h4 id="orge479f76">Function</h4>
<div class="outline-text-4" id="text-orge479f76">
<p>
<b>magit-show-commit</b>
</p>
</div>
</div>
<div id="outline-container-org71b2cc8" class="outline-4">
<h4 id="org71b2cc8">Documentation</h4>
<div class="outline-text-4" id="text-org71b2cc8">
<p>
Visit the revision at point in another buffer.
If there is no revision at point or with a prefix argument prompt
for a revision.
</p>

<p>
(fn REV &amp;optional ARGS FILES MODULE)
</p>
</div>
</div>
</div>
<div id="outline-container-org2475d57" class="outline-3">
<h3 id="86f5d314-2e50-4f2e-8500-c78b780fc00e">SPC g f f</h3>
<div class="outline-text-3" id="text-86f5d314-2e50-4f2e-8500-c78b780fc00e">
</div>
<div id="outline-container-orgbcba21f" class="outline-4">
<h4 id="orgbcba21f">Function</h4>
<div class="outline-text-4" id="text-orgbcba21f">
<p>
<b>magit-find-file</b>
</p>
</div>
</div>
<div id="outline-container-org17acd93" class="outline-4">
<h4 id="org17acd93">Documentation</h4>
<div class="outline-text-4" id="text-org17acd93">
<p>
View FILE from REV.
Switch to a buffer visiting blob REV:FILE,
creating one if none already exists.
</p>

<p>
(fn REV FILE)
</p>
</div>
</div>
</div>
<div id="outline-container-orgad93343" class="outline-3">
<h3 id="077c5d67-8fa3-48fc-a08b-744b8c2beb0e">SPC g f g</h3>
<div class="outline-text-3" id="text-077c5d67-8fa3-48fc-a08b-744b8c2beb0e">
</div>
<div id="outline-container-org35ca855" class="outline-4">
<h4 id="org35ca855">Function</h4>
<div class="outline-text-4" id="text-org35ca855">
<p>
<b>magit-find-git-config-file</b>
</p>
</div>
</div>
<div id="outline-container-org3f1644f" class="outline-4">
<h4 id="org3f1644f">Documentation</h4>
<div class="outline-text-4" id="text-org3f1644f">
<p>
Edit a file located in the current repositorys git directory.
</p>

<p>
When ".git", located at the root of the working tree, is a
regular file, then that makes it cumbersome to open a file
located in the actual git directory.
</p>

<p>
This command is like find-file, except that it temporarily
binds default-directory to the actual git directory, while
reading the FILENAME.
</p>

<p>
(fn FILENAME &amp;optional WILDCARDS)
</p>
</div>
</div>
</div>
<div id="outline-container-orge38b62e" class="outline-3">
<h3 id="5958338c-bf28-46bc-b0c0-b137fc9d5082">SPC g f i</h3>
<div class="outline-text-3" id="text-5958338c-bf28-46bc-b0c0-b137fc9d5082">
</div>
<div id="outline-container-orgbb89c0a" class="outline-4">
<h4 id="orgbb89c0a">Function</h4>
<div class="outline-text-4" id="text-orgbb89c0a">
<p>
<b>forge-visit-issue</b>
</p>
</div>
</div>
<div id="outline-container-org36fa8da" class="outline-4">
<h4 id="org36fa8da">Documentation</h4>
<div class="outline-text-4" id="text-org36fa8da">
<p>
View the issue at point in a separate buffer.
</p>

<p>
(fn ISSUE)
</p>
</div>
</div>
</div>
<div id="outline-container-org7e32c02" class="outline-3">
<h3 id="d32a6b0c-f2f5-468b-b26d-88a717f753c9">SPC g f p</h3>
<div class="outline-text-3" id="text-d32a6b0c-f2f5-468b-b26d-88a717f753c9">
</div>
<div id="outline-container-org96a16ee" class="outline-4">
<h4 id="org96a16ee">Function</h4>
<div class="outline-text-4" id="text-org96a16ee">
<p>
<b>forge-visit-pullreq</b>
</p>
</div>
</div>
<div id="outline-container-org8c3f2e5" class="outline-4">
<h4 id="org8c3f2e5">Documentation</h4>
<div class="outline-text-4" id="text-org8c3f2e5">
<p>
View the pull-request at point in a separate buffer.
</p>

<p>
(fn PULLREQ)
</p>
</div>
</div>
</div>
<div id="outline-container-org0e2722b" class="outline-3">
<h3 id="2201b894-1e0e-4dd4-987e-4e65685d6749">SPC h r P</h3>
<div class="outline-text-3" id="text-2201b894-1e0e-4dd4-987e-4e65685d6749">
</div>
<div id="outline-container-orgfc5ef74" class="outline-4">
<h4 id="orgfc5ef74">Function</h4>
<div class="outline-text-4" id="text-orgfc5ef74">
<p>
<b>doom/reload-project</b>
</p>
</div>
</div>
<div id="outline-container-org4fdffcf" class="outline-4">
<h4 id="org4fdffcf">Documentation</h4>
<div class="outline-text-4" id="text-org4fdffcf">
<p>
Reload the project root cache.
</p>
</div>
</div>
</div>
<div id="outline-container-orge1e75f3" class="outline-3">
<h3 id="21d92b57-2205-4dbb-886a-f3336695a92b">SPC h r f</h3>
<div class="outline-text-3" id="text-21d92b57-2205-4dbb-886a-f3336695a92b">
</div>
<div id="outline-container-org15fe328" class="outline-4">
<h4 id="org15fe328">Function</h4>
<div class="outline-text-4" id="text-org15fe328">
<p>
<b>doom/reload-font</b>
</p>
</div>
</div>
<div id="outline-container-org04c9117" class="outline-4">
<h4 id="org04c9117">Documentation</h4>
<div class="outline-text-4" id="text-org04c9117">
<p>
Reload doom-font, doom-variable-pitch-font, and doom-unicode-font, if
set.
</p>
</div>
</div>
</div>
<div id="outline-container-org4fe79cb" class="outline-3">
<h3 id="94759093-d634-4121-8011-53a323c3d8e6">SPC h r p</h3>
<div class="outline-text-3" id="text-94759093-d634-4121-8011-53a323c3d8e6">
</div>
<div id="outline-container-orge8217fe" class="outline-4">
<h4 id="orge8217fe">Function</h4>
<div class="outline-text-4" id="text-orge8217fe">
<p>
<b>doom/reload-packages</b>
</p>
</div>
</div>
<div id="outline-container-orgf6d0c1f" class="outline-4">
<h4 id="orgf6d0c1f">Documentation</h4>
<div class="outline-text-4" id="text-orgf6d0c1f">
<p>
Reload doom-packages, package and quelpa.
</p>
</div>
</div>
</div>
<div id="outline-container-org6579661" class="outline-3">
<h3 id="eccc3764-d1ea-4c9f-8948-a5e69b287d66">SPC h r r</h3>
<div class="outline-text-3" id="text-eccc3764-d1ea-4c9f-8948-a5e69b287d66">
</div>
<div id="outline-container-org99fc0a1" class="outline-4">
<h4 id="org99fc0a1">Function</h4>
<div class="outline-text-4" id="text-org99fc0a1">
<p>
<b>doom/reload</b>
</p>
</div>
</div>
<div id="outline-container-org925e197" class="outline-4">
<h4 id="org925e197">Documentation</h4>
<div class="outline-text-4" id="text-org925e197">
<p>
Reloads your config. This is experimental!
</p>

<p>
If called from a noninteractive session, this will try to communicate with a
live server (if one is found) to tell it to run this function.
</p>

<p>
If called from an interactive session, tries to reload autoloads files (if
necessary), reinistalize doom (via doom-initialize) and reloads your private
init.el and config.el. Then runs doom-reload-hook.
</p>

<p>
(fn &amp;optional FORCE-P)
</p>
</div>
</div>
</div>
<div id="outline-container-org63cebfe" class="outline-3">
<h3 id="3bf5d7ff-8496-4e36-985f-a36310f6d6f2">SPC h r t</h3>
<div class="outline-text-3" id="text-3bf5d7ff-8496-4e36-985f-a36310f6d6f2">
</div>
<div id="outline-container-org7a8eac4" class="outline-4">
<h4 id="org7a8eac4">Function</h4>
<div class="outline-text-4" id="text-org7a8eac4">
<p>
<b>doom/reload-theme</b>
</p>
</div>
</div>
<div id="outline-container-org722efb9" class="outline-4">
<h4 id="org722efb9">Documentation</h4>
<div class="outline-text-4" id="text-org722efb9">
<p>
Reset the current color theme and fonts.
</p>
</div>
</div>
</div>
<div id="outline-container-orge99f3cb" class="outline-3">
<h3 id="c128a286-6e89-4174-8b91-048dc1c9cb73">SPC h 4 i</h3>
<div class="outline-text-3" id="text-c128a286-6e89-4174-8b91-048dc1c9cb73">
</div>
<div id="outline-container-orgeb86a8f" class="outline-4">
<h4 id="orgeb86a8f">Function</h4>
<div class="outline-text-4" id="text-orgeb86a8f">
<p>
<b>info-other-window</b>
</p>
</div>
</div>
<div id="outline-container-org6a26838" class="outline-4">
<h4 id="org6a26838">Documentation</h4>
<div class="outline-text-4" id="text-org6a26838">
<p>
Like info but show the Info buffer in another window.
</p>

<p>
(fn &amp;optional FILE-OR-NODE BUFFER)
</p>
</div>
</div>
</div>
<div id="outline-container-org815380f" class="outline-3">
<h3 id="7db925a0-16fd-4a34-9dc8-31db11e253fe">SPC m T</h3>
<div class="outline-text-3" id="text-7db925a0-16fd-4a34-9dc8-31db11e253fe">
</div>
<div id="outline-container-orgb0073cf" class="outline-4">
<h4 id="orgb0073cf">Function</h4>
<div class="outline-text-4" id="text-orgb0073cf">
<p>
<b>org-todo-list</b>
</p>
</div>
</div>
<div id="outline-container-orgca6fe3a" class="outline-4">
<h4 id="orgca6fe3a">Documentation</h4>
<div class="outline-text-4" id="text-orgca6fe3a">
<p>
Show all (not done) TODO entries from all agenda file in a single list.
The prefix arg can be used to select a specific TODO keyword and limit
the list to these.  When using SPC u, you will be prompted
for a keyword.  A numeric prefix directly selects the Nth keyword in
org-todo-keywords-1.
</p>
</div>
</div>
</div>
<div id="outline-container-org6fe689f" class="outline-3">
<h3 id="cca6a822-c3c5-4ec6-9595-3eb1cf9208eb">SPC m b</h3>
<div class="outline-text-3" id="text-cca6a822-c3c5-4ec6-9595-3eb1cf9208eb">
</div>
<div id="outline-container-org97cbca5" class="outline-4">
<h4 id="org97cbca5">Function</h4>
<div class="outline-text-4" id="text-org97cbca5">
<p>
<b>org-switchb</b>
</p>
</div>
</div>
<div id="outline-container-orgffa16d5" class="outline-4">
<h4 id="orgffa16d5">Documentation</h4>
<div class="outline-text-4" id="text-orgffa16d5">
<p>
Switch between Org buffers.
</p>

<p>
With SPC u prefix, restrict available buffers to files.
</p>

<p>
With SPC u SPC u prefix, restrict available buffers to agenda files.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-orgcd01671" class="outline-3">
<h3 id="1045bdf1-ac13-43ad-a5f5-b067b440cfb8">SPC m d</h3>
<div class="outline-text-3" id="text-1045bdf1-ac13-43ad-a5f5-b067b440cfb8">
</div>
<div id="outline-container-org3a3969f" class="outline-4">
<h4 id="org3a3969f">Function</h4>
<div class="outline-text-4" id="text-org3a3969f">
<p>
<b>org-deadline</b>
</p>
</div>
</div>
<div id="outline-container-orgd36f3cd" class="outline-4">
<h4 id="orgd36f3cd">Documentation</h4>
<div class="outline-text-4" id="text-orgd36f3cd">
<p>
Insert the "DEADLINE:" string with a timestamp to make a deadline.
With one universal prefix argument, remove any deadline from the item.
With two universal prefix arguments, prompt for a warning delay.
With argument TIME, set the deadline at the corresponding date.  TIME
can either be an Org date like "2011-07-24" or a delta like "+2d".
</p>

<p>
(fn ARG &amp;optional TIME)
</p>
</div>
</div>
</div>
