index.org
*** Documentation
Store a link to the current location.

This link is added to ‘org-stored-links’ and can later be inserted
into an Org buffer with ‘org-insert-link’ (‘C-c C-l’).

For some link types, a ‘M-x universal-argument’ prefix ARG is interpreted.  A single
‘M-x universal-argument’ negates ‘org-context-in-file-links’ for file links or
‘org-gnus-prefer-web-links’ for links to Usenet articles.

A ‘M-x universal-argument M-x universal-argument’ prefix ARG forces skipping storing functions that are not
part of Org core.

A ‘M-x universal-argument M-x universal-argument M-x universal-argument’ prefix ARG forces storing a link for each line in the
active region.

Assume the function is called interactively if INTERACTIVE? is
non-nil.

(fn ARG &optional INTERACTIVE\?)
** SPC m t
:PROPERTIES:
:CUSTOM_ID: 8aa0c3b4-fbf6-43e5-892e-fc119f243145
:END:
*** Function
*org-todo*
*** Documentation
Change the TODO state of an item.

The state of an item is given by a keyword at the start of the heading,
like
     *** TODO Write paper
     *** DONE Call mom

The different keywords are specified in the variable ‘org-todo-keywords’.
By default the available states are "TODO" and "DONE".  So, for this
example: when the item starts with TODO, it is changed to DONE.
When it starts with DONE, the DONE is removed.  And when neither TODO nor
DONE are present, add TODO at the beginning of the heading.

With ‘SPC u’ prefix ARG, use completion to determine the new state.
With numeric prefix ARG, switch to that state.
With a ‘SPC u SPC u’ prefix, switch to the next set of TODO keywords (nextset).
With a ‘SPC u SPC u SPC u’ prefix, circumvent any state blocking.
With a numeric prefix arg of 0, inhibit note taking for the change.
With a numeric prefix arg of -1, cancel repeater to allow marking as DONE.

When called through ELisp, arg is also interpreted in the following way:
‘none’        -> empty state
""            -> switch to empty state
‘done’        -> switch to DONE
‘nextset’     -> switch to the next set of keywords
‘previousset’ -> switch to the previous set of keywords
"WAITING"     -> switch to the specified keyword, but only if it
                 really is a member of ‘org-todo-keywords’.

(fn &optional ARG)
** SPC m e M
:PROPERTIES:
:CUSTOM_ID: 8cc8ffb0-da2a-41ff-831b-5f07bbb91f8a
:END:
*** Function
*org-md-export-as-markdown*
*** Documentation
Export current buffer to a Markdown buffer.

If narrowing is active in the current buffer, only export its
narrowed part.

If a region is active, export that region.

A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting buffer should be accessible
through the ‘org-export-stack’ interface.

When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.

When optional argument VISIBLE-ONLY is non-nil, don’t export
contents of hidden elements.

Export is done in a buffer named "*Org MD Export*", which will
be displayed when ‘org-export-show-temporary-export-buffer’ is
non-nil.

(fn &optional ASYNC SUBTREEP VISIBLE-ONLY)
** SPC m e R
:PROPERTIES:
:CUSTOM_ID: 29a2cc23-01b8-4421-9bbb-4bc7de5f2893
:END:
*** Function
*org-reveal-export-to-html-and-browse*
*** Documentation
Export current buffer to a reveal.js and browse HTML file.
** SPC m e m
:PROPERTIES:
:CUSTOM_ID: 3c5332fa-b591-4632-99c6-a23c5610f214
:END:
*** Function
*org-md-export-to-markdown*
*** Documentation
Export current buffer to a Markdown file.

If narrowing is active in the current buffer, only export its
narrowed part.

If a region is active, export that region.

A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting file should be accessible through
the ‘org-export-stack’ interface.

When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.

When optional argument VISIBLE-ONLY is non-nil, don’t export
contents of hidden elements.

Return output file’s name.

(fn &optional ASYNC SUBTREEP VISIBLE-ONLY)
** SPC m e r
:PROPERTIES:
:CUSTOM_ID: de0c9d8a-5112-4598-ad5b-2a418024d98f
:END:
*** Function
*org-reveal-export-to-html*
*** Documentation
Export current buffer to a reveal.js HTML file.
** SPC m c C
:PROPERTIES:
:CUSTOM_ID: 76eda266-e262-44da-b736-d3c0fc02c453
:END:
*** Function
*org-clock-out*
*** Documentation
Stop the currently running clock.
Throw an error if there is no running clock and FAIL-QUIETLY is nil.
With a universal prefix, prompt for a state to switch the clocked out task
to, overriding the existing value of ‘org-clock-out-switch-to-state’.

(fn &optional SWITCH-TO-STATE FAIL-QUIETLY AT-TIME)
** SPC m c c
:PROPERTIES:
:CUSTOM_ID: c2b90f65-f0c4-4f62-9049-a567a28b66db
:END:
*** Function
*org-clock-in*
*** Documentation
Start the clock on the current item.

If necessary, clock-out of the currently active clock.

With a ‘SPC u’ prefix argument SELECT, offer a list of recently clocked
tasks to clock into.

When SELECT is ‘SPC u SPC u’, clock into the current task and mark it as
the default task, a special task that will always be offered in the
clocking selection, associated with the letter ‘d’.

When SELECT is ‘SPC u SPC u SPC u’, clock in by using the last clock-out
time as the start time.  See ‘org-clock-continuously’ to make this
the default behavior.

(fn &optional SELECT START-TIME)
** SPC m c g
:PROPERTIES:
:CUSTOM_ID: 02bdcf39-e46e-47a3-b7be-afab6bca2b06
:END:
*** Function
*org-clock-goto*
*** Documentation
Go to the currently clocked-in entry, or to the most recently clocked one.
With prefix arg SELECT, offer recently clocked tasks for selection.

(fn &optional SELECT)
** SPC m c x
:PROPERTIES:
:CUSTOM_ID: f0aaaacc-fc23-46b0-8f0a-bcbaf226df82
:END:
*** Function
*org-clock-cancel*
