index.html
<div id="outline-container-org34e1534" class="outline-3">
<h3 id="5be3b6e9-d8a5-4b9a-80f0-6a2103a8ed84">SPC m l</h3>
<div class="outline-text-3" id="text-5be3b6e9-d8a5-4b9a-80f0-6a2103a8ed84">
</div>
<div id="outline-container-org8b1239e" class="outline-4">
<h4 id="org8b1239e">Function</h4>
<div class="outline-text-4" id="text-org8b1239e">
<p>
<b>org-store-link</b>
</p>
</div>
</div>
<div id="outline-container-orgf73e3eb" class="outline-4">
<h4 id="orgf73e3eb">Documentation</h4>
<div class="outline-text-4" id="text-orgf73e3eb">
<p>
Store a link to the current location.
</p>

<p>
This link is added to org-stored-links and can later be inserted
into an Org buffer with org-insert-link (C-c C-l).
</p>

<p>
For some link types, a M-x universal-argument prefix ARG is interpreted.  A single
M-x universal-argument negates org-context-in-file-links for file links or
org-gnus-prefer-web-links for links to Usenet articles.
</p>

<p>
A M-x universal-argument M-x universal-argument prefix ARG forces skipping storing functions that are not
part of Org core.
</p>

<p>
A M-x universal-argument M-x universal-argument M-x universal-argument prefix ARG forces storing a link for each line in the
active region.
</p>

<p>
Assume the function is called interactively if INTERACTIVE? is
non-nil.
</p>

<p>
(fn ARG &amp;optional INTERACTIVE\?)
</p>
</div>
</div>
</div>
<div id="outline-container-orgbfa937d" class="outline-3">
<h3 id="8aa0c3b4-fbf6-43e5-892e-fc119f243145">SPC m t</h3>
<div class="outline-text-3" id="text-8aa0c3b4-fbf6-43e5-892e-fc119f243145">
</div>
<div id="outline-container-orgf169fef" class="outline-4">
<h4 id="orgf169fef">Function</h4>
<div class="outline-text-4" id="text-orgf169fef">
<p>
<b>org-todo</b>
</p>
</div>
</div>
<div id="outline-container-org3424c5e" class="outline-4">
<h4 id="org3424c5e">Documentation</h4>
<div class="outline-text-4" id="text-org3424c5e">
<p>
Change the TODO state of an item.
</p>

<p>
The state of an item is given by a keyword at the start of the heading,
like
     <b>*</b> TODO Write paper
     <b>*</b> DONE Call mom
</p>

<p>
The different keywords are specified in the variable org-todo-keywords.
By default the available states are "TODO" and "DONE".  So, for this
example: when the item starts with TODO, it is changed to DONE.
When it starts with DONE, the DONE is removed.  And when neither TODO nor
DONE are present, add TODO at the beginning of the heading.
</p>

<p>
With SPC u prefix ARG, use completion to determine the new state.
With numeric prefix ARG, switch to that state.
With a SPC u SPC u prefix, switch to the next set of TODO keywords (nextset).
With a SPC u SPC u SPC u prefix, circumvent any state blocking.
With a numeric prefix arg of 0, inhibit note taking for the change.
With a numeric prefix arg of -1, cancel repeater to allow marking as DONE.
</p>

<p>
When called through ELisp, arg is also interpreted in the following way:
none        -&gt; empty state
""            -&gt; switch to empty state
done        -&gt; switch to DONE
nextset     -&gt; switch to the next set of keywords
previousset -&gt; switch to the previous set of keywords
"WAITING"     -&gt; switch to the specified keyword, but only if it
                 really is a member of org-todo-keywords.
</p>

<p>
(fn &amp;optional ARG)
</p>
</div>
</div>
</div>
<div id="outline-container-org8e64335" class="outline-3">
<h3 id="8cc8ffb0-da2a-41ff-831b-5f07bbb91f8a">SPC m e M</h3>
<div class="outline-text-3" id="text-8cc8ffb0-da2a-41ff-831b-5f07bbb91f8a">
</div>
<div id="outline-container-org9f8db9b" class="outline-4">
<h4 id="org9f8db9b">Function</h4>
<div class="outline-text-4" id="text-org9f8db9b">
<p>
<b>org-md-export-as-markdown</b>
</p>
</div>
</div>
<div id="outline-container-orgf564f74" class="outline-4">
<h4 id="orgf564f74">Documentation</h4>
<div class="outline-text-4" id="text-orgf564f74">
<p>
Export current buffer to a Markdown buffer.
</p>

<p>
If narrowing is active in the current buffer, only export its
narrowed part.
</p>

<p>
If a region is active, export that region.
</p>

<p>
A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting buffer should be accessible
through the org-export-stack interface.
</p>

<p>
When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.
</p>

<p>
When optional argument VISIBLE-ONLY is non-nil, dont export
contents of hidden elements.
</p>

<p>
Export is done in a buffer named "<b>Org MD Export</b>", which will
be displayed when org-export-show-temporary-export-buffer is
non-nil.
</p>

<p>
(fn &amp;optional ASYNC SUBTREEP VISIBLE-ONLY)
</p>
</div>
</div>
</div>
<div id="outline-container-org0580435" class="outline-3">
<h3 id="29a2cc23-01b8-4421-9bbb-4bc7de5f2893">SPC m e R</h3>
<div class="outline-text-3" id="text-29a2cc23-01b8-4421-9bbb-4bc7de5f2893">
</div>
<div id="outline-container-orgaa9af18" class="outline-4">
<h4 id="orgaa9af18">Function</h4>
<div class="outline-text-4" id="text-orgaa9af18">
<p>
<b>org-reveal-export-to-html-and-browse</b>
</p>
</div>
</div>
<div id="outline-container-org04f99d4" class="outline-4">
<h4 id="org04f99d4">Documentation</h4>
<div class="outline-text-4" id="text-org04f99d4">
<p>
Export current buffer to a reveal.js and browse HTML file.
</p>
</div>
</div>
</div>
<div id="outline-container-org82d80f2" class="outline-3">
<h3 id="3c5332fa-b591-4632-99c6-a23c5610f214">SPC m e m</h3>
<div class="outline-text-3" id="text-3c5332fa-b591-4632-99c6-a23c5610f214">
</div>
<div id="outline-container-orgfb7fb44" class="outline-4">
<h4 id="orgfb7fb44">Function</h4>
<div class="outline-text-4" id="text-orgfb7fb44">
<p>
<b>org-md-export-to-markdown</b>
</p>
</div>
</div>
<div id="outline-container-org2ae1f20" class="outline-4">
<h4 id="org2ae1f20">Documentation</h4>
<div class="outline-text-4" id="text-org2ae1f20">
<p>
Export current buffer to a Markdown file.
</p>

<p>
If narrowing is active in the current buffer, only export its
narrowed part.
</p>

<p>
If a region is active, export that region.
</p>

<p>
A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting file should be accessible through
the org-export-stack interface.
</p>

<p>
When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.
</p>

<p>
When optional argument VISIBLE-ONLY is non-nil, dont export
contents of hidden elements.
</p>

<p>
Return output files name.
</p>

<p>
(fn &amp;optional ASYNC SUBTREEP VISIBLE-ONLY)
</p>
</div>
</div>
</div>
<div id="outline-container-org47f1964" class="outline-3">
<h3 id="de0c9d8a-5112-4598-ad5b-2a418024d98f">SPC m e r</h3>
<div class="outline-text-3" id="text-de0c9d8a-5112-4598-ad5b-2a418024d98f">
</div>
<div id="outline-container-orgae244eb" class="outline-4">
<h4 id="orgae244eb">Function</h4>
<div class="outline-text-4" id="text-orgae244eb">
<p>
<b>org-reveal-export-to-html</b>
</p>
</div>
</div>
<div id="outline-container-org4a5854e" class="outline-4">
<h4 id="org4a5854e">Documentation</h4>
<div class="outline-text-4" id="text-org4a5854e">
<p>
Export current buffer to a reveal.js HTML file.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcaafe5f" class="outline-3">
<h3 id="76eda266-e262-44da-b736-d3c0fc02c453">SPC m c C</h3>
<div class="outline-text-3" id="text-76eda266-e262-44da-b736-d3c0fc02c453">
</div>
<div id="outline-container-org238e4c0" class="outline-4">
<h4 id="org238e4c0">Function</h4>
<div class="outline-text-4" id="text-org238e4c0">
<p>
<b>org-clock-out</b>
</p>
</div>
</div>
<div id="outline-container-org9a2c429" class="outline-4">
<h4 id="org9a2c429">Documentation</h4>
<div class="outline-text-4" id="text-org9a2c429">
<p>
Stop the currently running clock.
Throw an error if there is no running clock and FAIL-QUIETLY is nil.
With a universal prefix, prompt for a state to switch the clocked out task
to, overriding the existing value of org-clock-out-switch-to-state.
</p>

<p>
(fn &amp;optional SWITCH-TO-STATE FAIL-QUIETLY AT-TIME)
</p>
</div>
</div>
</div>
<div id="outline-container-org007091c" class="outline-3">
<h3 id="c2b90f65-f0c4-4f62-9049-a567a28b66db">SPC m c c</h3>
<div class="outline-text-3" id="text-c2b90f65-f0c4-4f62-9049-a567a28b66db">
</div>
<div id="outline-container-orga5d8d1e" class="outline-4">
<h4 id="orga5d8d1e">Function</h4>
<div class="outline-text-4" id="text-orga5d8d1e">
<p>
<b>org-clock-in</b>
</p>
</div>
</div>
<div id="outline-container-org557915f" class="outline-4">
<h4 id="org557915f">Documentation</h4>
<div class="outline-text-4" id="text-org557915f">
<p>
Start the clock on the current item.
</p>

<p>
If necessary, clock-out of the currently active clock.
</p>

<p>
With a SPC u prefix argument SELECT, offer a list of recently clocked
tasks to clock into.
</p>

<p>
When SELECT is SPC u SPC u, clock into the current task and mark it as
the default task, a special task that will always be offered in the
clocking selection, associated with the letter d.
</p>

<p>
When SELECT is SPC u SPC u SPC u, clock in by using the last clock-out
time as the start time.  See org-clock-continuously to make this
the default behavior.
</p>

<p>
(fn &amp;optional SELECT START-TIME)
</p>
</div>
</div>
</div>
<div id="outline-container-org006eee2" class="outline-3">
<h3 id="02bdcf39-e46e-47a3-b7be-afab6bca2b06">SPC m c g</h3>
<div class="outline-text-3" id="text-02bdcf39-e46e-47a3-b7be-afab6bca2b06">
</div>
<div id="outline-container-org8db0eb6" class="outline-4">
<h4 id="org8db0eb6">Function</h4>
<div class="outline-text-4" id="text-org8db0eb6">
<p>
<b>org-clock-goto</b>
</p>
</div>
</div>
<div id="outline-container-org4547246" class="outline-4">
<h4 id="org4547246">Documentation</h4>
<div class="outline-text-4" id="text-org4547246">
<p>
Go to the currently clocked-in entry, or to the most recently clocked one.
With prefix arg SELECT, offer recently clocked tasks for selection.
</p>

<p>
(fn &amp;optional SELECT)
</p>
</div>
</div>
</div>
