index.org
*** Documentation
Cancel the running clock by removing the start timestamp.
** SPC m e b L
:PROPERTIES:
:CUSTOM_ID: e041a4d0-bdcf-4ff8-8081-ce4bed7eb304
:END:
*** Function
*org-beamer-export-as-latex*
*** Documentation
Export current buffer as a Beamer buffer.

If narrowing is active in the current buffer, only export its
narrowed part.

If a region is active, export that region.

A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting buffer should be accessible
through the ‘org-export-stack’ interface.

When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.

When optional argument VISIBLE-ONLY is non-nil, don’t export
contents of hidden elements.

When optional argument BODY-ONLY is non-nil, only write code
between "\begin{document}" and "\end{document}".

EXT-PLIST, when provided, is a property list with external
parameters overriding Org default settings, but still inferior to
file-local settings.

Export is done in a buffer named "*Org BEAMER Export*", which
will be displayed when ‘org-export-show-temporary-export-buffer’
is non-nil.

(fn &optional ASYNC SUBTREEP VISIBLE-ONLY BODY-ONLY EXT-PLIST)
** SPC m e b l
:PROPERTIES:
:CUSTOM_ID: 9e5b67be-850d-491d-8b45-a9e30d289ed9
:END:
*** Function
*org-beamer-export-to-latex*
*** Documentation
Export current buffer as a Beamer presentation (tex).

If narrowing is active in the current buffer, only export its
narrowed part.

If a region is active, export that region.

A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting file should be accessible through
the ‘org-export-stack’ interface.

When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.

When optional argument VISIBLE-ONLY is non-nil, don’t export
contents of hidden elements.

When optional argument BODY-ONLY is non-nil, only write code
between "\begin{document}" and "\end{document}".

EXT-PLIST, when provided, is a property list with external
parameters overriding Org default settings, but still inferior to
file-local settings.

Return output file’s name.

(fn &optional ASYNC SUBTREEP VISIBLE-ONLY BODY-ONLY EXT-PLIST)
** SPC m e b p
:PROPERTIES:
:CUSTOM_ID: e26eee8c-b4e3-40bd-81ea-69910c34fd8d
:END:
*** Function
*org-beamer-export-to-pdf*
*** Documentation
Export current buffer as a Beamer presentation (PDF).

If narrowing is active in the current buffer, only export its
narrowed part.

If a region is active, export that region.

A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting file should be accessible through
the ‘org-export-stack’ interface.

When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.

When optional argument VISIBLE-ONLY is non-nil, don’t export
contents of hidden elements.

When optional argument BODY-ONLY is non-nil, only write code
between "\begin{document}" and "\end{document}".

EXT-PLIST, when provided, is a property list with external
parameters overriding Org default settings, but still inferior to
file-local settings.

Return PDF file’s name.

(fn &optional ASYNC SUBTREEP VISIBLE-ONLY BODY-ONLY EXT-PLIST)
