index.html
<div id="outline-container-org811f5a6" class="outline-3">
<h3 id="f0aaaacc-fc23-46b0-8f0a-bcbaf226df82">SPC m c x</h3>
<div class="outline-text-3" id="text-f0aaaacc-fc23-46b0-8f0a-bcbaf226df82">
</div>
<div id="outline-container-org338e3f8" class="outline-4">
<h4 id="org338e3f8">Function</h4>
<div class="outline-text-4" id="text-org338e3f8">
<p>
<b>org-clock-cancel</b>
</p>
</div>
</div>
<div id="outline-container-orgc0dcb1c" class="outline-4">
<h4 id="orgc0dcb1c">Documentation</h4>
<div class="outline-text-4" id="text-orgc0dcb1c">
<p>
Cancel the running clock by removing the start timestamp.
</p>
</div>
</div>
</div>
<div id="outline-container-org4055b06" class="outline-3">
<h3 id="e041a4d0-bdcf-4ff8-8081-ce4bed7eb304">SPC m e b L</h3>
<div class="outline-text-3" id="text-e041a4d0-bdcf-4ff8-8081-ce4bed7eb304">
</div>
<div id="outline-container-org40c42c8" class="outline-4">
<h4 id="org40c42c8">Function</h4>
<div class="outline-text-4" id="text-org40c42c8">
<p>
<b>org-beamer-export-as-latex</b>
</p>
</div>
</div>
<div id="outline-container-org4406a9a" class="outline-4">
<h4 id="org4406a9a">Documentation</h4>
<div class="outline-text-4" id="text-org4406a9a">
<p>
Export current buffer as a Beamer buffer.
</p>

<p>
If narrowing is active in the current buffer, only export its
narrowed part.
</p>

<p>
If a region is active, export that region.
</p>

<p>
A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting buffer should be accessible
through the org-export-stack interface.
</p>

<p>
When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.
</p>

<p>
When optional argument VISIBLE-ONLY is non-nil, dont export
contents of hidden elements.
</p>

<p>
When optional argument BODY-ONLY is non-nil, only write code
between "\begin{document}" and "\end{document}".
</p>

<p>
EXT-PLIST, when provided, is a property list with external
parameters overriding Org default settings, but still inferior to
file-local settings.
</p>

<p>
Export is done in a buffer named "<b>Org BEAMER Export</b>", which
will be displayed when org-export-show-temporary-export-buffer
is non-nil.
</p>

<p>
(fn &amp;optional ASYNC SUBTREEP VISIBLE-ONLY BODY-ONLY EXT-PLIST)
</p>
</div>
</div>
</div>
<div id="outline-container-orgab77d4f" class="outline-3">
<h3 id="9e5b67be-850d-491d-8b45-a9e30d289ed9">SPC m e b l</h3>
<div class="outline-text-3" id="text-9e5b67be-850d-491d-8b45-a9e30d289ed9">
</div>
<div id="outline-container-org18f5ba0" class="outline-4">
<h4 id="org18f5ba0">Function</h4>
<div class="outline-text-4" id="text-org18f5ba0">
<p>
<b>org-beamer-export-to-latex</b>
</p>
</div>
</div>
<div id="outline-container-org128f24d" class="outline-4">
<h4 id="org128f24d">Documentation</h4>
<div class="outline-text-4" id="text-org128f24d">
<p>
Export current buffer as a Beamer presentation (tex).
</p>

<p>
If narrowing is active in the current buffer, only export its
narrowed part.
</p>

<p>
If a region is active, export that region.
</p>

<p>
A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting file should be accessible through
the org-export-stack interface.
</p>

<p>
When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.
</p>

<p>
When optional argument VISIBLE-ONLY is non-nil, dont export
contents of hidden elements.
</p>

<p>
When optional argument BODY-ONLY is non-nil, only write code
between "\begin{document}" and "\end{document}".
</p>

<p>
EXT-PLIST, when provided, is a property list with external
parameters overriding Org default settings, but still inferior to
file-local settings.
</p>

<p>
Return output files name.
</p>

<p>
(fn &amp;optional ASYNC SUBTREEP VISIBLE-ONLY BODY-ONLY EXT-PLIST)
</p>
</div>
</div>
</div>
<div id="outline-container-org548eda4" class="outline-3">
<h3 id="e26eee8c-b4e3-40bd-81ea-69910c34fd8d">SPC m e b p</h3>
<div class="outline-text-3" id="text-e26eee8c-b4e3-40bd-81ea-69910c34fd8d">
</div>
<div id="outline-container-org8da7689" class="outline-4">
<h4 id="org8da7689">Function</h4>
<div class="outline-text-4" id="text-org8da7689">
<p>
<b>org-beamer-export-to-pdf</b>
</p>
</div>
</div>
<div id="outline-container-org0cc1a62" class="outline-4">
<h4 id="org0cc1a62">Documentation</h4>
<div class="outline-text-4" id="text-org0cc1a62">
<p>
Export current buffer as a Beamer presentation (PDF).
</p>

<p>
If narrowing is active in the current buffer, only export its
narrowed part.
</p>

<p>
If a region is active, export that region.
</p>

<p>
A non-nil optional argument ASYNC means the process should happen
asynchronously.  The resulting file should be accessible through
the org-export-stack interface.
</p>

<p>
When optional argument SUBTREEP is non-nil, export the sub-tree
at point, extracting information from the headline properties
first.
</p>

<p>
When optional argument VISIBLE-ONLY is non-nil, dont export
contents of hidden elements.
</p>

<p>
When optional argument BODY-ONLY is non-nil, only write code
between "\begin{document}" and "\end{document}".
</p>

<p>
EXT-PLIST, when provided, is a property list with external
parameters overriding Org default settings, but still inferior to
file-local settings.
</p>

<p>
Return PDF files name.
</p>

<p>
(fn &amp;optional ASYNC SUBTREEP VISIBLE-ONLY BODY-ONLY EXT-PLIST)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jason Scott</p>
<p class="date">Created: 2019-03-21 Thu 12:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
